J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
	<name>TC37X</name>
	<version>1.0.0</version>
	<description>TC37X</description>
	<cpu>
		<name>CM4</name>
		<revision>r0p1</revision>
		<endian>little</endian>
		<mpuPresent>true</mpuPresent>
		<fpuPresent>true</fpuPresent>
		<vtorPresent>1</vtorPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>8</width>
	<peripherals>
		<peripheral>
			<name>CPU0</name>
			<version>100</version>
			<description>ce_cpu</description>
			<groupName>CPU0</groupName>
			<baseAddress>0x70000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x3C000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>PFI0</name>
			<version>100</version>
			<description>ce_pfi</description>
			<groupName>PFI0</groupName>
			<baseAddress>0xA8080000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x80000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ECCR</name>
					<description>ECC Read Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RCODE</name>
							<description>Error Correction Read Code - RCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>22</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECCS</name>
					<description>ECC Status Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ERR1</name>
							<description>Read Access Single Bit ECC Error - ERR1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR2</name>
							<description>Read Access Double Bit ECC Error - ERR2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Read Access Multi-bit ECC Error - ERRM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRA</name>
							<description>Read Access ECC Error Within the Address - ERRA</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ALL0</name>
							<description>Read Access All Zeros - ALL0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ALL1</name>
							<description>All Ones - ALL1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRANY</name>
							<description>Any Read Access ECC Error - ERRANY</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER1</name>
							<description>Accumulated Single Bit ECC Errors - AER1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER2</name>
							<description>Accumulated Double Bit ECC Errors - AER2</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AERM</name>
							<description>Accumulated Multi-bit ECC Errors - AERM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ARRA</name>
							<description>Accumulated ECC Error Within the Address - ARRA</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AAL0</name>
							<description>Accumulated All Zeros - AAL0</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AAL1</name>
							<description>Accumulated All Ones - AAL1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AERANY</name>
							<description>Accumulated Any Read Access ECC Error - AERANY</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD0</name>
					<description>SBAB Record 0</description>
					<addressOffset>0x2000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD1</name>
					<description>SBAB Record 1</description>
					<addressOffset>0x2020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD2</name>
					<description>SBAB Record 2</description>
					<addressOffset>0x2040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD3</name>
					<description>SBAB Record 3</description>
					<addressOffset>0x2060</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD4</name>
					<description>SBAB Record 4</description>
					<addressOffset>0x2080</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD5</name>
					<description>SBAB Record 5</description>
					<addressOffset>0x20A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD6</name>
					<description>SBAB Record 6</description>
					<addressOffset>0x20C0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD7</name>
					<description>SBAB Record 7</description>
					<addressOffset>0x20E0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD8</name>
					<description>SBAB Record 8</description>
					<addressOffset>0x2100</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD9</name>
					<description>SBAB Record 9</description>
					<addressOffset>0x2120</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD10</name>
					<description>SBAB Record 10</description>
					<addressOffset>0x2140</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD11</name>
					<description>SBAB Record 11</description>
					<addressOffset>0x2160</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD12</name>
					<description>SBAB Record 12</description>
					<addressOffset>0x2180</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD13</name>
					<description>SBAB Record 13</description>
					<addressOffset>0x21A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD14</name>
					<description>SBAB Record 14</description>
					<addressOffset>0x21C0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD15</name>
					<description>SBAB Record 15</description>
					<addressOffset>0x21E0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SBABRECORD16</name>
					<description>SBAB Record 16</description>
					<addressOffset>0x2200</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBABRECORD0</name>
					<description>DBAB Record 0</description>
					<addressOffset>0x4000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBABRECORD1</name>
					<description>DBAB Record 1</description>
					<addressOffset>0x4020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MBABRECORD0</name>
					<description>MBAB Record 0</description>
					<addressOffset>0x8000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
