J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>DBABRECORD0</name>
					<description>DBAB Record 0</description>
					<addressOffset>0x4000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBABRECORD1</name>
					<description>DBAB Record 1</description>
					<addressOffset>0x4020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MBABRECORD0</name>
					<description>MBAB Record 0</description>
					<addressOffset>0x8000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZBABRECORD0</name>
					<description>ZBAB Record 0</description>
					<addressOffset>0xC000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZBABRECORD1</name>
					<description>ZBAB Record 1</description>
					<addressOffset>0xC020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZBABRECORD2</name>
					<description>ZBAB Record 2</description>
					<addressOffset>0xC040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZBABRECORD3</name>
					<description>ZBAB Record 3</description>
					<addressOffset>0xC060</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address - ADDR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECMK</name>
							<description>Erase Counter Marker - ECMK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VLD</name>
							<description>Valid - VLD</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
