J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CPU2</name>
			<version>100</version>
			<description>ce_cpu</description>
			<groupName>CPU2</groupName>
			<baseAddress>0x50000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x18000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>FSI</name>
			<version>100</version>
			<description>ce_fsi</description>
			<groupName>FSI</groupName>
			<baseAddress>0xF8030000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>COMM_1</name>
					<description>Communication Register 1</description>
					<addressOffset>0x4</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xff</resetMask>
					<fields>
						<field>
							<name>COMM1</name>
							<description>FSI Communication 1 - COMM1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMM_2</name>
					<description>Communication Register 2</description>
					<addressOffset>0x5</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xff</resetMask>
					<fields>
						<field>
							<name>COMM2</name>
							<description>FSI Communication 2 - COMM2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMCOMM_1</name>
					<description>HSM Communication Register 1</description>
					<addressOffset>0x6</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xff</resetMask>
					<fields>
						<field>
							<name>HSMCOMM1</name>
							<description>HSM FSI Communication 1 - HSMCOMM1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMCOMM_2</name>
					<description>HSM Communication Register 2</description>
					<addressOffset>0x7</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xff</resetMask>
					<fields>
						<field>
							<name>HSMCOMM2</name>
							<description>HSM FSI Communication 2 - HSMCOMM2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DMU</name>
			<version>100</version>
			<description>ce_dmu</description>
			<groupName>DMU</groupName>
			<baseAddress>0xF8040000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>HF_ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xe7c000</resetValue>
					<resetMask>0xffff00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number - MOD_REV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type - MOD_TYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value - MOD_NUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_REV</name>
							<description>Flash Revision - FLASH_REV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_STATUS</name>
					<description>Flash Status Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>D0BUSY</name>
							<description>Data Flash Bank 0 Busy - D0BUSY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>D1BUSY</name>
							<description>Data Flash Bank 1 Busy - D1BUSY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P0BUSY</name>
							<description>Program Flash PF0BUSY - P0BUSY</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P1BUSY</name>
							<description>Program Flash PF1BUSY - P1BUSY</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DFPAGE</name>
							<description>Data Flash in Page Mode - DFPAGE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PFPAGE</name>
							<description>Program Flash in Page Mode - PFPAGE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONTROL</name>
					<description>Flash Control Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x320</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FSIENPE</name>
							<description>Enable Program/Erase - FSIENPE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WSERRINJ</name>
							<description>PFlash Wait State ECC error injection - WSERRINJ</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DDFP</name>
							<description>Disable Read from PFLASH - DDFP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DDFD</name>
							<description>Disable Data Fetch from DF0_EEPROM - DDFD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPROG</name>
							<description>Clear Programming State - CPROG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CERASE</name>
							<description>Clear Erase State - CERASE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_OPERATION</name>
					<description>Flash Operation Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PROG</name>
							<description>Programming State - PROG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERASE</name>
							<description>Erase State - ERASE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROTECT</name>
					<description>Flash Protection Status Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PRODISP</name>
							<description>PFLASH Protection Disabled - PRODISP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISD</name>
							<description>DFLASH Protection Disabled - PRODISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISDBG</name>
							<description>Debug Interface Password Protection Disabled - PRODISDBG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISEC</name>
							<description>Erase Counter Priority Protection Disabled - PRODISEC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISBMHD</name>
							<description>BMHD Protection Disabled - PRODISBMHD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISSWAP</name>
							<description>UCB_SWAP protection Disabled - PRODISSWAP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISP0</name>
							<description>Program Flash Protection Disable PRODISP0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PRODISP1</name>
							<description>Program Flash Protection Disable PRODISP1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SRT</name>
							<description>Secure Retest Password Protection Disabled - SRT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONFIRM0</name>
					<description>Flash Confirm Status Register 0</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PROINBMHD0O</name>
							<description>UCB_BMHD0_ORIG Confirmation - PROINBMHD0O</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD1O</name>
							<description>UCB_BMHD1_ORIG Confirmation - PROINBMHD1O</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD2O</name>
							<description>UCB_BMHD2_ORIG Confirmation - PROINBMHD2O</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD3O</name>
							<description>UCB_BMHD3_ORIG Confirmation - PROINBMHD3O</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINSSW</name>
							<description>UCB_SSW Confirmation - PROINSSW</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINUSER</name>
							<description>UCB_USER Confirmation - PROINUSER</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINTEST</name>
							<description>UCB_TEST Confirmation - PROINTEST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCFG</name>
							<description>UCB_HSMCFG Confirmation - PROINHSMCFG</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD0C</name>
							<description>UCB_BMHD0_COPY Confirmation - PROINBMHD0C</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD1C</name>
							<description>UCB_BMHD1_COPY Confirmation - PROINBMHD1C</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD2C</name>
							<description>UCB_BMHD2_COPY Confirmation - PROINBMHD2C</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINBMHD3C</name>
							<description>UCB_BMHD3_COPY Confirmation - PROINBMHD3C</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINREDSEC</name>
							<description>UCB_REDSEC Confirmation - PROINREDSEC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINSRT</name>
							<description>UCB_RETEST Confirmation - PROINSRT</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONFIRM1</name>
					<description>Flash Confirm Status Register 1</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PROINPO</name>
							<description>UCB_PFLASH_ORIG Confirmation - PROINPO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDO</name>
							<description>UCB_DFLASH_ORIG Confirmation - PROINDO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDBGO</name>
							<description>UCB_DBG_ORIG Confirmation - PROINDBGO</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMO</name>
							<description>UCB_HSM_ORIG Confirmation - PROINHSMO</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP0O</name>
							<description>UCB_HSMCOTP0_ORIG Protection - PROINHSMCOTP0O</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP1O</name>
							<description>UCB_HSMCOTP1_ORIG Protection - PROINHSMCOTP1O</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINECO</name>
							<description>UCB_ECPRIO_ORIG Confirmation - PROINECO</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINPC</name>
							<description>UCB_PFLASH_COPY Confirmation - PROINPC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDC</name>
							<description>UCB_DFLASH_COPY Confirmation - PROINDC</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINDBGC</name>
							<description>UCB_DBG_COPY Interface Confirmation - PROINDBGC</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMC</name>
							<description>UCB_HSM_COPY Confirmation - PROINHSMC</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP0C</name>
							<description>UCB_HSMCOTP0_COPY Protection - PROINHSMCOTP0C</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINHSMCOTP1C</name>
							<description>UCB_HSMCOTP1_COPY Protection - PROINHSMCOTP1C</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINECC</name>
							<description>UCB_ECPRIO_COPY Confirmation - PROINECC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CONFIRM2</name>
					<description>Flash Confirm Status Register 2</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PROINOTP0O</name>
							<description>UCB_OTP0_ORIG Confirmation - PROINOTP0O</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP1O</name>
							<description>UCB_OTP1_ORIG Confirmation - PROINOTP1O</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP2O</name>
							<description>UCB_OTP2_ORIG Confirmation - PROINOTP2O</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP3O</name>
							<description>UCB_OTP3_ORIG Confirmation - PROINOTP3O</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP4O</name>
							<description>UCB_OTP4_ORIG Confirmation - PROINOTP4O</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP5O</name>
							<description>UCB_OTP5_ORIG Confirmation - PROINOTP5O</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP6O</name>
							<description>UCB_OTP6_ORIG Confirmation - PROINOTP6O</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP7O</name>
							<description>UCB_OTP7_ORIG Confirmation - PROINOTP7O</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP0C</name>
							<description>UCB_OTP0_COPY Confirmation - PROINOTP0C</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP1C</name>
							<description>UCB_OTP1_COPY Confirmation - PROINOTP1C</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP2C</name>
							<description>UCB_OTP2_COPY Confirmation - PROINOTP2C</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP3C</name>
							<description>UCB_OTP3_COPY Confirmation - PROINOTP3C</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP4C</name>
							<description>UCB_OTP4_COPY Confirmation - PROINOTP4C</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP5C</name>
							<description>UCB_OTP5_COPY Confirmation - PROINOTP5C</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP6C</name>
							<description>UCB_OTP6_COPY Confirmation - PROINOTP6C</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROINOTP7C</name>
							<description>UCB_OTP7_COPY Confirmation - PROINOTP7C</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_EER</name>
					<description>Enable Error Interrupt Control Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OPERM</name>
							<description>Operation Error Interrupt Mask - OPERM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SQERM</name>
							<description>Command Sequence Error Interrupt Mask - SQERM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PROERM</name>
							<description>Protection Error Interrupt Mask - PROERM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PVERM</name>
							<description>Program Verify Error Interrupt Mask - PVERM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVERM</name>
							<description>Erase Verify Error Interrupt Mask - EVERM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EOBM</name>
							<description>End of Busy Interrupt Mask - EOBM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
