J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HF_ERRSR</name>
					<description>Error Status Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OPER</name>
							<description>Flash Operation Error - OPER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SQER</name>
							<description>Command Sequence Error - SQER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROER</name>
							<description>Protection Error - PROER</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PVER</name>
							<description>Program Verify Error - PVER</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVER</name>
							<description>Erase Verify Error - EVER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADER</name>
							<description>SRI Bus Address ECC Error - ADER</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ORIER</name>
							<description>Original Error - ORIER</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CLRE</name>
					<description>Clear Error Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CSQER</name>
							<description>Clear Command Sequence Error - CSQER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CPROER</name>
							<description>Clear Protection Error - CPROER</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CPVER</name>
							<description>Clear Program Verify Error - CPVER</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEVER</name>
							<description>Clear Erase Verify Error - CEVER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CADER</name>
							<description>Clear SRI Bus Address ECC Error - CADER</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCR</name>
					<description>DF0 ECC Read Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RCODE</name>
							<description>Error Correction Read Code - RCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>22</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCS</name>
					<description>DF0 ECC Status Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ERR1</name>
							<description>Read Access Single Bit ECC Error - ERR1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR2</name>
							<description>Read Access Double Bit ECC Error - ERR2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR3</name>
							<description>Read Access Triple Bit ECC Error - ERR3</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Read Access Multi-bit ECC Error - ERRM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRANY</name>
							<description>Any Read Access ECC Error - ERRANY</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLANKA</name>
							<description>Read Access Blank Analog - BLANKA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER1</name>
							<description>Accumulated Single Bit ECC Errors - AER1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER2</name>
							<description>Accumulated Double Bit ECC Errors - AER2</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER3</name>
							<description>Accumulated Triple Bit ECC Errors - AER3</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AERM</name>
							<description>Accumulated Multi-bit ECC Errors - AERM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AERANY</name>
							<description>Accumulated Any Read Access ECC Error - AERANY</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ABLANKA</name>
							<description>Accumulated Blank Analog - ABLANKA</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCC</name>
					<description>DF0 ECC Control Register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xc0000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Clear ECC status bits - CLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ECCCORDIS</name>
							<description>Host Command Interface ECC Correction Disable - ECCCORDIS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRAPDIS</name>
							<description>Host Command Interface Uncorrectable ECC Bit Error Trap Disable - TRAPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ECCW</name>
					<description>DF0 ECC Write Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WCODE</name>
							<description>Error Correction Write Code - WCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>22</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PECENCDIS</name>
							<description>PFLASH ECC Encoding Disable - PECENCDIS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DECENCDIS</name>
							<description>DFLASH ECC Encoding Disable - DECENCDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_CCONTROL</name>
					<description>Cranking Control Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CRANKING</name>
							<description>Cranking Mode Control - CRANKING</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PSTATUS</name>
					<description>Power Status Register</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SLEEP</name>
							<description>Sleep Mode - SLEEP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>Dynamic Idle - IDLE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DEMAND</name>
							<description>Demand - DEMAND</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PCONTROL</name>
					<description>Power Control Register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x30000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SLEEP</name>
							<description>Sleep Mode Control - SLEEP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>Dynamic Idle Enable - IDLE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DEMAND</name>
							<description>Demand Enable - DEMAND</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESLDIS</name>
							<description>External Sleep Mode Request Disable - ESLDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PR5V</name>
							<description>Programming Supply 5V - PR5V</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PWAIT</name>
					<description>PFLASH Wait Cycle Register</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x716040b</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RFLASH</name>
							<description>Operation Mode - RFLASH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RECC</name>
							<description>Operation Mode - RECC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFLASH</name>
							<description>Cranking Mode - CFLASH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CECC</name>
							<description>Cranking Mode - CECC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_DWAIT</name>
					<description>DFLASH Wait Cycle Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x4000b</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RFLASH</name>
							<description>Operation Mode - RFLASH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RECC</name>
							<description>Operation Mode - RECC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONUSR</name>
					<description>DF0 User Mode Control</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>DF0 User Mode Control - MODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONPF</name>
					<description>PFLASH Protection Configuration</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RPRO</name>
							<description>Read Protection Configuration - RPRO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONTP</name>
					<description>Tuning Protection Configuration</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TP</name>
							<description>Tuning Protection - TP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BML</name>
							<description>Boot Mode Lock - BML</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWAPEN</name>
							<description>Enable SOTA mode - SWAPEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0DDIS</name>
							<description>Disable direct LPB access</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1DDIS</name>
							<description>Disable direct LPB access</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONDF</name>
					<description>DFLASH Protection Configuration</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>L</name>
							<description>DF0_EEPROM Locked for Write Protection - L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HYSEN</name>
							<description>Hysteresis enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HYSCTL</name>
							<description>Hysteresis Control</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AMPCTL</name>
							<description>Amplitude Control</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OSCCFG</name>
							<description>OSC Configuration by SSW - OSCCFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODE</name>
							<description>OSC Mode - MODE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APREN</name>
							<description>OSC Amplitude Regulation Enable - APREN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP0EN</name>
							<description>OSC Capacitance 0 Enable (x=0-3) - CAP0EN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP1EN</name>
							<description>OSC Capacitance 1 Enable (x=0-3) - CAP1EN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP2EN</name>
							<description>OSC Capacitance 2 Enable (x=0-3) - CAP2EN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP3EN</name>
							<description>OSC Capacitance 3 Enable (x=0-3) - CAP3EN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0CNT</name>
							<description>ESR0 Prolongation Counter - ESR0CNT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RPRO</name>
							<description>Read Protection Configuration - RPRO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONRAM</name>
					<description>RAM Configuration</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RAMIN</name>
							<description>RAM Initialization by SSW Control - RAMIN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RAMINSEL</name>
							<description>RAM Initialization Selection - RAMINSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LMUINSEL</name>
							<description>LMU Initialization Selection - LMUINSEL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_PROCONDBG</name>
					<description>Debug Interface Protection Configuration</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OCDSDIS</name>
							<description>OCDS Disabled - OCDSDIS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBGIFLCK</name>
							<description>Debug Interface Locked - DBGIFLCK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EDM</name>
							<description>Entered Debug Mode - EDM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TIC</name>
							<description>Tool Interface Control - TIC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_SUSPEND</name>
					<description>Suspend Control Register</description>
					<addressOffset>0xF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQ</name>
							<description>Suspend Request - REQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Suspend Clear - CLR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SPND</name>
							<description>Flash Operation Suspended - SPND</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Suspend Error - ERR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_MARGIN</name>
					<description>Margin Control Register</description>
					<addressOffset>0xF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SELD0</name>
							<description>DF0 Margin Read Selection - SELD0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HMARGIN</name>
							<description>Hard Margin Selection - HMARGIN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HF_ACCEN1</name>
					<description>Access Enable Register 1</description>
					<addressOffset>0xF8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
