J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONP02</name>
					<description>PFLASH Bank 0 Protection Configuration 2</description>
					<addressOffset>0x10008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64L</name>
							<description>PFLASH p Sector 64 Locked for Write Protection - S64L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65L</name>
							<description>PFLASH p Sector 65 Locked for Write Protection - S65L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66L</name>
							<description>PFLASH p Sector 66 Locked for Write Protection - S66L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67L</name>
							<description>PFLASH p Sector 67 Locked for Write Protection - S67L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68L</name>
							<description>PFLASH p Sector 68 Locked for Write Protection - S68L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69L</name>
							<description>PFLASH p Sector 69 Locked for Write Protection - S69L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70L</name>
							<description>PFLASH p Sector 70 Locked for Write Protection - S70L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71L</name>
							<description>PFLASH p Sector 71 Locked for Write Protection - S71L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72L</name>
							<description>PFLASH p Sector 72 Locked for Write Protection - S72L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73L</name>
							<description>PFLASH p Sector 73 Locked for Write Protection - S73L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74L</name>
							<description>PFLASH p Sector 74 Locked for Write Protection - S74L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75L</name>
							<description>PFLASH p Sector 75 Locked for Write Protection - S75L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76L</name>
							<description>PFLASH p Sector 76 Locked for Write Protection - S76L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77L</name>
							<description>PFLASH p Sector 77 Locked for Write Protection - S77L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78L</name>
							<description>PFLASH p Sector 78 Locked for Write Protection - S78L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79L</name>
							<description>PFLASH p Sector 79 Locked for Write Protection - S79L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80L</name>
							<description>PFLASH p Sector 80 Locked for Write Protection - S80L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81L</name>
							<description>PFLASH p Sector 81 Locked for Write Protection - S81L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82L</name>
							<description>PFLASH p Sector 82 Locked for Write Protection - S82L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83L</name>
							<description>PFLASH p Sector 83 Locked for Write Protection - S83L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84L</name>
							<description>PFLASH p Sector 84 Locked for Write Protection - S84L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85L</name>
							<description>PFLASH p Sector 85 Locked for Write Protection - S85L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86L</name>
							<description>PFLASH p Sector 86 Locked for Write Protection - S86L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87L</name>
							<description>PFLASH p Sector 87 Locked for Write Protection - S87L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88L</name>
							<description>PFLASH p Sector 88 Locked for Write Protection - S88L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89L</name>
							<description>PFLASH p Sector 89 Locked for Write Protection - S89L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90L</name>
							<description>PFLASH p Sector 90 Locked for Write Protection - S90L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91L</name>
							<description>PFLASH p Sector 91 Locked for Write Protection - S91L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92L</name>
							<description>PFLASH p Sector 92 Locked for Write Protection - S92L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93L</name>
							<description>PFLASH p Sector 93 Locked for Write Protection - S93L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94L</name>
							<description>PFLASH p Sector 94 Locked for Write Protection - S94L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95L</name>
							<description>PFLASH p Sector 95 Locked for Write Protection - S95L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONP03</name>
					<description>PFLASH Bank 0 Protection Configuration 3</description>
					<addressOffset>0x1000C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96L</name>
							<description>PFLASH p Sector 96 Locked for Write Protection - S96L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97L</name>
							<description>PFLASH p Sector 97 Locked for Write Protection - S97L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98L</name>
							<description>PFLASH p Sector 98 Locked for Write Protection - S98L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99L</name>
							<description>PFLASH p Sector 99 Locked for Write Protection - S99L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100L</name>
							<description>PFLASH p Sector 100 Locked for Write Protection - S100L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101L</name>
							<description>PFLASH p Sector 101 Locked for Write Protection - S101L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102L</name>
							<description>PFLASH p Sector 102 Locked for Write Protection - S102L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103L</name>
							<description>PFLASH p Sector 103 Locked for Write Protection - S103L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104L</name>
							<description>PFLASH p Sector 104 Locked for Write Protection - S104L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105L</name>
							<description>PFLASH p Sector 105 Locked for Write Protection - S105L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106L</name>
							<description>PFLASH p Sector 106 Locked for Write Protection - S106L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107L</name>
							<description>PFLASH p Sector 107 Locked for Write Protection - S107L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108L</name>
							<description>PFLASH p Sector 108 Locked for Write Protection - S108L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109L</name>
							<description>PFLASH p Sector 109 Locked for Write Protection - S109L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110L</name>
							<description>PFLASH p Sector 110 Locked for Write Protection - S110L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111L</name>
							<description>PFLASH p Sector 111 Locked for Write Protection - S111L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112L</name>
							<description>PFLASH p Sector 112 Locked for Write Protection - S112L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113L</name>
							<description>PFLASH p Sector 113 Locked for Write Protection - S113L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114L</name>
							<description>PFLASH p Sector 114 Locked for Write Protection - S114L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115L</name>
							<description>PFLASH p Sector 115 Locked for Write Protection - S115L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116L</name>
							<description>PFLASH p Sector 116 Locked for Write Protection - S116L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117L</name>
							<description>PFLASH p Sector 117 Locked for Write Protection - S117L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118L</name>
							<description>PFLASH p Sector 118 Locked for Write Protection - S118L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119L</name>
							<description>PFLASH p Sector 119 Locked for Write Protection - S119L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120L</name>
							<description>PFLASH p Sector 120 Locked for Write Protection - S120L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121L</name>
							<description>PFLASH p Sector 121 Locked for Write Protection - S121L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122L</name>
							<description>PFLASH p Sector 122 Locked for Write Protection - S122L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123L</name>
							<description>PFLASH p Sector 123 Locked for Write Protection - S123L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124L</name>
							<description>PFLASH p Sector 124 Locked for Write Protection - S124L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125L</name>
							<description>PFLASH p Sector 125 Locked for Write Protection - S125L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126L</name>
							<description>PFLASH p Sector 126 Locked for Write Protection - S126L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127L</name>
							<description>PFLASH p Sector 127 Locked for Write Protection - S127L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
