J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONOTP01</name>
					<description>PFLASH Bank 0 OTP Protection Configuration 1</description>
					<addressOffset>0x10044</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32ROM</name>
							<description>PFLASH p Sector 32 Locked for Forever - S32ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33ROM</name>
							<description>PFLASH p Sector 33 Locked for Forever - S33ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34ROM</name>
							<description>PFLASH p Sector 34 Locked for Forever - S34ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35ROM</name>
							<description>PFLASH p Sector 35 Locked for Forever - S35ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36ROM</name>
							<description>PFLASH p Sector 36 Locked for Forever - S36ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37ROM</name>
							<description>PFLASH p Sector 37 Locked for Forever - S37ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38ROM</name>
							<description>PFLASH p Sector 38 Locked for Forever - S38ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39ROM</name>
							<description>PFLASH p Sector 39 Locked for Forever - S39ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40ROM</name>
							<description>PFLASH p Sector 40 Locked for Forever - S40ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41ROM</name>
							<description>PFLASH p Sector 41 Locked for Forever - S41ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42ROM</name>
							<description>PFLASH p Sector 42 Locked for Forever - S42ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43ROM</name>
							<description>PFLASH p Sector 43 Locked for Forever - S43ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44ROM</name>
							<description>PFLASH p Sector 44 Locked for Forever - S44ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45ROM</name>
							<description>PFLASH p Sector 45 Locked for Forever - S45ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46ROM</name>
							<description>PFLASH p Sector 46 Locked for Forever - S46ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47ROM</name>
							<description>PFLASH p Sector 47 Locked for Forever - S47ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48ROM</name>
							<description>PFLASH p Sector 48 Locked for Forever - S48ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49ROM</name>
							<description>PFLASH p Sector 49 Locked for Forever - S49ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50ROM</name>
							<description>PFLASH p Sector 50 Locked for Forever - S50ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51ROM</name>
							<description>PFLASH p Sector 51 Locked for Forever - S51ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52ROM</name>
							<description>PFLASH p Sector 52 Locked for Forever - S52ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53ROM</name>
							<description>PFLASH p Sector 53 Locked for Forever - S53ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54ROM</name>
							<description>PFLASH p Sector 54 Locked for Forever - S54ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55ROM</name>
							<description>PFLASH p Sector 55 Locked for Forever - S55ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56ROM</name>
							<description>PFLASH p Sector 56 Locked for Forever - S56ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57ROM</name>
							<description>PFLASH p Sector 57 Locked for Forever - S57ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58ROM</name>
							<description>PFLASH p Sector 58 Locked for Forever - S58ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59ROM</name>
							<description>PFLASH p Sector 59 Locked for Forever - S59ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60ROM</name>
							<description>PFLASH p Sector 60 Locked for Forever - S60ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61ROM</name>
							<description>PFLASH p Sector 61 Locked for Forever - S61ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62ROM</name>
							<description>PFLASH p Sector 62 Locked for Forever - S62ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63ROM</name>
							<description>PFLASH p Sector 63 Locked for Forever - S63ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP02</name>
					<description>PFLASH Bank 0 OTP Protection Configuration 2</description>
					<addressOffset>0x10048</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64ROM</name>
							<description>PFLASH p Sector 64 Locked for Forever - S64ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65ROM</name>
							<description>PFLASH p Sector 65 Locked for Forever - S65ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66ROM</name>
							<description>PFLASH p Sector 66 Locked for Forever - S66ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67ROM</name>
							<description>PFLASH p Sector 67 Locked for Forever - S67ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68ROM</name>
							<description>PFLASH p Sector 68 Locked for Forever - S68ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69ROM</name>
							<description>PFLASH p Sector 69 Locked for Forever - S69ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70ROM</name>
							<description>PFLASH p Sector 70 Locked for Forever - S70ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71ROM</name>
							<description>PFLASH p Sector 71 Locked for Forever - S71ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72ROM</name>
							<description>PFLASH p Sector 72 Locked for Forever - S72ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73ROM</name>
							<description>PFLASH p Sector 73 Locked for Forever - S73ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74ROM</name>
							<description>PFLASH p Sector 74 Locked for Forever - S74ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75ROM</name>
							<description>PFLASH p Sector 75 Locked for Forever - S75ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76ROM</name>
							<description>PFLASH p Sector 76 Locked for Forever - S76ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77ROM</name>
							<description>PFLASH p Sector 77 Locked for Forever - S77ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78ROM</name>
							<description>PFLASH p Sector 78 Locked for Forever - S78ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79ROM</name>
							<description>PFLASH p Sector 79 Locked for Forever - S79ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80ROM</name>
							<description>PFLASH p Sector 80 Locked for Forever - S80ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81ROM</name>
							<description>PFLASH p Sector 81 Locked for Forever - S81ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82ROM</name>
							<description>PFLASH p Sector 82 Locked for Forever - S82ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83ROM</name>
							<description>PFLASH p Sector 83 Locked for Forever - S83ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84ROM</name>
							<description>PFLASH p Sector 84 Locked for Forever - S84ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85ROM</name>
							<description>PFLASH p Sector 85 Locked for Forever - S85ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86ROM</name>
							<description>PFLASH p Sector 86 Locked for Forever - S86ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87ROM</name>
							<description>PFLASH p Sector 87 Locked for Forever - S87ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88ROM</name>
							<description>PFLASH p Sector 88 Locked for Forever - S88ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89ROM</name>
							<description>PFLASH p Sector 89 Locked for Forever - S89ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90ROM</name>
							<description>PFLASH p Sector 90 Locked for Forever - S90ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91ROM</name>
							<description>PFLASH p Sector 91 Locked for Forever - S91ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92ROM</name>
							<description>PFLASH p Sector 92 Locked for Forever - S92ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93ROM</name>
							<description>PFLASH p Sector 93 Locked for Forever - S93ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94ROM</name>
							<description>PFLASH p Sector 94 Locked for Forever - S94ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95ROM</name>
							<description>PFLASH p Sector 95 Locked for Forever - S95ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP03</name>
					<description>PFLASH Bank 0 OTP Protection Configuration 3</description>
					<addressOffset>0x1004C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96ROM</name>
							<description>PFLASH p Sector 96 Locked for Forever - S96ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97ROM</name>
							<description>PFLASH p Sector 97 Locked for Forever - S97ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98ROM</name>
							<description>PFLASH p Sector 98 Locked for Forever - S98ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99ROM</name>
							<description>PFLASH p Sector 99 Locked for Forever - S99ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100ROM</name>
							<description>PFLASH p Sector 100 Locked for Forever - S100ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101ROM</name>
							<description>PFLASH p Sector 101 Locked for Forever - S101ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102ROM</name>
							<description>PFLASH p Sector 102 Locked for Forever - S102ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103ROM</name>
							<description>PFLASH p Sector 103 Locked for Forever - S103ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104ROM</name>
							<description>PFLASH p Sector 104 Locked for Forever - S104ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105ROM</name>
							<description>PFLASH p Sector 105 Locked for Forever - S105ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106ROM</name>
							<description>PFLASH p Sector 106 Locked for Forever - S106ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107ROM</name>
							<description>PFLASH p Sector 107 Locked for Forever - S107ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108ROM</name>
							<description>PFLASH p Sector 108 Locked for Forever - S108ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109ROM</name>
							<description>PFLASH p Sector 109 Locked for Forever - S109ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110ROM</name>
							<description>PFLASH p Sector 110 Locked for Forever - S110ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111ROM</name>
							<description>PFLASH p Sector 111 Locked for Forever - S111ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112ROM</name>
							<description>PFLASH p Sector 112 Locked for Forever - S112ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113ROM</name>
							<description>PFLASH p Sector 113 Locked for Forever - S113ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114ROM</name>
							<description>PFLASH p Sector 114 Locked for Forever - S114ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115ROM</name>
							<description>PFLASH p Sector 115 Locked for Forever - S115ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116ROM</name>
							<description>PFLASH p Sector 116 Locked for Forever - S116ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117ROM</name>
							<description>PFLASH p Sector 117 Locked for Forever - S117ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118ROM</name>
							<description>PFLASH p Sector 118 Locked for Forever - S118ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119ROM</name>
							<description>PFLASH p Sector 119 Locked for Forever - S119ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120ROM</name>
							<description>PFLASH p Sector 120 Locked for Forever - S120ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121ROM</name>
							<description>PFLASH p Sector 121 Locked for Forever - S121ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122ROM</name>
							<description>PFLASH p Sector 122 Locked for Forever - S122ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123ROM</name>
							<description>PFLASH p Sector 123 Locked for Forever - S123ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124ROM</name>
							<description>PFLASH p Sector 124 Locked for Forever - S124ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125ROM</name>
							<description>PFLASH p Sector 125 Locked for Forever - S125ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126ROM</name>
							<description>PFLASH p Sector 126 Locked for Forever - S126ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127ROM</name>
							<description>PFLASH p Sector 127 Locked for Forever - S127ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
