J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONOTP04</name>
					<description>PFLASH Bank 0 OTP Protection Configuration 4</description>
					<addressOffset>0x10050</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128ROM</name>
							<description>PFLASH p Sector 128 Locked for Forever - S128ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129ROM</name>
							<description>PFLASH p Sector 129 Locked for Forever - S129ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130ROM</name>
							<description>PFLASH p Sector 130 Locked for Forever - S130ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131ROM</name>
							<description>PFLASH p Sector 131 Locked for Forever - S131ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132ROM</name>
							<description>PFLASH p Sector 132 Locked for Forever - S132ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133ROM</name>
							<description>PFLASH p Sector 133 Locked for Forever - S133ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134ROM</name>
							<description>PFLASH p Sector 134 Locked for Forever - S134ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135ROM</name>
							<description>PFLASH p Sector 135 Locked for Forever - S135ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136ROM</name>
							<description>PFLASH p Sector 136 Locked for Forever - S136ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137ROM</name>
							<description>PFLASH p Sector 137 Locked for Forever - S137ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138ROM</name>
							<description>PFLASH p Sector 138 Locked for Forever - S138ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139ROM</name>
							<description>PFLASH p Sector 139 Locked for Forever - S139ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140ROM</name>
							<description>PFLASH p Sector 140 Locked for Forever - S140ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141ROM</name>
							<description>PFLASH p Sector 141 Locked for Forever - S141ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142ROM</name>
							<description>PFLASH p Sector 142 Locked for Forever - S142ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143ROM</name>
							<description>PFLASH p Sector 143 Locked for Forever - S143ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144ROM</name>
							<description>PFLASH p Sector 144 Locked for Forever - S144ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145ROM</name>
							<description>PFLASH p Sector 145 Locked for Forever - S145ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146ROM</name>
							<description>PFLASH p Sector 146 Locked for Forever - S146ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147ROM</name>
							<description>PFLASH p Sector 147 Locked for Forever - S147ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148ROM</name>
							<description>PFLASH p Sector 148 Locked for Forever - S148ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149ROM</name>
							<description>PFLASH p Sector 149 Locked for Forever - S149ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150ROM</name>
							<description>PFLASH p Sector 150 Locked for Forever - S150ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151ROM</name>
							<description>PFLASH p Sector 151 Locked for Forever - S151ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152ROM</name>
							<description>PFLASH p Sector 152 Locked for Forever - S152ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153ROM</name>
							<description>PFLASH p Sector 153 Locked for Forever - S153ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154ROM</name>
							<description>PFLASH p Sector 154 Locked for Forever - S154ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155ROM</name>
							<description>PFLASH p Sector 155 Locked for Forever - S155ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156ROM</name>
							<description>PFLASH p Sector 156 Locked for Forever - S156ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157ROM</name>
							<description>PFLASH p Sector 157 Locked for Forever - S157ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158ROM</name>
							<description>PFLASH p Sector 158 Locked for Forever - S158ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159ROM</name>
							<description>PFLASH p Sector 159 Locked for Forever - S159ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP05</name>
					<description>PFLASH Bank 0 OTP Protection Configuration 5</description>
					<addressOffset>0x10054</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160ROM</name>
							<description>PFLASH p Sector 160 Locked for Forever - S160ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161ROM</name>
							<description>PFLASH p Sector 161 Locked for Forever - S161ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162ROM</name>
							<description>PFLASH p Sector 162 Locked for Forever - S162ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163ROM</name>
							<description>PFLASH p Sector 163 Locked for Forever - S163ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164ROM</name>
							<description>PFLASH p Sector 164 Locked for Forever - S164ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165ROM</name>
							<description>PFLASH p Sector 165 Locked for Forever - S165ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166ROM</name>
							<description>PFLASH p Sector 166 Locked for Forever - S166ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167ROM</name>
							<description>PFLASH p Sector 167 Locked for Forever - S167ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168ROM</name>
							<description>PFLASH p Sector 168 Locked for Forever - S168ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169ROM</name>
							<description>PFLASH p Sector 169 Locked for Forever - S169ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170ROM</name>
							<description>PFLASH p Sector 170 Locked for Forever - S170ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171ROM</name>
							<description>PFLASH p Sector 171 Locked for Forever - S171ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172ROM</name>
							<description>PFLASH p Sector 172 Locked for Forever - S172ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173ROM</name>
							<description>PFLASH p Sector 173 Locked for Forever - S173ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174ROM</name>
							<description>PFLASH p Sector 174 Locked for Forever - S174ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175ROM</name>
							<description>PFLASH p Sector 175 Locked for Forever - S175ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176ROM</name>
							<description>PFLASH p Sector 176 Locked for Forever - S176ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177ROM</name>
							<description>PFLASH p Sector 177 Locked for Forever - S177ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178ROM</name>
							<description>PFLASH p Sector 178 Locked for Forever - S178ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179ROM</name>
							<description>PFLASH p Sector 179 Locked for Forever - S179ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180ROM</name>
							<description>PFLASH p Sector 180 Locked for Forever - S180ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181ROM</name>
							<description>PFLASH p Sector 181 Locked for Forever - S181ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182ROM</name>
							<description>PFLASH p Sector 182 Locked for Forever - S182ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183ROM</name>
							<description>PFLASH p Sector 183 Locked for Forever - S183ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184ROM</name>
							<description>PFLASH p Sector 184 Locked for Forever - S184ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185ROM</name>
							<description>PFLASH p Sector 185 Locked for Forever - S185ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186ROM</name>
							<description>PFLASH p Sector 186 Locked for Forever - S186ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187ROM</name>
							<description>PFLASH p Sector 187 Locked for Forever - S187ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188ROM</name>
							<description>PFLASH p Sector 188 Locked for Forever - S188ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189ROM</name>
							<description>PFLASH p Sector 189 Locked for Forever - S189ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190ROM</name>
							<description>PFLASH p Sector 190 Locked for Forever - S190ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191ROM</name>
							<description>PFLASH p Sector 191 Locked for Forever - S191ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
