J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONWOP04</name>
					<description>PFLASH Bank 0 WOP Configuration 4</description>
					<addressOffset>0x10090</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128WOP</name>
							<description>PFLASH p Sector 128 Configured for Write-Once Protection - S128WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129WOP</name>
							<description>PFLASH p Sector 129 Configured for Write-Once Protection - S129WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130WOP</name>
							<description>PFLASH p Sector 130 Configured for Write-Once Protection - S130WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131WOP</name>
							<description>PFLASH p Sector 131 Configured for Write-Once Protection - S131WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132WOP</name>
							<description>PFLASH p Sector 132 Configured for Write-Once Protection - S132WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133WOP</name>
							<description>PFLASH p Sector 133 Configured for Write-Once Protection - S133WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134WOP</name>
							<description>PFLASH p Sector 134 Configured for Write-Once Protection - S134WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135WOP</name>
							<description>PFLASH p Sector 135 Configured for Write-Once Protection - S135WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136WOP</name>
							<description>PFLASH p Sector 136 Configured for Write-Once Protection - S136WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137WOP</name>
							<description>PFLASH p Sector 137 Configured for Write-Once Protection - S137WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138WOP</name>
							<description>PFLASH p Sector 138 Configured for Write-Once Protection - S138WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139WOP</name>
							<description>PFLASH p Sector 139 Configured for Write-Once Protection - S139WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140WOP</name>
							<description>PFLASH p Sector 140 Configured for Write-Once Protection - S140WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141WOP</name>
							<description>PFLASH p Sector 141 Configured for Write-Once Protection - S141WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142WOP</name>
							<description>PFLASH p Sector 142 Configured for Write-Once Protection - S142WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143WOP</name>
							<description>PFLASH p Sector 143 Configured for Write-Once Protection - S143WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144WOP</name>
							<description>PFLASH p Sector 144 Configured for Write-Once Protection - S144WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145WOP</name>
							<description>PFLASH p Sector 145 Configured for Write-Once Protection - S145WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146WOP</name>
							<description>PFLASH p Sector 146 Configured for Write-Once Protection - S146WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147WOP</name>
							<description>PFLASH p Sector 147 Configured for Write-Once Protection - S147WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148WOP</name>
							<description>PFLASH p Sector 148 Configured for Write-Once Protection - S148WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149WOP</name>
							<description>PFLASH p Sector 149 Configured for Write-Once Protection - S149WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150WOP</name>
							<description>PFLASH p Sector 150 Configured for Write-Once Protection - S150WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151WOP</name>
							<description>PFLASH p Sector 151 Configured for Write-Once Protection - S151WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152WOP</name>
							<description>PFLASH p Sector 152 Configured for Write-Once Protection - S152WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153WOP</name>
							<description>PFLASH p Sector 153 Configured for Write-Once Protection - S153WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154WOP</name>
							<description>PFLASH p Sector 154 Configured for Write-Once Protection - S154WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155WOP</name>
							<description>PFLASH p Sector 155 Configured for Write-Once Protection - S155WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156WOP</name>
							<description>PFLASH p Sector 156 Configured for Write-Once Protection - S156WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157WOP</name>
							<description>PFLASH p Sector 157 Configured for Write-Once Protection - S157WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158WOP</name>
							<description>PFLASH p Sector 158 Configured for Write-Once Protection - S158WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159WOP</name>
							<description>PFLASH p Sector 159 Configured for Write-Once Protection - S159WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONWOP05</name>
					<description>PFLASH Bank 0 WOP Configuration 5</description>
					<addressOffset>0x10094</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160WOP</name>
							<description>PFLASH p Sector 160 Configured for Write-Once Protection - S160WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161WOP</name>
							<description>PFLASH p Sector 161 Configured for Write-Once Protection - S161WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162WOP</name>
							<description>PFLASH p Sector 162 Configured for Write-Once Protection - S162WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163WOP</name>
							<description>PFLASH p Sector 163 Configured for Write-Once Protection - S163WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164WOP</name>
							<description>PFLASH p Sector 164 Configured for Write-Once Protection - S164WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165WOP</name>
							<description>PFLASH p Sector 165 Configured for Write-Once Protection - S165WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166WOP</name>
							<description>PFLASH p Sector 166 Configured for Write-Once Protection - S166WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167WOP</name>
							<description>PFLASH p Sector 167 Configured for Write-Once Protection - S167WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168WOP</name>
							<description>PFLASH p Sector 168 Configured for Write-Once Protection - S168WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169WOP</name>
							<description>PFLASH p Sector 169 Configured for Write-Once Protection - S169WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170WOP</name>
							<description>PFLASH p Sector 170 Configured for Write-Once Protection - S170WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171WOP</name>
							<description>PFLASH p Sector 171 Configured for Write-Once Protection - S171WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172WOP</name>
							<description>PFLASH p Sector 172 Configured for Write-Once Protection - S172WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173WOP</name>
							<description>PFLASH p Sector 173 Configured for Write-Once Protection - S173WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174WOP</name>
							<description>PFLASH p Sector 174 Configured for Write-Once Protection - S174WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175WOP</name>
							<description>PFLASH p Sector 175 Configured for Write-Once Protection - S175WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176WOP</name>
							<description>PFLASH p Sector 176 Configured for Write-Once Protection - S176WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177WOP</name>
							<description>PFLASH p Sector 177 Configured for Write-Once Protection - S177WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178WOP</name>
							<description>PFLASH p Sector 178 Configured for Write-Once Protection - S178WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179WOP</name>
							<description>PFLASH p Sector 179 Configured for Write-Once Protection - S179WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180WOP</name>
							<description>PFLASH p Sector 180 Configured for Write-Once Protection - S180WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181WOP</name>
							<description>PFLASH p Sector 181 Configured for Write-Once Protection - S181WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182WOP</name>
							<description>PFLASH p Sector 182 Configured for Write-Once Protection - S182WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183WOP</name>
							<description>PFLASH p Sector 183 Configured for Write-Once Protection - S183WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184WOP</name>
							<description>PFLASH p Sector 184 Configured for Write-Once Protection - S184WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185WOP</name>
							<description>PFLASH p Sector 185 Configured for Write-Once Protection - S185WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186WOP</name>
							<description>PFLASH p Sector 186 Configured for Write-Once Protection - S186WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187WOP</name>
							<description>PFLASH p Sector 187 Configured for Write-Once Protection - S187WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188WOP</name>
							<description>PFLASH p Sector 188 Configured for Write-Once Protection - S188WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189WOP</name>
							<description>PFLASH p Sector 189 Configured for Write-Once Protection - S189WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190WOP</name>
							<description>PFLASH p Sector 190 Configured for Write-Once Protection - S190WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191WOP</name>
							<description>PFLASH p Sector 191 Configured for Write-Once Protection - S191WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
