J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONP10</name>
					<description>PFLASH Bank 1 Protection Configuration 0</description>
					<addressOffset>0x10100</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0L</name>
							<description>PFLASH p Sector 0 Locked for Write Protection - S0L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1L</name>
							<description>PFLASH p Sector 1 Locked for Write Protection - S1L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2L</name>
							<description>PFLASH p Sector 2 Locked for Write Protection - S2L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3L</name>
							<description>PFLASH p Sector 3 Locked for Write Protection - S3L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4L</name>
							<description>PFLASH p Sector 4 Locked for Write Protection - S4L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5L</name>
							<description>PFLASH p Sector 5 Locked for Write Protection - S5L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6L</name>
							<description>PFLASH p Sector 6 Locked for Write Protection - S6L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7L</name>
							<description>PFLASH p Sector 7 Locked for Write Protection - S7L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8L</name>
							<description>PFLASH p Sector 8 Locked for Write Protection - S8L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9L</name>
							<description>PFLASH p Sector 9 Locked for Write Protection - S9L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10L</name>
							<description>PFLASH p Sector 10 Locked for Write Protection - S10L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11L</name>
							<description>PFLASH p Sector 11 Locked for Write Protection - S11L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12L</name>
							<description>PFLASH p Sector 12 Locked for Write Protection - S12L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13L</name>
							<description>PFLASH p Sector 13 Locked for Write Protection - S13L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14L</name>
							<description>PFLASH p Sector 14 Locked for Write Protection - S14L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15L</name>
							<description>PFLASH p Sector 15 Locked for Write Protection - S15L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16L</name>
							<description>PFLASH p Sector 16 Locked for Write Protection - S16L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17L</name>
							<description>PFLASH p Sector 17 Locked for Write Protection - S17L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18L</name>
							<description>PFLASH p Sector 18 Locked for Write Protection - S18L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19L</name>
							<description>PFLASH p Sector 19 Locked for Write Protection - S19L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20L</name>
							<description>PFLASH p Sector 20 Locked for Write Protection - S20L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21L</name>
							<description>PFLASH p Sector 21 Locked for Write Protection - S21L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22L</name>
							<description>PFLASH p Sector 22 Locked for Write Protection - S22L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23L</name>
							<description>PFLASH p Sector 23 Locked for Write Protection - S23L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24L</name>
							<description>PFLASH p Sector 24 Locked for Write Protection - S24L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25L</name>
							<description>PFLASH p Sector 25 Locked for Write Protection - S25L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26L</name>
							<description>PFLASH p Sector 26 Locked for Write Protection - S26L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27L</name>
							<description>PFLASH p Sector 27 Locked for Write Protection - S27L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28L</name>
							<description>PFLASH p Sector 28 Locked for Write Protection - S28L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29L</name>
							<description>PFLASH p Sector 29 Locked for Write Protection - S29L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30L</name>
							<description>PFLASH p Sector 30 Locked for Write Protection - S30L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31L</name>
							<description>PFLASH p Sector 31 Locked for Write Protection - S31L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONP11</name>
					<description>PFLASH Bank 1 Protection Configuration 1</description>
					<addressOffset>0x10104</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32L</name>
							<description>PFLASH p Sector 32 Locked for Write Protection - S32L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33L</name>
							<description>PFLASH p Sector 33 Locked for Write Protection - S33L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34L</name>
							<description>PFLASH p Sector 34 Locked for Write Protection - S34L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35L</name>
							<description>PFLASH p Sector 35 Locked for Write Protection - S35L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36L</name>
							<description>PFLASH p Sector 36 Locked for Write Protection - S36L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37L</name>
							<description>PFLASH p Sector 37 Locked for Write Protection - S37L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38L</name>
							<description>PFLASH p Sector 38 Locked for Write Protection - S38L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39L</name>
							<description>PFLASH p Sector 39 Locked for Write Protection - S39L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40L</name>
							<description>PFLASH p Sector 40 Locked for Write Protection - S40L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41L</name>
							<description>PFLASH p Sector 41 Locked for Write Protection - S41L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42L</name>
							<description>PFLASH p Sector 42 Locked for Write Protection - S42L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43L</name>
							<description>PFLASH p Sector 43 Locked for Write Protection - S43L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44L</name>
							<description>PFLASH p Sector 44 Locked for Write Protection - S44L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45L</name>
							<description>PFLASH p Sector 45 Locked for Write Protection - S45L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46L</name>
							<description>PFLASH p Sector 46 Locked for Write Protection - S46L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47L</name>
							<description>PFLASH p Sector 47 Locked for Write Protection - S47L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48L</name>
							<description>PFLASH p Sector 48 Locked for Write Protection - S48L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49L</name>
							<description>PFLASH p Sector 49 Locked for Write Protection - S49L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50L</name>
							<description>PFLASH p Sector 50 Locked for Write Protection - S50L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51L</name>
							<description>PFLASH p Sector 51 Locked for Write Protection - S51L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52L</name>
							<description>PFLASH p Sector 52 Locked for Write Protection - S52L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53L</name>
							<description>PFLASH p Sector 53 Locked for Write Protection - S53L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54L</name>
							<description>PFLASH p Sector 54 Locked for Write Protection - S54L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55L</name>
							<description>PFLASH p Sector 55 Locked for Write Protection - S55L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56L</name>
							<description>PFLASH p Sector 56 Locked for Write Protection - S56L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57L</name>
							<description>PFLASH p Sector 57 Locked for Write Protection - S57L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58L</name>
							<description>PFLASH p Sector 58 Locked for Write Protection - S58L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59L</name>
							<description>PFLASH p Sector 59 Locked for Write Protection - S59L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60L</name>
							<description>PFLASH p Sector 60 Locked for Write Protection - S60L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61L</name>
							<description>PFLASH p Sector 61 Locked for Write Protection - S61L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62L</name>
							<description>PFLASH p Sector 62 Locked for Write Protection - S62L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63L</name>
							<description>PFLASH p Sector 63 Locked for Write Protection - S63L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONP12</name>
					<description>PFLASH Bank 1 Protection Configuration 2</description>
					<addressOffset>0x10108</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64L</name>
							<description>PFLASH p Sector 64 Locked for Write Protection - S64L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65L</name>
							<description>PFLASH p Sector 65 Locked for Write Protection - S65L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66L</name>
							<description>PFLASH p Sector 66 Locked for Write Protection - S66L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67L</name>
							<description>PFLASH p Sector 67 Locked for Write Protection - S67L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68L</name>
							<description>PFLASH p Sector 68 Locked for Write Protection - S68L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69L</name>
							<description>PFLASH p Sector 69 Locked for Write Protection - S69L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70L</name>
							<description>PFLASH p Sector 70 Locked for Write Protection - S70L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71L</name>
							<description>PFLASH p Sector 71 Locked for Write Protection - S71L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72L</name>
							<description>PFLASH p Sector 72 Locked for Write Protection - S72L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73L</name>
							<description>PFLASH p Sector 73 Locked for Write Protection - S73L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74L</name>
							<description>PFLASH p Sector 74 Locked for Write Protection - S74L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75L</name>
							<description>PFLASH p Sector 75 Locked for Write Protection - S75L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76L</name>
							<description>PFLASH p Sector 76 Locked for Write Protection - S76L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77L</name>
							<description>PFLASH p Sector 77 Locked for Write Protection - S77L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78L</name>
							<description>PFLASH p Sector 78 Locked for Write Protection - S78L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79L</name>
							<description>PFLASH p Sector 79 Locked for Write Protection - S79L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80L</name>
							<description>PFLASH p Sector 80 Locked for Write Protection - S80L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81L</name>
							<description>PFLASH p Sector 81 Locked for Write Protection - S81L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82L</name>
							<description>PFLASH p Sector 82 Locked for Write Protection - S82L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83L</name>
							<description>PFLASH p Sector 83 Locked for Write Protection - S83L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84L</name>
							<description>PFLASH p Sector 84 Locked for Write Protection - S84L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85L</name>
							<description>PFLASH p Sector 85 Locked for Write Protection - S85L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86L</name>
							<description>PFLASH p Sector 86 Locked for Write Protection - S86L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87L</name>
							<description>PFLASH p Sector 87 Locked for Write Protection - S87L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88L</name>
							<description>PFLASH p Sector 88 Locked for Write Protection - S88L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89L</name>
							<description>PFLASH p Sector 89 Locked for Write Protection - S89L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90L</name>
							<description>PFLASH p Sector 90 Locked for Write Protection - S90L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91L</name>
							<description>PFLASH p Sector 91 Locked for Write Protection - S91L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92L</name>
							<description>PFLASH p Sector 92 Locked for Write Protection - S92L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93L</name>
							<description>PFLASH p Sector 93 Locked for Write Protection - S93L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94L</name>
							<description>PFLASH p Sector 94 Locked for Write Protection - S94L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95L</name>
							<description>PFLASH p Sector 95 Locked for Write Protection - S95L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
