J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONP13</name>
					<description>PFLASH Bank 1 Protection Configuration 3</description>
					<addressOffset>0x1010C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96L</name>
							<description>PFLASH p Sector 96 Locked for Write Protection - S96L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97L</name>
							<description>PFLASH p Sector 97 Locked for Write Protection - S97L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98L</name>
							<description>PFLASH p Sector 98 Locked for Write Protection - S98L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99L</name>
							<description>PFLASH p Sector 99 Locked for Write Protection - S99L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100L</name>
							<description>PFLASH p Sector 100 Locked for Write Protection - S100L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101L</name>
							<description>PFLASH p Sector 101 Locked for Write Protection - S101L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102L</name>
							<description>PFLASH p Sector 102 Locked for Write Protection - S102L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103L</name>
							<description>PFLASH p Sector 103 Locked for Write Protection - S103L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104L</name>
							<description>PFLASH p Sector 104 Locked for Write Protection - S104L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105L</name>
							<description>PFLASH p Sector 105 Locked for Write Protection - S105L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106L</name>
							<description>PFLASH p Sector 106 Locked for Write Protection - S106L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107L</name>
							<description>PFLASH p Sector 107 Locked for Write Protection - S107L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108L</name>
							<description>PFLASH p Sector 108 Locked for Write Protection - S108L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109L</name>
							<description>PFLASH p Sector 109 Locked for Write Protection - S109L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110L</name>
							<description>PFLASH p Sector 110 Locked for Write Protection - S110L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111L</name>
							<description>PFLASH p Sector 111 Locked for Write Protection - S111L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112L</name>
							<description>PFLASH p Sector 112 Locked for Write Protection - S112L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113L</name>
							<description>PFLASH p Sector 113 Locked for Write Protection - S113L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114L</name>
							<description>PFLASH p Sector 114 Locked for Write Protection - S114L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115L</name>
							<description>PFLASH p Sector 115 Locked for Write Protection - S115L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116L</name>
							<description>PFLASH p Sector 116 Locked for Write Protection - S116L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117L</name>
							<description>PFLASH p Sector 117 Locked for Write Protection - S117L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118L</name>
							<description>PFLASH p Sector 118 Locked for Write Protection - S118L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119L</name>
							<description>PFLASH p Sector 119 Locked for Write Protection - S119L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120L</name>
							<description>PFLASH p Sector 120 Locked for Write Protection - S120L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121L</name>
							<description>PFLASH p Sector 121 Locked for Write Protection - S121L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122L</name>
							<description>PFLASH p Sector 122 Locked for Write Protection - S122L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123L</name>
							<description>PFLASH p Sector 123 Locked for Write Protection - S123L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124L</name>
							<description>PFLASH p Sector 124 Locked for Write Protection - S124L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125L</name>
							<description>PFLASH p Sector 125 Locked for Write Protection - S125L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126L</name>
							<description>PFLASH p Sector 126 Locked for Write Protection - S126L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127L</name>
							<description>PFLASH p Sector 127 Locked for Write Protection - S127L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONP14</name>
					<description>PFLASH Bank 1 Protection Configuration 4</description>
					<addressOffset>0x10110</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128L</name>
							<description>PFLASH p Sector 128 Locked for Write Protection - S128L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129L</name>
							<description>PFLASH p Sector 129 Locked for Write Protection - S129L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130L</name>
							<description>PFLASH p Sector 130 Locked for Write Protection - S130L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131L</name>
							<description>PFLASH p Sector 131 Locked for Write Protection - S131L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132L</name>
							<description>PFLASH p Sector 132 Locked for Write Protection - S132L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133L</name>
							<description>PFLASH p Sector 133 Locked for Write Protection - S133L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134L</name>
							<description>PFLASH p Sector 134 Locked for Write Protection - S134L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135L</name>
							<description>PFLASH p Sector 135 Locked for Write Protection - S135L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136L</name>
							<description>PFLASH p Sector 136 Locked for Write Protection - S136L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137L</name>
							<description>PFLASH p Sector 137 Locked for Write Protection - S137L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138L</name>
							<description>PFLASH p Sector 138 Locked for Write Protection - S138L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139L</name>
							<description>PFLASH p Sector 139 Locked for Write Protection - S139L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140L</name>
							<description>PFLASH p Sector 140 Locked for Write Protection - S140L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141L</name>
							<description>PFLASH p Sector 141 Locked for Write Protection - S141L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142L</name>
							<description>PFLASH p Sector 142 Locked for Write Protection - S142L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143L</name>
							<description>PFLASH p Sector 143 Locked for Write Protection - S143L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144L</name>
							<description>PFLASH p Sector 144 Locked for Write Protection - S144L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145L</name>
							<description>PFLASH p Sector 145 Locked for Write Protection - S145L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146L</name>
							<description>PFLASH p Sector 146 Locked for Write Protection - S146L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147L</name>
							<description>PFLASH p Sector 147 Locked for Write Protection - S147L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148L</name>
							<description>PFLASH p Sector 148 Locked for Write Protection - S148L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149L</name>
							<description>PFLASH p Sector 149 Locked for Write Protection - S149L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150L</name>
							<description>PFLASH p Sector 150 Locked for Write Protection - S150L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151L</name>
							<description>PFLASH p Sector 151 Locked for Write Protection - S151L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152L</name>
							<description>PFLASH p Sector 152 Locked for Write Protection - S152L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153L</name>
							<description>PFLASH p Sector 153 Locked for Write Protection - S153L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154L</name>
							<description>PFLASH p Sector 154 Locked for Write Protection - S154L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155L</name>
							<description>PFLASH p Sector 155 Locked for Write Protection - S155L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156L</name>
							<description>PFLASH p Sector 156 Locked for Write Protection - S156L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157L</name>
							<description>PFLASH p Sector 157 Locked for Write Protection - S157L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158L</name>
							<description>PFLASH p Sector 158 Locked for Write Protection - S158L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159L</name>
							<description>PFLASH p Sector 159 Locked for Write Protection - S159L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
