J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_PROCONWOP15</name>
					<description>PFLASH Bank 1 WOP Configuration 5</description>
					<addressOffset>0x10194</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160WOP</name>
							<description>PFLASH p Sector 160 Configured for Write-Once Protection - S160WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161WOP</name>
							<description>PFLASH p Sector 161 Configured for Write-Once Protection - S161WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162WOP</name>
							<description>PFLASH p Sector 162 Configured for Write-Once Protection - S162WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163WOP</name>
							<description>PFLASH p Sector 163 Configured for Write-Once Protection - S163WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164WOP</name>
							<description>PFLASH p Sector 164 Configured for Write-Once Protection - S164WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165WOP</name>
							<description>PFLASH p Sector 165 Configured for Write-Once Protection - S165WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166WOP</name>
							<description>PFLASH p Sector 166 Configured for Write-Once Protection - S166WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167WOP</name>
							<description>PFLASH p Sector 167 Configured for Write-Once Protection - S167WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168WOP</name>
							<description>PFLASH p Sector 168 Configured for Write-Once Protection - S168WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169WOP</name>
							<description>PFLASH p Sector 169 Configured for Write-Once Protection - S169WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170WOP</name>
							<description>PFLASH p Sector 170 Configured for Write-Once Protection - S170WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171WOP</name>
							<description>PFLASH p Sector 171 Configured for Write-Once Protection - S171WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172WOP</name>
							<description>PFLASH p Sector 172 Configured for Write-Once Protection - S172WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173WOP</name>
							<description>PFLASH p Sector 173 Configured for Write-Once Protection - S173WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174WOP</name>
							<description>PFLASH p Sector 174 Configured for Write-Once Protection - S174WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175WOP</name>
							<description>PFLASH p Sector 175 Configured for Write-Once Protection - S175WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176WOP</name>
							<description>PFLASH p Sector 176 Configured for Write-Once Protection - S176WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177WOP</name>
							<description>PFLASH p Sector 177 Configured for Write-Once Protection - S177WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178WOP</name>
							<description>PFLASH p Sector 178 Configured for Write-Once Protection - S178WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179WOP</name>
							<description>PFLASH p Sector 179 Configured for Write-Once Protection - S179WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180WOP</name>
							<description>PFLASH p Sector 180 Configured for Write-Once Protection - S180WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181WOP</name>
							<description>PFLASH p Sector 181 Configured for Write-Once Protection - S181WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182WOP</name>
							<description>PFLASH p Sector 182 Configured for Write-Once Protection - S182WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183WOP</name>
							<description>PFLASH p Sector 183 Configured for Write-Once Protection - S183WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184WOP</name>
							<description>PFLASH p Sector 184 Configured for Write-Once Protection - S184WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185WOP</name>
							<description>PFLASH p Sector 185 Configured for Write-Once Protection - S185WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186WOP</name>
							<description>PFLASH p Sector 186 Configured for Write-Once Protection - S186WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187WOP</name>
							<description>PFLASH p Sector 187 Configured for Write-Once Protection - S187WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188WOP</name>
							<description>PFLASH p Sector 188 Configured for Write-Once Protection - S188WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189WOP</name>
							<description>PFLASH p Sector 189 Configured for Write-Once Protection - S189WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190WOP</name>
							<description>PFLASH p Sector 190 Configured for Write-Once Protection - S190WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191WOP</name>
							<description>PFLASH p Sector 191 Configured for Write-Once Protection - S191WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO10</name>
					<description>PFLASH Bank 1 Erase Counter Priority configuration 0</description>
					<addressOffset>0x101A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0L</name>
							<description>PFLASH p Sector 0 Erase Counter priority - S0L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1L</name>
							<description>PFLASH p Sector 1 Erase Counter priority - S1L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2L</name>
							<description>PFLASH p Sector 2 Erase Counter priority - S2L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3L</name>
							<description>PFLASH p Sector 3 Erase Counter priority - S3L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4L</name>
							<description>PFLASH p Sector 4 Erase Counter priority - S4L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5L</name>
							<description>PFLASH p Sector 5 Erase Counter priority - S5L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6L</name>
							<description>PFLASH p Sector 6 Erase Counter priority - S6L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7L</name>
							<description>PFLASH p Sector 7 Erase Counter priority - S7L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8L</name>
							<description>PFLASH p Sector 8 Erase Counter priority - S8L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9L</name>
							<description>PFLASH p Sector 9 Erase Counter priority - S9L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10L</name>
							<description>PFLASH p Sector 10 Erase Counter priority - S10L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11L</name>
							<description>PFLASH p Sector 11 Erase Counter priority - S11L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12L</name>
							<description>PFLASH p Sector 12 Erase Counter priority - S12L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13L</name>
							<description>PFLASH p Sector 13 Erase Counter priority - S13L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14L</name>
							<description>PFLASH p Sector 14 Erase Counter priority - S14L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15L</name>
							<description>PFLASH p Sector 15 Erase Counter priority - S15L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16L</name>
							<description>PFLASH p Sector 16 Erase Counter priority - S16L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17L</name>
							<description>PFLASH p Sector 17 Erase Counter priority - S17L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18L</name>
							<description>PFLASH p Sector 18 Erase Counter priority - S18L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19L</name>
							<description>PFLASH p Sector 19 Erase Counter priority - S19L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20L</name>
							<description>PFLASH p Sector 20 Erase Counter priority - S20L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21L</name>
							<description>PFLASH p Sector 21 Erase Counter priority - S21L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22L</name>
							<description>PFLASH p Sector 22 Erase Counter priority - S22L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23L</name>
							<description>PFLASH p Sector 23 Erase Counter priority - S23L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24L</name>
							<description>PFLASH p Sector 24 Erase Counter priority - S24L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25L</name>
							<description>PFLASH p Sector 25 Erase Counter priority - S25L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26L</name>
							<description>PFLASH p Sector 26 Erase Counter priority - S26L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27L</name>
							<description>PFLASH p Sector 27 Erase Counter priority - S27L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28L</name>
							<description>PFLASH p Sector 28 Erase Counter priority - S28L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29L</name>
							<description>PFLASH p Sector 29 Erase Counter priority - S29L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30L</name>
							<description>PFLASH p Sector 30 Erase Counter priority - S30L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31L</name>
							<description>PFLASH p Sector 31 Erase Counter priority - S31L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
