J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HP_ECPRIO11</name>
					<description>PFLASH Bank 1 Erase Counter Priority Configuration 1</description>
					<addressOffset>0x101A4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32L</name>
							<description>PFLASH p Sector 32 Erase Counter priority - S32L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33L</name>
							<description>PFLASH p Sector 33 Erase Counter priority - S33L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34L</name>
							<description>PFLASH p Sector 34 Erase Counter priority - S34L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35L</name>
							<description>PFLASH p Sector 35 Erase Counter priority - S35L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36L</name>
							<description>PFLASH p Sector 36 Erase Counter priority - S36L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37L</name>
							<description>PFLASH p Sector 37 Erase Counter priority - S37L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38L</name>
							<description>PFLASH p Sector 38 Erase Counter priority - S38L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39L</name>
							<description>PFLASH p Sector 39 Erase Counter priority - S39L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40L</name>
							<description>PFLASH p Sector 40 Erase Counter priority - S40L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41L</name>
							<description>PFLASH p Sector 41 Erase Counter priority - S41L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42L</name>
							<description>PFLASH p Sector 42 Erase Counter priority - S42L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43L</name>
							<description>PFLASH p Sector 43 Erase Counter priority - S43L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44L</name>
							<description>PFLASH p Sector 44 Erase Counter priority - S44L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45L</name>
							<description>PFLASH p Sector 45 Erase Counter priority - S45L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46L</name>
							<description>PFLASH p Sector 46 Erase Counter priority - S46L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47L</name>
							<description>PFLASH p Sector 47 Erase Counter priority - S47L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48L</name>
							<description>PFLASH p Sector 48 Erase Counter priority - S48L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49L</name>
							<description>PFLASH p Sector 49 Erase Counter priority - S49L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50L</name>
							<description>PFLASH p Sector 50 Erase Counter priority - S50L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51L</name>
							<description>PFLASH p Sector 51 Erase Counter priority - S51L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52L</name>
							<description>PFLASH p Sector 52 Erase Counter priority - S52L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53L</name>
							<description>PFLASH p Sector 53 Erase Counter priority - S53L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54L</name>
							<description>PFLASH p Sector 54 Erase Counter priority - S54L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55L</name>
							<description>PFLASH p Sector 55 Erase Counter priority - S55L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56L</name>
							<description>PFLASH p Sector 56 Erase Counter priority - S56L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57L</name>
							<description>PFLASH p Sector 57 Erase Counter priority - S57L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58L</name>
							<description>PFLASH p Sector 58 Erase Counter priority - S58L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59L</name>
							<description>PFLASH p Sector 59 Erase Counter priority - S59L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60L</name>
							<description>PFLASH p Sector 60 Erase Counter priority - S60L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61L</name>
							<description>PFLASH p Sector 61 Erase Counter priority - S61L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62L</name>
							<description>PFLASH p Sector 62 Erase Counter priority - S62L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63L</name>
							<description>PFLASH p Sector 63 Erase Counter priority - S63L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO12</name>
					<description>PFLASH Bank 1 Erase Counter Priority Configuration 2</description>
					<addressOffset>0x101A8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64L</name>
							<description>PFLASH p Sector 64 Erase Counter priority - S64L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65L</name>
							<description>PFLASH p Sector 65 Erase Counter priority - S65L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66L</name>
							<description>PFLASH p Sector 66 Erase Counter priority - S66L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67L</name>
							<description>PFLASH p Sector 67 Erase Counter priority - S67L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68L</name>
							<description>PFLASH p Sector 68 Erase Counter priority - S68L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69L</name>
							<description>PFLASH p Sector 69 Erase Counter priority - S69L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70L</name>
							<description>PFLASH p Sector 70 Erase Counter priority - S70L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71L</name>
							<description>PFLASH p Sector 71 Erase Counter priority - S71L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72L</name>
							<description>PFLASH p Sector 72 Erase Counter priority - S72L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73L</name>
							<description>PFLASH p Sector 73 Erase Counter priority - S73L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74L</name>
							<description>PFLASH p Sector 74 Erase Counter priority - S74L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75L</name>
							<description>PFLASH p Sector 75 Erase Counter priority - S75L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76L</name>
							<description>PFLASH p Sector 76 Erase Counter priority - S76L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77L</name>
							<description>PFLASH p Sector 77 Erase Counter priority - S77L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78L</name>
							<description>PFLASH p Sector 78 Erase Counter priority - S78L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79L</name>
							<description>PFLASH p Sector 79 Erase Counter priority - S79L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80L</name>
							<description>PFLASH p Sector 80 Erase Counter priority - S80L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81L</name>
							<description>PFLASH p Sector 81 Erase Counter priority - S81L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82L</name>
							<description>PFLASH p Sector 82 Erase Counter priority - S82L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83L</name>
							<description>PFLASH p Sector 83 Erase Counter priority - S83L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84L</name>
							<description>PFLASH p Sector 84 Erase Counter priority - S84L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85L</name>
							<description>PFLASH p Sector 85 Erase Counter priority - S85L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86L</name>
							<description>PFLASH p Sector 86 Erase Counter priority - S86L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87L</name>
							<description>PFLASH p Sector 87 Erase Counter priority - S87L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88L</name>
							<description>PFLASH p Sector 88 Erase Counter priority - S88L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89L</name>
							<description>PFLASH p Sector 89 Erase Counter priority - S89L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90L</name>
							<description>PFLASH p Sector 90 Erase Counter priority - S90L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91L</name>
							<description>PFLASH p Sector 91 Erase Counter priority - S91L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92L</name>
							<description>PFLASH p Sector 92 Erase Counter priority - S92L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93L</name>
							<description>PFLASH p Sector 93 Erase Counter priority - S93L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94L</name>
							<description>PFLASH p Sector 94 Erase Counter priority - S94L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95L</name>
							<description>PFLASH p Sector 95 Erase Counter priority - S95L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO13</name>
					<description>PFLASH Bank 1 Erase Counter Priority Configuration 3</description>
					<addressOffset>0x101AC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96L</name>
							<description>PFLASH p Sector 96 Erase Counter priority - S96L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97L</name>
							<description>PFLASH p Sector 97 Erase Counter priority - S97L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98L</name>
							<description>PFLASH p Sector 98 Erase Counter priority - S98L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99L</name>
							<description>PFLASH p Sector 99 Erase Counter priority - S99L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100L</name>
							<description>PFLASH p Sector 100 Erase Counter priority - S100L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101L</name>
							<description>PFLASH p Sector 101 Erase Counter priority - S101L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102L</name>
							<description>PFLASH p Sector 102 Erase Counter priority - S102L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103L</name>
							<description>PFLASH p Sector 103 Erase Counter priority - S103L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104L</name>
							<description>PFLASH p Sector 104 Erase Counter priority - S104L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105L</name>
							<description>PFLASH p Sector 105 Erase Counter priority - S105L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106L</name>
							<description>PFLASH p Sector 106 Erase Counter priority - S106L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107L</name>
							<description>PFLASH p Sector 107 Erase Counter priority - S107L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108L</name>
							<description>PFLASH p Sector 108 Erase Counter priority - S108L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109L</name>
							<description>PFLASH p Sector 109 Erase Counter priority - S109L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110L</name>
							<description>PFLASH p Sector 110 Erase Counter priority - S110L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111L</name>
							<description>PFLASH p Sector 111 Erase Counter priority - S111L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112L</name>
							<description>PFLASH p Sector 112 Erase Counter priority - S112L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113L</name>
							<description>PFLASH p Sector 113 Erase Counter priority - S113L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114L</name>
							<description>PFLASH p Sector 114 Erase Counter priority - S114L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115L</name>
							<description>PFLASH p Sector 115 Erase Counter priority - S115L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116L</name>
							<description>PFLASH p Sector 116 Erase Counter priority - S116L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117L</name>
							<description>PFLASH p Sector 117 Erase Counter priority - S117L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118L</name>
							<description>PFLASH p Sector 118 Erase Counter priority - S118L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119L</name>
							<description>PFLASH p Sector 119 Erase Counter priority - S119L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120L</name>
							<description>PFLASH p Sector 120 Erase Counter priority - S120L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121L</name>
							<description>PFLASH p Sector 121 Erase Counter priority - S121L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122L</name>
							<description>PFLASH p Sector 122 Erase Counter priority - S122L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123L</name>
							<description>PFLASH p Sector 123 Erase Counter priority - S123L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124L</name>
							<description>PFLASH p Sector 124 Erase Counter priority - S124L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125L</name>
							<description>PFLASH p Sector 125 Erase Counter priority - S125L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126L</name>
							<description>PFLASH p Sector 126 Erase Counter priority - S126L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127L</name>
							<description>PFLASH p Sector 127 Erase Counter priority - S127L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
