J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>SP_PROCONHSMCOTP0</name>
					<description>HSM Code OTP Protection Configuration</description>
					<addressOffset>0x30010</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HSM0ROM</name>
							<description>PFLASH Sector 0 HSM Code Locked Forever - HSM0ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM1ROM</name>
							<description>PFLASH Sector 1 HSM Code Locked Forever - HSM1ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM2ROM</name>
							<description>PFLASH Sector 2 HSM Code Locked Forever - HSM2ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM3ROM</name>
							<description>PFLASH Sector 3 HSM Code Locked Forever - HSM3ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM4ROM</name>
							<description>PFLASH Sector 4 HSM Code Locked Forever - HSM4ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM5ROM</name>
							<description>PFLASH Sector 5 HSM Code Locked Forever - HSM5ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM6ROM</name>
							<description>PFLASH Sector 6 HSM Code Locked Forever - HSM6ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM7ROM</name>
							<description>PFLASH Sector 7 HSM Code Locked Forever - HSM7ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM8ROM</name>
							<description>PFLASH Sector 8 HSM Code Locked Forever - HSM8ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM9ROM</name>
							<description>PFLASH Sector 9 HSM Code Locked Forever - HSM9ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM10ROM</name>
							<description>PFLASH Sector 10 HSM Code Locked Forever - HSM10ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM11ROM</name>
							<description>PFLASH Sector 11 HSM Code Locked Forever - HSM11ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM12ROM</name>
							<description>PFLASH Sector 12 HSM Code Locked Forever - HSM12ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM13ROM</name>
							<description>PFLASH Sector 13 HSM Code Locked Forever - HSM13ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM14ROM</name>
							<description>PFLASH Sector 14 HSM Code Locked Forever - HSM14ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM15ROM</name>
							<description>PFLASH Sector 15 HSM Code Locked Forever - HSM15ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM16ROM</name>
							<description>PFLASH Sector 16 HSM Code Locked Forever - HSM16ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM17ROM</name>
							<description>PFLASH Sector 17 HSM Code Locked Forever - HSM17ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM18ROM</name>
							<description>PFLASH Sector 18 HSM Code Locked Forever - HSM18ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM19ROM</name>
							<description>PFLASH Sector 19 HSM Code Locked Forever - HSM19ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM20ROM</name>
							<description>PFLASH Sector 20 HSM Code Locked Forever - HSM20ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM21ROM</name>
							<description>PFLASH Sector 21 HSM Code Locked Forever - HSM21ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM22ROM</name>
							<description>PFLASH Sector 22 HSM Code Locked Forever - HSM22ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM23ROM</name>
							<description>PFLASH Sector 23 HSM Code Locked Forever - HSM23ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM24ROM</name>
							<description>PFLASH Sector 24 HSM Code Locked Forever - HSM24ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM25ROM</name>
							<description>PFLASH Sector 25 HSM Code Locked Forever - HSM25ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM26ROM</name>
							<description>PFLASH Sector 26 HSM Code Locked Forever - HSM26ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM27ROM</name>
							<description>PFLASH Sector 27 HSM Code Locked Forever - HSM27ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM28ROM</name>
							<description>PFLASH Sector 28 HSM Code Locked Forever - HSM28ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM29ROM</name>
							<description>PFLASH Sector 29 HSM Code Locked Forever - HSM29ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM30ROM</name>
							<description>PFLASH Sector 30 HSM Code Locked Forever - HSM30ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM31ROM</name>
							<description>PFLASH Sector 31 HSM Code Locked Forever - HSM31ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCOTP1</name>
					<description>HSM Code OTP Protection Configuration</description>
					<addressOffset>0x30014</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HSM32ROM</name>
							<description>PFLASH Sector 32 HSM Code Locked Forever - HSM32ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM33ROM</name>
							<description>PFLASH Sector 33 HSM Code Locked Forever - HSM33ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM34ROM</name>
							<description>PFLASH Sector 34 HSM Code Locked Forever - HSM34ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM35ROM</name>
							<description>PFLASH Sector 35 HSM Code Locked Forever - HSM35ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM36ROM</name>
							<description>PFLASH Sector 36 HSM Code Locked Forever - HSM36ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM37ROM</name>
							<description>PFLASH Sector 37 HSM Code Locked Forever - HSM37ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM38ROM</name>
							<description>PFLASH Sector 38 HSM Code Locked Forever - HSM38ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM39ROM</name>
							<description>PFLASH Sector 39 HSM Code Locked Forever - HSM39ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSM</name>
					<description>HSM Interface Protection Configuration</description>
					<addressOffset>0x30040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HSMDBGDIS</name>
							<description>HSM Debug Disable - HSMDBGDIS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBGIFLCK</name>
							<description>Debug Interface Locked - DBGIFLCK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTIFLCK</name>
							<description>Test Interface Locked - TSTIFLCK</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMTSTDIS</name>
							<description>HSM Test Disable - HSMTSTDIS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMTRDIS</name>
							<description>HSM Trace Disable - HSMTRDIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMTRTYPE</name>
							<description>HSM Type of Trace - HSMTRTYPE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
