J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>DSADCSRA5</name>
					<description>DSADC SRA5 Service Request</description>
					<addressOffset>0x79C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0INT0</name>
					<description>E-RAY 0 Service Request 0</description>
					<addressOffset>0x800</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0INT1</name>
					<description>E-RAY 0 Service Request 1</description>
					<addressOffset>0x804</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0TINT0</name>
					<description>E-RAY 0 Timer Interrupt 0 Service Request</description>
					<addressOffset>0x808</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0TINT1</name>
					<description>E-RAY 0 Timer Interrupt 1 Service Request</description>
					<addressOffset>0x80C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0NDAT0</name>
					<description>E-RAY 0 New Data 0 Service Request</description>
					<addressOffset>0x810</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0NDAT1</name>
					<description>E-RAY 0 New Data 1 Service Request</description>
					<addressOffset>0x814</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0MBSC0</name>
					<description>E-RAY 0 Message Buffer Status Changed 0 Service Request</description>
					<addressOffset>0x818</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERAY0MBSC1</name>
					<description>E-RAY 0 Message Buffer Status Changed 1 Service Request</description>
					<addressOffset>0x81C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
