J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>GTMTIM54</name>
					<description>TIM5 Shared Service Request 4</description>
					<addressOffset>0xC40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMTIM55</name>
					<description>TIM5 Shared Service Request 5</description>
					<addressOffset>0xC44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMTIM56</name>
					<description>TIM5 Shared Service Request 6</description>
					<addressOffset>0xC48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMTIM57</name>
					<description>TIM5 Shared Service Request 7</description>
					<addressOffset>0xC4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMMCS00</name>
					<description>MCS0 Shared Service Request 0</description>
					<addressOffset>0xCB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMMCS01</name>
					<description>MCS0 Shared Service Request 1</description>
					<addressOffset>0xCB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMMCS02</name>
					<description>MCS0 Shared Service Request 2</description>
					<addressOffset>0xCB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMMCS03</name>
					<description>MCS0 Shared Service Request 3</description>
					<addressOffset>0xCBC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMMCS04</name>
					<description>MCS0 Shared Service Request 4</description>
					<addressOffset>0xCC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
