J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
			</registers>
			<interrupt>
				<name>__interrupt_handler_0</name>
				<description>Interrupt 0 entry</description>
				<value>0</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_1</name>
				<description>Interrupt 1 entry</description>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_2</name>
				<description>Interrupt 2 entry</description>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_3</name>
				<description>Interrupt 3 entry</description>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_4</name>
				<description>Interrupt 4 entry</description>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_5</name>
				<description>Interrupt 5 entry</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_6</name>
				<description>Interrupt 6 entry</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_7</name>
				<description>Interrupt 7 entry</description>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_8</name>
				<description>Interrupt 8 entry</description>
				<value>8</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_9</name>
				<description>Interrupt 9 entry</description>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_10</name>
				<description>Interrupt 10 entry</description>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_11</name>
				<description>Interrupt 11 entry</description>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_12</name>
				<description>Interrupt 12 entry</description>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_13</name>
				<description>Interrupt 13 entry</description>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_14</name>
				<description>Interrupt 14 entry</description>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_15</name>
				<description>Interrupt 15 entry</description>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_16</name>
				<description>Interrupt 16 entry</description>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_17</name>
				<description>Interrupt 17 entry</description>
				<value>17</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_18</name>
				<description>Interrupt 18 entry</description>
				<value>18</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_19</name>
				<description>Interrupt 19 entry</description>
				<value>19</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_20</name>
				<description>Interrupt 20 entry</description>
				<value>20</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_21</name>
				<description>Interrupt 21 entry</description>
				<value>21</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_22</name>
				<description>Interrupt 22 entry</description>
				<value>22</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_23</name>
				<description>Interrupt 23 entry</description>
				<value>23</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_24</name>
				<description>Interrupt 24 entry</description>
				<value>24</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_25</name>
				<description>Interrupt 25 entry</description>
				<value>25</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_26</name>
				<description>Interrupt 26 entry</description>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_27</name>
				<description>Interrupt 27 entry</description>
				<value>27</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_28</name>
				<description>Interrupt 28 entry</description>
				<value>28</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_29</name>
				<description>Interrupt 29 entry</description>
				<value>29</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_30</name>
				<description>Interrupt 30 entry</description>
				<value>30</value>
			</interrupt>
			<interrupt>
				<name>__interrupt_handler_31</name>
				<description>Interrupt 31 entry</description>
				<value>31</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>ADMA0</name>
			<version>100</version>
			<description>ce_adma</description>
			<groupName>ADMA0</groupName>
			<baseAddress>0xF8508400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit - DISR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit - DISS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xd1c005</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number - MOD_REV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type - MOD_TYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value - MOD_NUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRSR</name>
					<description>Error Status Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ME</name>
							<description>Memory Error - ME</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SE</name>
							<description>System Error - SE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SRI_ECC</name>
							<description>System Memory ECC Error - SRI_ECC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SADR</name>
					<description>Source Address Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SADR</name>
							<description>Source Address Register (Pointer) - SADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DADR</name>
					<description>Destination Address Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DADR</name>
							<description>Destination Address Register (Pointer) - DADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Counter Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Byte Counter - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable Bit - EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCN</name>
							<description>Enable Condition Bit - ENCN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>READY</name>
							<description>Ready Flag - READY</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Error Interrupt - ERR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECC_STOP</name>
							<description>ECC Error Mode Bit - ECC_STOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHKEN</name>
							<description>Checksum Enable Mode Bit - CHKEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHKSUM</name>
					<description>Checksum Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CHKSUM</name>
							<description>DATA Checksum - CHKSUM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status - RSTSTAT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear - CLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ODA</name>
					<description>OCDS Debug Access Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DDREN</name>
							<description>Destructive Debug Read Enable - DDREN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DREN</name>
							<description>Destructive Read Enable - DREN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control - SUS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection - SUS_P</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State - SUSSTA</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
