J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>HRR036</name>
					<description>DMA Channel 036 Resource Partition Register</description>
					<addressOffset>0x1890</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR037</name>
					<description>DMA Channel 037 Resource Partition Register</description>
					<addressOffset>0x1894</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR038</name>
					<description>DMA Channel 038 Resource Partition Register</description>
					<addressOffset>0x1898</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR039</name>
					<description>DMA Channel 039 Resource Partition Register</description>
					<addressOffset>0x189C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR040</name>
					<description>DMA Channel 040 Resource Partition Register</description>
					<addressOffset>0x18A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR041</name>
					<description>DMA Channel 041 Resource Partition Register</description>
					<addressOffset>0x18A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR042</name>
					<description>DMA Channel 042 Resource Partition Register</description>
					<addressOffset>0x18A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR043</name>
					<description>DMA Channel 043 Resource Partition Register</description>
					<addressOffset>0x18AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR044</name>
					<description>DMA Channel 044 Resource Partition Register</description>
					<addressOffset>0x18B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR045</name>
					<description>DMA Channel 045 Resource Partition Register</description>
					<addressOffset>0x18B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR046</name>
					<description>DMA Channel 046 Resource Partition Register</description>
					<addressOffset>0x18B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR047</name>
					<description>DMA Channel 047 Resource Partition Register</description>
					<addressOffset>0x18BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR048</name>
					<description>DMA Channel 048 Resource Partition Register</description>
					<addressOffset>0x18C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR049</name>
					<description>DMA Channel 049 Resource Partition Register</description>
					<addressOffset>0x18C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR050</name>
					<description>DMA Channel 050 Resource Partition Register</description>
					<addressOffset>0x18C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR051</name>
					<description>DMA Channel 051 Resource Partition Register</description>
					<addressOffset>0x18CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR052</name>
					<description>DMA Channel 052 Resource Partition Register</description>
					<addressOffset>0x18D0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR053</name>
					<description>DMA Channel 053 Resource Partition Register</description>
					<addressOffset>0x18D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR054</name>
					<description>DMA Channel 054 Resource Partition Register</description>
					<addressOffset>0x18D8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR055</name>
					<description>DMA Channel 055 Resource Partition Register</description>
					<addressOffset>0x18DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR056</name>
					<description>DMA Channel 056 Resource Partition Register</description>
					<addressOffset>0x18E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR057</name>
					<description>DMA Channel 057 Resource Partition Register</description>
					<addressOffset>0x18E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR058</name>
					<description>DMA Channel 058 Resource Partition Register</description>
					<addressOffset>0x18E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR059</name>
					<description>DMA Channel 059 Resource Partition Register</description>
					<addressOffset>0x18EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR060</name>
					<description>DMA Channel 060 Resource Partition Register</description>
					<addressOffset>0x18F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR061</name>
					<description>DMA Channel 061 Resource Partition Register</description>
					<addressOffset>0x18F4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR062</name>
					<description>DMA Channel 062 Resource Partition Register</description>
					<addressOffset>0x18F8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR063</name>
					<description>DMA Channel 063 Resource Partition Register</description>
					<addressOffset>0x18FC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR064</name>
					<description>DMA Channel 064 Resource Partition Register</description>
					<addressOffset>0x1900</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR065</name>
					<description>DMA Channel 065 Resource Partition Register</description>
					<addressOffset>0x1904</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR066</name>
					<description>DMA Channel 066 Resource Partition Register</description>
					<addressOffset>0x1908</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR067</name>
					<description>DMA Channel 067 Resource Partition Register</description>
					<addressOffset>0x190C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR068</name>
					<description>DMA Channel 068 Resource Partition Register</description>
					<addressOffset>0x1910</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR069</name>
					<description>DMA Channel 069 Resource Partition Register</description>
					<addressOffset>0x1914</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR070</name>
					<description>DMA Channel 070 Resource Partition Register</description>
					<addressOffset>0x1918</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR071</name>
					<description>DMA Channel 071 Resource Partition Register</description>
					<addressOffset>0x191C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR072</name>
					<description>DMA Channel 072 Resource Partition Register</description>
					<addressOffset>0x1920</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR073</name>
					<description>DMA Channel 073 Resource Partition Register</description>
					<addressOffset>0x1924</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR074</name>
					<description>DMA Channel 074 Resource Partition Register</description>
					<addressOffset>0x1928</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR075</name>
					<description>DMA Channel 075 Resource Partition Register</description>
					<addressOffset>0x192C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR076</name>
					<description>DMA Channel 076 Resource Partition Register</description>
					<addressOffset>0x1930</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR077</name>
					<description>DMA Channel 077 Resource Partition Register</description>
					<addressOffset>0x1934</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR078</name>
					<description>DMA Channel 078 Resource Partition Register</description>
					<addressOffset>0x1938</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
