J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>SUSENR036</name>
					<description>DMA Channel 036 Suspend Enable Register</description>
					<addressOffset>0x1A90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR037</name>
					<description>DMA Channel 037 Suspend Enable Register</description>
					<addressOffset>0x1A94</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR038</name>
					<description>DMA Channel 038 Suspend Enable Register</description>
					<addressOffset>0x1A98</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR039</name>
					<description>DMA Channel 039 Suspend Enable Register</description>
					<addressOffset>0x1A9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR040</name>
					<description>DMA Channel 040 Suspend Enable Register</description>
					<addressOffset>0x1AA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR041</name>
					<description>DMA Channel 041 Suspend Enable Register</description>
					<addressOffset>0x1AA4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR042</name>
					<description>DMA Channel 042 Suspend Enable Register</description>
					<addressOffset>0x1AA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR043</name>
					<description>DMA Channel 043 Suspend Enable Register</description>
					<addressOffset>0x1AAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR044</name>
					<description>DMA Channel 044 Suspend Enable Register</description>
					<addressOffset>0x1AB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR045</name>
					<description>DMA Channel 045 Suspend Enable Register</description>
					<addressOffset>0x1AB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR046</name>
					<description>DMA Channel 046 Suspend Enable Register</description>
					<addressOffset>0x1AB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR047</name>
					<description>DMA Channel 047 Suspend Enable Register</description>
					<addressOffset>0x1ABC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR048</name>
					<description>DMA Channel 048 Suspend Enable Register</description>
					<addressOffset>0x1AC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR049</name>
					<description>DMA Channel 049 Suspend Enable Register</description>
					<addressOffset>0x1AC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR050</name>
					<description>DMA Channel 050 Suspend Enable Register</description>
					<addressOffset>0x1AC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR051</name>
					<description>DMA Channel 051 Suspend Enable Register</description>
					<addressOffset>0x1ACC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR052</name>
					<description>DMA Channel 052 Suspend Enable Register</description>
					<addressOffset>0x1AD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR053</name>
					<description>DMA Channel 053 Suspend Enable Register</description>
					<addressOffset>0x1AD4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR054</name>
					<description>DMA Channel 054 Suspend Enable Register</description>
					<addressOffset>0x1AD8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR055</name>
					<description>DMA Channel 055 Suspend Enable Register</description>
					<addressOffset>0x1ADC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR056</name>
					<description>DMA Channel 056 Suspend Enable Register</description>
					<addressOffset>0x1AE0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR057</name>
					<description>DMA Channel 057 Suspend Enable Register</description>
					<addressOffset>0x1AE4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR058</name>
					<description>DMA Channel 058 Suspend Enable Register</description>
					<addressOffset>0x1AE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR059</name>
					<description>DMA Channel 059 Suspend Enable Register</description>
					<addressOffset>0x1AEC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR060</name>
					<description>DMA Channel 060 Suspend Enable Register</description>
					<addressOffset>0x1AF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR061</name>
					<description>DMA Channel 061 Suspend Enable Register</description>
					<addressOffset>0x1AF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR062</name>
					<description>DMA Channel 062 Suspend Enable Register</description>
					<addressOffset>0x1AF8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR063</name>
					<description>DMA Channel 063 Suspend Enable Register</description>
					<addressOffset>0x1AFC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR064</name>
					<description>DMA Channel 064 Suspend Enable Register</description>
					<addressOffset>0x1B00</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR065</name>
					<description>DMA Channel 065 Suspend Enable Register</description>
					<addressOffset>0x1B04</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR066</name>
					<description>DMA Channel 066 Suspend Enable Register</description>
					<addressOffset>0x1B08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR067</name>
					<description>DMA Channel 067 Suspend Enable Register</description>
					<addressOffset>0x1B0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR068</name>
					<description>DMA Channel 068 Suspend Enable Register</description>
					<addressOffset>0x1B10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR069</name>
					<description>DMA Channel 069 Suspend Enable Register</description>
					<addressOffset>0x1B14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR070</name>
					<description>DMA Channel 070 Suspend Enable Register</description>
					<addressOffset>0x1B18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR071</name>
					<description>DMA Channel 071 Suspend Enable Register</description>
					<addressOffset>0x1B1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR072</name>
					<description>DMA Channel 072 Suspend Enable Register</description>
					<addressOffset>0x1B20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR073</name>
					<description>DMA Channel 073 Suspend Enable Register</description>
					<addressOffset>0x1B24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR074</name>
					<description>DMA Channel 074 Suspend Enable Register</description>
					<addressOffset>0x1B28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR075</name>
					<description>DMA Channel 075 Suspend Enable Register</description>
					<addressOffset>0x1B2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR076</name>
					<description>DMA Channel 076 Suspend Enable Register</description>
					<addressOffset>0x1B30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR077</name>
					<description>DMA Channel 077 Suspend Enable Register</description>
					<addressOffset>0x1B34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
