J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>SUSENR120</name>
					<description>DMA Channel 120 Suspend Enable Register</description>
					<addressOffset>0x1BE0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR121</name>
					<description>DMA Channel 121 Suspend Enable Register</description>
					<addressOffset>0x1BE4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR122</name>
					<description>DMA Channel 122 Suspend Enable Register</description>
					<addressOffset>0x1BE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR123</name>
					<description>DMA Channel 123 Suspend Enable Register</description>
					<addressOffset>0x1BEC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR124</name>
					<description>DMA Channel 124 Suspend Enable Register</description>
					<addressOffset>0x1BF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR125</name>
					<description>DMA Channel 125 Suspend Enable Register</description>
					<addressOffset>0x1BF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR126</name>
					<description>DMA Channel 126 Suspend Enable Register</description>
					<addressOffset>0x1BF8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR127</name>
					<description>DMA Channel 127 Suspend Enable Register</description>
					<addressOffset>0x1BFC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR000</name>
					<description>DMA Channel 000 Suspend Acknowledge Register</description>
					<addressOffset>0x1C00</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR001</name>
					<description>DMA Channel 001 Suspend Acknowledge Register</description>
					<addressOffset>0x1C04</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR002</name>
					<description>DMA Channel 002 Suspend Acknowledge Register</description>
					<addressOffset>0x1C08</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR003</name>
					<description>DMA Channel 003 Suspend Acknowledge Register</description>
					<addressOffset>0x1C0C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR004</name>
					<description>DMA Channel 004 Suspend Acknowledge Register</description>
					<addressOffset>0x1C10</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR005</name>
					<description>DMA Channel 005 Suspend Acknowledge Register</description>
					<addressOffset>0x1C14</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR006</name>
					<description>DMA Channel 006 Suspend Acknowledge Register</description>
					<addressOffset>0x1C18</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR007</name>
					<description>DMA Channel 007 Suspend Acknowledge Register</description>
					<addressOffset>0x1C1C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR008</name>
					<description>DMA Channel 008 Suspend Acknowledge Register</description>
					<addressOffset>0x1C20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR009</name>
					<description>DMA Channel 009 Suspend Acknowledge Register</description>
					<addressOffset>0x1C24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR010</name>
					<description>DMA Channel 010 Suspend Acknowledge Register</description>
					<addressOffset>0x1C28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR011</name>
					<description>DMA Channel 011 Suspend Acknowledge Register</description>
					<addressOffset>0x1C2C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR012</name>
					<description>DMA Channel 012 Suspend Acknowledge Register</description>
					<addressOffset>0x1C30</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR013</name>
					<description>DMA Channel 013 Suspend Acknowledge Register</description>
					<addressOffset>0x1C34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR014</name>
					<description>DMA Channel 014 Suspend Acknowledge Register</description>
					<addressOffset>0x1C38</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR015</name>
					<description>DMA Channel 015 Suspend Acknowledge Register</description>
					<addressOffset>0x1C3C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR016</name>
					<description>DMA Channel 016 Suspend Acknowledge Register</description>
					<addressOffset>0x1C40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR017</name>
					<description>DMA Channel 017 Suspend Acknowledge Register</description>
					<addressOffset>0x1C44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR018</name>
					<description>DMA Channel 018 Suspend Acknowledge Register</description>
					<addressOffset>0x1C48</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR019</name>
					<description>DMA Channel 019 Suspend Acknowledge Register</description>
					<addressOffset>0x1C4C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR020</name>
					<description>DMA Channel 020 Suspend Acknowledge Register</description>
					<addressOffset>0x1C50</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR021</name>
					<description>DMA Channel 021 Suspend Acknowledge Register</description>
					<addressOffset>0x1C54</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR022</name>
					<description>DMA Channel 022 Suspend Acknowledge Register</description>
					<addressOffset>0x1C58</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR023</name>
					<description>DMA Channel 023 Suspend Acknowledge Register</description>
					<addressOffset>0x1C5C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR024</name>
					<description>DMA Channel 024 Suspend Acknowledge Register</description>
					<addressOffset>0x1C60</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR025</name>
					<description>DMA Channel 025 Suspend Acknowledge Register</description>
					<addressOffset>0x1C64</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR026</name>
					<description>DMA Channel 026 Suspend Acknowledge Register</description>
					<addressOffset>0x1C68</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR027</name>
					<description>DMA Channel 027 Suspend Acknowledge Register</description>
					<addressOffset>0x1C6C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR028</name>
					<description>DMA Channel 028 Suspend Acknowledge Register</description>
					<addressOffset>0x1C70</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR029</name>
					<description>DMA Channel 029 Suspend Acknowledge Register</description>
					<addressOffset>0x1C74</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR030</name>
					<description>DMA Channel 030 Suspend Acknowledge Register</description>
					<addressOffset>0x1C78</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR031</name>
					<description>DMA Channel 031 Suspend Acknowledge Register</description>
					<addressOffset>0x1C7C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
