J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>SUSACR032</name>
					<description>DMA Channel 032 Suspend Acknowledge Register</description>
					<addressOffset>0x1C80</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR033</name>
					<description>DMA Channel 033 Suspend Acknowledge Register</description>
					<addressOffset>0x1C84</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR034</name>
					<description>DMA Channel 034 Suspend Acknowledge Register</description>
					<addressOffset>0x1C88</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR035</name>
					<description>DMA Channel 035 Suspend Acknowledge Register</description>
					<addressOffset>0x1C8C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR036</name>
					<description>DMA Channel 036 Suspend Acknowledge Register</description>
					<addressOffset>0x1C90</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR037</name>
					<description>DMA Channel 037 Suspend Acknowledge Register</description>
					<addressOffset>0x1C94</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR038</name>
					<description>DMA Channel 038 Suspend Acknowledge Register</description>
					<addressOffset>0x1C98</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR039</name>
					<description>DMA Channel 039 Suspend Acknowledge Register</description>
					<addressOffset>0x1C9C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR040</name>
					<description>DMA Channel 040 Suspend Acknowledge Register</description>
					<addressOffset>0x1CA0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR041</name>
					<description>DMA Channel 041 Suspend Acknowledge Register</description>
					<addressOffset>0x1CA4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR042</name>
					<description>DMA Channel 042 Suspend Acknowledge Register</description>
					<addressOffset>0x1CA8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR043</name>
					<description>DMA Channel 043 Suspend Acknowledge Register</description>
					<addressOffset>0x1CAC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR044</name>
					<description>DMA Channel 044 Suspend Acknowledge Register</description>
					<addressOffset>0x1CB0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR045</name>
					<description>DMA Channel 045 Suspend Acknowledge Register</description>
					<addressOffset>0x1CB4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR046</name>
					<description>DMA Channel 046 Suspend Acknowledge Register</description>
					<addressOffset>0x1CB8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR047</name>
					<description>DMA Channel 047 Suspend Acknowledge Register</description>
					<addressOffset>0x1CBC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR048</name>
					<description>DMA Channel 048 Suspend Acknowledge Register</description>
					<addressOffset>0x1CC0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR049</name>
					<description>DMA Channel 049 Suspend Acknowledge Register</description>
					<addressOffset>0x1CC4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR050</name>
					<description>DMA Channel 050 Suspend Acknowledge Register</description>
					<addressOffset>0x1CC8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR051</name>
					<description>DMA Channel 051 Suspend Acknowledge Register</description>
					<addressOffset>0x1CCC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR052</name>
					<description>DMA Channel 052 Suspend Acknowledge Register</description>
					<addressOffset>0x1CD0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR053</name>
					<description>DMA Channel 053 Suspend Acknowledge Register</description>
					<addressOffset>0x1CD4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR054</name>
					<description>DMA Channel 054 Suspend Acknowledge Register</description>
					<addressOffset>0x1CD8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR055</name>
					<description>DMA Channel 055 Suspend Acknowledge Register</description>
					<addressOffset>0x1CDC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR056</name>
					<description>DMA Channel 056 Suspend Acknowledge Register</description>
					<addressOffset>0x1CE0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR057</name>
					<description>DMA Channel 057 Suspend Acknowledge Register</description>
					<addressOffset>0x1CE4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR058</name>
					<description>DMA Channel 058 Suspend Acknowledge Register</description>
					<addressOffset>0x1CE8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR059</name>
					<description>DMA Channel 059 Suspend Acknowledge Register</description>
					<addressOffset>0x1CEC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR060</name>
					<description>DMA Channel 060 Suspend Acknowledge Register</description>
					<addressOffset>0x1CF0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR061</name>
					<description>DMA Channel 061 Suspend Acknowledge Register</description>
					<addressOffset>0x1CF4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR062</name>
					<description>DMA Channel 062 Suspend Acknowledge Register</description>
					<addressOffset>0x1CF8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR063</name>
					<description>DMA Channel 063 Suspend Acknowledge Register</description>
					<addressOffset>0x1CFC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR064</name>
					<description>DMA Channel 064 Suspend Acknowledge Register</description>
					<addressOffset>0x1D00</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR065</name>
					<description>DMA Channel 065 Suspend Acknowledge Register</description>
					<addressOffset>0x1D04</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR066</name>
					<description>DMA Channel 066 Suspend Acknowledge Register</description>
					<addressOffset>0x1D08</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR067</name>
					<description>DMA Channel 067 Suspend Acknowledge Register</description>
					<addressOffset>0x1D0C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR068</name>
					<description>DMA Channel 068 Suspend Acknowledge Register</description>
					<addressOffset>0x1D10</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR069</name>
					<description>DMA Channel 069 Suspend Acknowledge Register</description>
					<addressOffset>0x1D14</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR070</name>
					<description>DMA Channel 070 Suspend Acknowledge Register</description>
					<addressOffset>0x1D18</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR071</name>
					<description>DMA Channel 071 Suspend Acknowledge Register</description>
					<addressOffset>0x1D1C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
