J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>SUSACR072</name>
					<description>DMA Channel 072 Suspend Acknowledge Register</description>
					<addressOffset>0x1D20</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR073</name>
					<description>DMA Channel 073 Suspend Acknowledge Register</description>
					<addressOffset>0x1D24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR074</name>
					<description>DMA Channel 074 Suspend Acknowledge Register</description>
					<addressOffset>0x1D28</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR075</name>
					<description>DMA Channel 075 Suspend Acknowledge Register</description>
					<addressOffset>0x1D2C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR076</name>
					<description>DMA Channel 076 Suspend Acknowledge Register</description>
					<addressOffset>0x1D30</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR077</name>
					<description>DMA Channel 077 Suspend Acknowledge Register</description>
					<addressOffset>0x1D34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR078</name>
					<description>DMA Channel 078 Suspend Acknowledge Register</description>
					<addressOffset>0x1D38</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR079</name>
					<description>DMA Channel 079 Suspend Acknowledge Register</description>
					<addressOffset>0x1D3C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR080</name>
					<description>DMA Channel 080 Suspend Acknowledge Register</description>
					<addressOffset>0x1D40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR081</name>
					<description>DMA Channel 081 Suspend Acknowledge Register</description>
					<addressOffset>0x1D44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR082</name>
					<description>DMA Channel 082 Suspend Acknowledge Register</description>
					<addressOffset>0x1D48</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR083</name>
					<description>DMA Channel 083 Suspend Acknowledge Register</description>
					<addressOffset>0x1D4C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR084</name>
					<description>DMA Channel 084 Suspend Acknowledge Register</description>
					<addressOffset>0x1D50</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR085</name>
					<description>DMA Channel 085 Suspend Acknowledge Register</description>
					<addressOffset>0x1D54</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR086</name>
					<description>DMA Channel 086 Suspend Acknowledge Register</description>
					<addressOffset>0x1D58</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR087</name>
					<description>DMA Channel 087 Suspend Acknowledge Register</description>
					<addressOffset>0x1D5C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR088</name>
					<description>DMA Channel 088 Suspend Acknowledge Register</description>
					<addressOffset>0x1D60</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR089</name>
					<description>DMA Channel 089 Suspend Acknowledge Register</description>
					<addressOffset>0x1D64</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR090</name>
					<description>DMA Channel 090 Suspend Acknowledge Register</description>
					<addressOffset>0x1D68</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR091</name>
					<description>DMA Channel 091 Suspend Acknowledge Register</description>
					<addressOffset>0x1D6C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR092</name>
					<description>DMA Channel 092 Suspend Acknowledge Register</description>
					<addressOffset>0x1D70</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR093</name>
					<description>DMA Channel 093 Suspend Acknowledge Register</description>
					<addressOffset>0x1D74</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR094</name>
					<description>DMA Channel 094 Suspend Acknowledge Register</description>
					<addressOffset>0x1D78</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR095</name>
					<description>DMA Channel 095 Suspend Acknowledge Register</description>
					<addressOffset>0x1D7C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR096</name>
					<description>DMA Channel 096 Suspend Acknowledge Register</description>
					<addressOffset>0x1D80</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR097</name>
					<description>DMA Channel 097 Suspend Acknowledge Register</description>
					<addressOffset>0x1D84</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR098</name>
					<description>DMA Channel 098 Suspend Acknowledge Register</description>
					<addressOffset>0x1D88</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR099</name>
					<description>DMA Channel 099 Suspend Acknowledge Register</description>
					<addressOffset>0x1D8C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR100</name>
					<description>DMA Channel 100 Suspend Acknowledge Register</description>
					<addressOffset>0x1D90</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR101</name>
					<description>DMA Channel 101 Suspend Acknowledge Register</description>
					<addressOffset>0x1D94</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR102</name>
					<description>DMA Channel 102 Suspend Acknowledge Register</description>
					<addressOffset>0x1D98</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR103</name>
					<description>DMA Channel 103 Suspend Acknowledge Register</description>
					<addressOffset>0x1D9C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR104</name>
					<description>DMA Channel 104 Suspend Acknowledge Register</description>
					<addressOffset>0x1DA0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR105</name>
					<description>DMA Channel 105 Suspend Acknowledge Register</description>
					<addressOffset>0x1DA4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR106</name>
					<description>DMA Channel 106 Suspend Acknowledge Register</description>
					<addressOffset>0x1DA8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR107</name>
					<description>DMA Channel 107 Suspend Acknowledge Register</description>
					<addressOffset>0x1DAC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR108</name>
					<description>DMA Channel 108 Suspend Acknowledge Register</description>
					<addressOffset>0x1DB0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR109</name>
					<description>DMA Channel 109 Suspend Acknowledge Register</description>
					<addressOffset>0x1DB4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR110</name>
					<description>DMA Channel 110 Suspend Acknowledge Register</description>
					<addressOffset>0x1DB8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSACR111</name>
					<description>DMA Channel 111 Suspend Acknowledge Register</description>
					<addressOffset>0x1DBC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSAC</name>
							<description>DMA Channel Suspend State or Frozen State Active for DMA Channel - SUSAC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
