J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CBS</name>
			<version>100</version>
			<description>ce_cbs</description>
			<groupName>CBS</groupName>
			<baseAddress>0xF0000400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>JDPID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x6360</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision - MOD_REV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type - MOD_TYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number - MOD_NUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OIFM</name>
					<description>OCDS Interface Mode Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DAPMODE</name>
							<description>DAPInterface Mode - DAPMODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAPRST</name>
							<description>DAPProtocol Clear - DAPRST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F_JTAG</name>
							<description>Forced JTAG Mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>N_JTAG</name>
							<description>No Switch to JTAG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PADCTL</name>
							<description>Pad Control for Debug Interface Pins</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PADCTLI</name>
							<description>Pad input threshold control for Debug Interface Pins</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIPR</name>
					<description>TG Input Pins Routing</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIN0</name>
							<description>Trigger Pin 0 to Trigger Line Routing</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN1</name>
							<description>Trigger Pin 1 to Trigger Line Routing</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN2</name>
							<description>Trigger Pin 2 to Trigger Line Routing</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN3</name>
							<description>Trigger Pin 3 to Trigger Line Routing</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN4</name>
							<description>Trigger Pin 4 to Trigger Line Routing</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN5</name>
							<description>Trigger Pin 5 to Trigger Line Routing</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN6</name>
							<description>Trigger Pin 6 to Trigger Line Routing</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN7</name>
							<description>Trigger Pin 7 to Trigger Line Routing</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOPR</name>
					<description>TG Output Pins Routing</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIN0</name>
							<description>Trigger Line to Trigger Pin 0 Routing</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN1</name>
							<description>Trigger Line to Trigger Pin 1 Routing</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN2</name>
							<description>Trigger Line to Trigger Pin 2 Routing</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN3</name>
							<description>Trigger Line to Trigger Pin 3 Routing</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN4</name>
							<description>Trigger Line to Trigger Pin 4 Routing</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN5</name>
							<description>Trigger Line to Trigger Pin 5 Routing</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN6</name>
							<description>Trigger Line to Trigger Pin 6 Routing</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN7</name>
							<description>Trigger Line to Trigger Pin 7 Routing</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOPPS</name>
					<description>TG Output Pins Pulse Stretcher</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIN0</name>
							<description>Pulse Stretch Control for Trigger Pin 0 - PIN0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN1</name>
							<description>Pulse Stretch Control for Trigger Pin 1 - PIN1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN2</name>
							<description>Pulse Stretch Control for Trigger Pin 2 - PIN2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN3</name>
							<description>Pulse Stretch Control for Trigger Pin 3 - PIN3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN4</name>
							<description>Pulse Stretch Control for Trigger Pin 4 - PIN4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN5</name>
							<description>Pulse Stretch Control for Trigger Pin 5 - PIN5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN6</name>
							<description>Pulse Stretch Control for Trigger Pin 6 - PIN6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PIN7</name>
							<description>Pulse Stretch Control for Trigger Pin 7 - PIN7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCIP</name>
					<description>TG Capture for TG Input Pins</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Capture of Trigger Input Pin 0 - P0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Capture of Trigger Input Pin 1 - P1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P2</name>
							<description>Capture of Trigger Input Pin 2 - P2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P3</name>
							<description>Capture of Trigger Input Pin 3 - P3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P4</name>
							<description>Capture of Trigger Input Pin 4 - P4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P5</name>
							<description>Capture of Trigger Input Pin 5 - P5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P6</name>
							<description>Capture of Trigger Input Pin 6 - P6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P7</name>
							<description>Capture of Trigger Input Pin 7 - P7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRC0</name>
					<description>TG Routing for CPU0</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRC1</name>
					<description>TG Routing for CPU1</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRC2</name>
					<description>TG Routing for CPU2</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRC3</name>
					<description>TG Routing for CPU3</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRC4</name>
					<description>TG Routing for CPU4</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRC5</name>
					<description>TG Routing for CPU5</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRHSM</name>
					<description>TG Routing for HSMControl</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HALT</name>
							<description>HALT to Trigger Line Routing - HALT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKOUT</name>
							<description>BRKOUT to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BT1</name>
							<description>BRKOUT to Trigger Line 1 Routing - BT1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to BRKIN Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSIN</name>
							<description>Trigger Line to SUSIN Routing - SUSIN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMC</name>
					<description>TG Routing for MCDS Control</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BRKOUT</name>
							<description>MCDS break_out to Trigger Line Routing - BRKOUT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUSOUT</name>
							<description>MCDS suspend_out to Trigger Line Routing - SUSOUT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRKIN</name>
							<description>Trigger Line to MCDS break_in Routing - BRKIN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCC0</name>
					<description>TG Line Counter Control</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TGL</name>
							<description>Trigger Line to Counter Routing - TGL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LE</name>
							<description>Level or Edge Counting - LE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear and Enable Counter(s) - CLR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop Counter(s) - STOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
