J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>TLCC1</name>
					<description>TG Line Counter Control</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TGL</name>
							<description>Trigger Line to Counter Routing - TGL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LE</name>
							<description>Level or Edge Counting - LE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Clear and Enable Counter(s) - CLR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop Counter(s) - STOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCV0</name>
					<description>TG Line Counter Value</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CV</name>
							<description>Count Value - CV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SO</name>
							<description>Sticky Overflow Bit - SO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCV1</name>
					<description>TG Line Counter Value</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CV</name>
							<description>Count Value - CV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SO</name>
							<description>Sticky Overflow Bit - SO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRSS</name>
					<description>TG Routing for Special Signals</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xef0000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TT</name>
							<description>Trigger Line to Cerberus Triggered Transfer Routing - TT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IFS</name>
							<description>Trigger Line to Fault and Stress Injection Routing - IFS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRC0</name>
							<description>Trigger Line to SRC0 Interrupt Routing - SRC0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRC1</name>
							<description>Trigger Line to SRC1 Interrupt Routing - SRC1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>JTAGID</name>
					<description>JTAGDevice Identification Register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x0</resetMask>
					<fields>
						<field>
							<name>JTAG_ID</name>
							<description>JTAGDevice ID - JTAG_ID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMDATA</name>
					<description>Communication Mode Data Register</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Read/Write Data - DATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOSR</name>
					<description>IOClientStatus and Control Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CRSYNC</name>
							<description>Communication Mode Read Sync Flag - CRSYNC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CWSYNC</name>
							<description>Communication Mode Write Sync Flag - CWSYNC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CW_ACK</name>
							<description>Communication Mode Write Acknowledge - CW_ACK</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>COM_SYNC</name>
							<description>Communication Mode Synchronization Flag - COM_SYNC</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HOSTED</name>
							<description>Tool Interface in Use - HOSTED</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHANNEL</name>
							<description>Channel Indication - CHANNEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLS</name>
					<description>TG Line State</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Current State of Trigger Line 1 - TL1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Current State of Trigger Line 2 - TL2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Current State of Trigger Line 3 - TL3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL4</name>
							<description>Current State of Trigger Line 4 - TL4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL5</name>
							<description>Current State of Trigger Line 5 - TL5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL6</name>
							<description>Current State of Trigger Line 6 - TL6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL7</name>
							<description>Current State of Trigger Line 7 - TL7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTL</name>
					<description>TG Capture for TG Lines</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Capture of Trigger Line 1 - TL1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Capture of Trigger Line 2 - TL2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Capture of Trigger Line 3 - TL3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL4</name>
							<description>Capture of Trigger Line 4 - TL4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL5</name>
							<description>Capture of Trigger Line 5 - TL5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL6</name>
							<description>Capture of Trigger Line 6 - TL6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TL7</name>
							<description>Capture of Trigger Line 7 - TL7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OEC</name>
					<description>OCDS Enable Control Register</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PAT</name>
							<description>OCDS Enabling Pattern - PAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>Disable OCDS - DS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OCO</name>
							<description>OCDS Clock Off - OCO</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IF_LCK_P</name>
							<description>IF_LCK Write Protection - IF_LCK_P</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IF_LCK</name>
							<description>Set/Clear Interface Locked Indication - IF_LCK</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUT_OK_P</name>
							<description>AUT_OK Write Protection - AUT_OK_P</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUT_OK</name>
							<description>Set/Clear the Authorization OK Indication - AUT_OK</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCNTRL</name>
					<description>OSCU Control Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OC0_P</name>
							<description>OC0 Write Protection - OC0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC0</name>
							<description>Set/Clear OCDS Control Bits Bus Domain - OC0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC1_P</name>
							<description>OC1 Write Protection - OC1_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC1</name>
							<description>Set/Clear OCDS Control Bits Bus Domain - OC1</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC2_P</name>
							<description>OC2 Write Protection - OC2_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC2</name>
							<description>Set/Clear OCDS Control Bits Bus Domain - OC2</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC3_P</name>
							<description>OC3 Write Protection - OC3_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC3</name>
							<description>Set/Clear OCDS Control Bits Bus Domain - OC3</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC4_P</name>
							<description>OC4 Write Protection - OC4_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC4</name>
							<description>Set/Clear OCDS Control Bits Bus Domain - OC4</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC5_P</name>
							<description>OC5 Write Protection - OC5_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OC5</name>
							<description>Set/Clear OCDS Control Bits Bus Domain - OC5</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WDTSUS_P</name>
							<description>WDTSUS Write Protection - WDTSUS_P</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WDTSUS</name>
							<description>Set/Clear Watchdog Timer Suspension Control - WDTSUS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STABLE_P</name>
							<description>STABLE Write Protection - STABLE_P</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STABLE</name>
							<description>InitializeApplication ResetIndication - STABLE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC0_P</name>
							<description>OJC0 Write Protection - OJC0_P</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC0</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC0</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC1_P</name>
							<description>OJC1 Write Protection - OJC1_P</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC1</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC1</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC2_P</name>
							<description>OJC2 Write Protection - OJC2_P</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC2</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC3_P</name>
							<description>OJC3 Write Protection - OJC3_P</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC3</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC3</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC4_P</name>
							<description>OJC4 Write Protection - OJC4_P</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC4</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC4</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC5_P</name>
							<description>OJC5 Write Protection - OJC5_P</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC5</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC5</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC6_P</name>
							<description>OJC6 Write Protection - OJC6_P</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC6</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC6</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC7_P</name>
							<description>OJC7 Write Protection - OJC7_P</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OJC7</name>
							<description>Set/Clear OCDS Control Bits IOClient Domain - OJC7</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
