J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>OSTATE</name>
					<description>OSCUStatus Register</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x10000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OEN</name>
							<description>OCDS Enabled Flag - OEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OC0</name>
							<description>OCDS Control Bits System Bus Domain - OC0</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OC1</name>
							<description>OCDS Control Bits System Bus Domain - OC1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OC2</name>
							<description>OCDS Control Bits System Bus Domain - OC2</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENIDIS</name>
							<description>OCDS ENDINIT Protection Override - ENIDIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EECTRC</name>
							<description>On Chip Trace Enable - EECTRC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EECDIS</name>
							<description>Emulation Logic Disable - EECDIS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WDTSUS</name>
							<description>Control of Watchdog Timer (WDT) Suspension - WDTSUS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HARR</name>
							<description>Halt after Reset Request - HARR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC1</name>
							<description>OCDS Control Bits IOClient Domain OJC1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC2</name>
							<description>OCDS Control Bits IOClient Domain OJC2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC3</name>
							<description>OCDS Control Bits IOClient Domain OJC3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCL0</name>
							<description>OCDS System Reset Request - RSTCL0</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCL1</name>
							<description>OCDS Debug Reset Request - RSTCL1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OJC6</name>
							<description>OCDS Control Bits IOClient Domain OJC6</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCL3</name>
							<description>OCDS Application Reset Request - RSTCL3</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IF_LCK</name>
							<description>Interface Locked Indication - IF_LCK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUT_OK</name>
							<description>Authorization OK Indication - AUT_OK</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STABLE</name>
							<description>Application Reset Indication - STABLE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OCO</name>
							<description>OCDS debug resource Clock On Indication - OCO</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTMOD</name>
					<description>Internal Mode Status and Control Register</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SET_CRS</name>
							<description>Set Read Sync Flag - SET_CRS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_CWS</name>
							<description>Set Write Sync Flag - SET_CWS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_CS</name>
							<description>Set Communication Synchronization Flag - SET_CS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_CS</name>
							<description>Clear Communication Synchronization Flag - CLR_CS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CHANNEL_P</name>
							<description>CHANNEL Write Protection - CHANNEL_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CHANNEL</name>
							<description>Channel Indication - CHANNEL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SET_INT_MOD</name>
							<description>Enter Internal Mode - SET_INT_MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SET_INT_TRC</name>
							<description>Enable Internally Controlled Triggered Transfer - SET_INT_TRC</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLR_INT_TRC</name>
							<description>Disable Internally Controlled Triggered Transfer - CLR_INT_TRC</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRC_MOD_P</name>
							<description>TRC_MOD Write Protection - TRC_MOD_P</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRC_MOD</name>
							<description>Data Size Definition for Triggered Transfer - TRC_MOD</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INT_MOD</name>
							<description>Internal Mode Enabled Flag - INT_MOD</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INT_TRC</name>
							<description>Internally Controlled Triggered Transfer Enable - INT_TRC</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICTSA</name>
					<description>Internally Controlled Trace Source Register</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Source Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICTTA</name>
					<description>Internally Controlled Trace Destination Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x10f068</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Destination Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLC</name>
					<description>TG Line Control</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TLSP1</name>
							<description>TG Line Signal Processing - TLSP1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP2</name>
							<description>TG Line Signal Processing - TLSP2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP3</name>
							<description>TG Line Signal Processing - TLSP3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP4</name>
							<description>TG Line Signal Processing - TLSP4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP5</name>
							<description>TG Line Signal Processing - TLSP5</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP6</name>
							<description>TG Line Signal Processing - TLSP6</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TLSP7</name>
							<description>TG Line Signal Processing - TLSP7</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TL1ST</name>
					<description>TG Line 1 Suspend Targets</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>C0</name>
							<description>CPU0 as Suspend Target - C0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>C1</name>
							<description>CPU1 as Suspend Target - C1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>C2</name>
							<description>CPU2 as Suspend Target - C2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>C3</name>
							<description>CPU3 as Suspend Target - C3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>C4</name>
							<description>CPU4 as Suspend Target - C4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>C5</name>
							<description>CPU5 as Suspend Target - C5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0</name>
							<description>Master 0 as Suspend Target</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1</name>
							<description>Master 1 as Suspend Target</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2</name>
							<description>Master 2 as Suspend Target</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSS1</name>
							<description>HSSL1 as Suspend Target - HSS1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSS0</name>
							<description>HSSL0 as Suspend Target - HSS0</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA</name>
							<description>DMA as Suspend Target - DMA</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA1</name>
							<description>DMA as Suspend Target - DMA1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSM</name>
							<description>HSM as Suspend Target - HSM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCHE</name>
					<description>TG Line Capture and Hold Enable</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Capture and Hold Enable for Trigger Line 1 - TL1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Capture and Hold Enable for Trigger Line 2 - TL2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Capture and Hold Enable for Trigger Line 3 - TL3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLCHS</name>
					<description>TG Line Capture and Hold Clear</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>Capture and Hold Clear for Trigger Line 1 - TL1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TL2</name>
							<description>Capture and Hold Clear for Trigger Line 2 - TL2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TL3</name>
							<description>Capture and Hold Clear for Trigger Line 3 - TL3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIGS</name>
					<description>Set Trigger to Host Register</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BITNUM</name>
							<description>Service Request Bit Number to Set - BITNUM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIGC</name>
					<description>Clear Trigger to Host Register</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRGx_0</name>
							<description>Request Bits of most important register TRIGx - TRGx_0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_1</name>
							<description>Request Bits of most important register TRIGx - TRGx_1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_2</name>
							<description>Request Bits of most important register TRIGx - TRGx_2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_3</name>
							<description>Request Bits of most important register TRIGx - TRGx_3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_4</name>
							<description>Request Bits of most important register TRIGx - TRGx_4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_5</name>
							<description>Request Bits of most important register TRIGx - TRGx_5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_6</name>
							<description>Request Bits of most important register TRIGx - TRGx_6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_7</name>
							<description>Request Bits of most important register TRIGx - TRGx_7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_8</name>
							<description>Request Bits of most important register TRIGx - TRGx_8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_9</name>
							<description>Request Bits of most important register TRIGx - TRGx_9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_10</name>
							<description>Request Bits of most important register TRIGx - TRGx_10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_11</name>
							<description>Request Bits of most important register TRIGx - TRGx_11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_12</name>
							<description>Request Bits of most important register TRIGx - TRGx_12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_13</name>
							<description>Request Bits of most important register TRIGx - TRGx_13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_14</name>
							<description>Request Bits of most important register TRIGx - TRGx_14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRGx_15</name>
							<description>Request Bits of most important register TRIGx - TRGx_15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>x</name>
							<description>Index of most important register TRIGx - x</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TLT</name>
					<description>TG Line Timer</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TGL</name>
							<description>Timer to Trigger Line Routing - TGL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VTZ</name>
							<description>TG Line Value when Timer Value is Zero - VTZ</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RL</name>
							<description>Reload Timer - RL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value - TIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
