J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>PRIORITY7</name>
					<description>SCI7 Arbiter Priority Register</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR7</name>
					<description>SCI 7 Error Address Capture Register</description>
					<addressOffset>0xF0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR7</name>
					<description>SCI 7 Error Capture Register</description>
					<addressOffset>0xF8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON8</name>
					<description>Protocol Error Control Register 8</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY8</name>
					<description>SCI8 Arbiter Priority Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR8</name>
					<description>SCI 8 Error Address Capture Register</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR8</name>
					<description>SCI 8 Error Capture Register</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON9</name>
					<description>Protocol Error Control Register 9</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY9</name>
					<description>SCI9 Arbiter Priority Register</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR9</name>
					<description>SCI 9 Error Address Capture Register</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR9</name>
					<description>SCI 9 Error Capture Register</description>
					<addressOffset>0x138</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON10</name>
					<description>Protocol Error Control Register 10</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY10</name>
					<description>SCI10 Arbiter Priority Register</description>
					<addressOffset>0x148</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR10</name>
					<description>SCI 10 Error Address Capture Register</description>
					<addressOffset>0x150</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
