J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>ERR10</name>
					<description>SCI 10 Error Capture Register</description>
					<addressOffset>0x158</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON11</name>
					<description>Protocol Error Control Register 11</description>
					<addressOffset>0x160</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY11</name>
					<description>SCI11 Arbiter Priority Register</description>
					<addressOffset>0x168</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR11</name>
					<description>SCI 11 Error Address Capture Register</description>
					<addressOffset>0x170</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR11</name>
					<description>SCI 11 Error Capture Register</description>
					<addressOffset>0x178</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON12</name>
					<description>Protocol Error Control Register 12</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY12</name>
					<description>SCI12 Arbiter Priority Register</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR12</name>
					<description>SCI 12 Error Address Capture Register</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR12</name>
					<description>SCI 12 Error Capture Register</description>
					<addressOffset>0x198</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON13</name>
					<description>Protocol Error Control Register 13</description>
					<addressOffset>0x1A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY13</name>
					<description>SCI13 Arbiter Priority Register</description>
					<addressOffset>0x1A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR13</name>
					<description>SCI 13 Error Address Capture Register</description>
					<addressOffset>0x1B0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR13</name>
					<description>SCI 13 Error Capture Register</description>
					<addressOffset>0x1B8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON14</name>
					<description>Protocol Error Control Register 14</description>
					<addressOffset>0x1C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
