J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>ESR</name>
					<description>Emergency Stop Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENL0</name>
							<description>Emergency Stop Enable for Bit 0 in SRL - ENL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL1</name>
							<description>Emergency Stop Enable for Bit 1 in SRL - ENL1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL2</name>
							<description>Emergency Stop Enable for Bit 2 in SRL - ENL2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL3</name>
							<description>Emergency Stop Enable for Bit 3 in SRL - ENL3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL4</name>
							<description>Emergency Stop Enable for Bit 4 in SRL - ENL4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL5</name>
							<description>Emergency Stop Enable for Bit 5 in SRL - ENL5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL6</name>
							<description>Emergency Stop Enable for Bit 6 in SRL - ENL6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL7</name>
							<description>Emergency Stop Enable for Bit 7 in SRL - ENL7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL8</name>
							<description>Emergency Stop Enable for Bit 8 in SRL - ENL8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL9</name>
							<description>Emergency Stop Enable for Bit 9 in SRL - ENL9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL10</name>
							<description>Emergency Stop Enable for Bit 10 in SRL - ENL10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL11</name>
							<description>Emergency Stop Enable for Bit 11 in SRL - ENL11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL12</name>
							<description>Emergency Stop Enable for Bit 12 in SRL - ENL12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL13</name>
							<description>Emergency Stop Enable for Bit 13 in SRL - ENL13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL14</name>
							<description>Emergency Stop Enable for Bit 14 in SRL - ENL14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL15</name>
							<description>Emergency Stop Enable for Bit 15 in SRL - ENL15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH0</name>
							<description>Emergency Stop Enable for Bit 0 in SRH - ENH0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH1</name>
							<description>Emergency Stop Enable for Bit 1 in SRH - ENH1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH2</name>
							<description>Emergency Stop Enable for Bit 2 in SRH - ENH2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH3</name>
							<description>Emergency Stop Enable for Bit 3 in SRH - ENH3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH4</name>
							<description>Emergency Stop Enable for Bit 4 in SRH - ENH4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH5</name>
							<description>Emergency Stop Enable for Bit 5 in SRH - ENH5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH6</name>
							<description>Emergency Stop Enable for Bit 6 in SRH - ENH6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH7</name>
							<description>Emergency Stop Enable for Bit 7 in SRH - ENH7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH8</name>
							<description>Emergency Stop Enable for Bit 8 in SRH - ENH8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH9</name>
							<description>Emergency Stop Enable for Bit 9 in SRH - ENH9</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH10</name>
							<description>Emergency Stop Enable for Bit 10 in SRH - ENH10</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH11</name>
							<description>Emergency Stop Enable for Bit 11 in SRH - ENH11</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH12</name>
							<description>Emergency Stop Enable for Bit 12 in SRH - ENH12</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH13</name>
							<description>Emergency Stop Enable for Bit 13 in SRH - ENH13</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH14</name>
							<description>Emergency Stop Enable for Bit 14 in SRH - ENH14</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH15</name>
							<description>Emergency Stop Enable for Bit 15 in SRH - ENH15</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UD0</name>
					<description>Upstream Data Register 0</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Received Data - DATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Valid Bit - V</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P</name>
							<description>Parity Bit - P</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C</name>
							<description>Clear Bit - C</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LABF</name>
							<description>Lower Address Bit Field - LABF</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPF</name>
							<description>Internal Parity Flag - IPF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>Parity Error - PERR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UD1</name>
					<description>Upstream Data Register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Received Data - DATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Valid Bit - V</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P</name>
							<description>Parity Bit - P</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C</name>
							<description>Clear Bit - C</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LABF</name>
							<description>Lower Address Bit Field - LABF</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPF</name>
							<description>Internal Parity Flag - IPF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>Parity Error - PERR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UD2</name>
					<description>Upstream Data Register 2</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Received Data - DATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Valid Bit - V</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P</name>
							<description>Parity Bit - P</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C</name>
							<description>Clear Bit - C</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LABF</name>
							<description>Lower Address Bit Field - LABF</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPF</name>
							<description>Internal Parity Flag - IPF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>Parity Error - PERR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UD3</name>
					<description>Upstream Data Register 3</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Received Data - DATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Valid Bit - V</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P</name>
							<description>Parity Bit - P</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C</name>
							<description>Clear Bit - C</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LABF</name>
							<description>Lower Address Bit Field - LABF</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPF</name>
							<description>Internal Parity Flag - IPF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PERR</name>
							<description>Parity Error - PERR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<description>Interrupt Control Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EDIP</name>
							<description>Data Frame Interrupt Node Pointer - EDIP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDIE</name>
							<description>Data Frame Interrupt Enable - EDIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECIP</name>
							<description>Command Frame Interrupt Node Pointer - ECIP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECIE</name>
							<description>Command Frame Interrupt Enable - ECIE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFIP</name>
							<description>Time Frame Interrupt Pointer - TFIP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFIE</name>
							<description>Time Frame Interrupt Enable - TFIE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDIP</name>
							<description>Receive Data Interrupt Pointer - RDIP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDIE</name>
							<description>Receive Data Interrupt Enable - RDIE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Interrupt Status Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DEDI</name>
							<description>Data Frame Interrupt Flag - DEDI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DECI</name>
							<description>Command Frame Interrupt Flag - DECI</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DTFI</name>
							<description>Time Frame Interrupt Flag - DTFI</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>URDI</name>
							<description>Receive Data Interrupt Flag - URDI</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISC</name>
					<description>Interrupt Set Clear Register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CDEDI</name>
							<description>Clear DEDI Flag - CDEDI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDECI</name>
							<description>Clear DECI Flag - CDECI</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDTFI</name>
							<description>Clear DTFI Flag - CDTFI</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CURDI</name>
							<description>Clear URDI Flag - CURDI</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDP</name>
							<description>Clear DP Flag - CDP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CCP</name>
							<description>Clear CP Flag - CCP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDDIS</name>
							<description>Clear DSDIS Flag - CDDIS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SDEDI</name>
							<description>Set DEDI Flag - SDEDI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SDECI</name>
							<description>Set DECI Flag - SDECI</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SDTFI</name>
							<description>Set DTFI Flag - SDTFI</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SURDI</name>
							<description>Set URDI Flag - SURDI</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SDP</name>
							<description>Set DP Bit - SDP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCP</name>
							<description>Set CP Flag - SCP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SDDIS</name>
							<description>Set DSDIS Flag - SDDIS</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCR</name>
					<description>Output Control Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CLP</name>
							<description>FCLP Line Polarity - CLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLP</name>
							<description>SOP Line Polarity - SLP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSLP</name>
							<description>Chip Selection Lines Polarity - CSLP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ILP</name>
							<description>SDI Line Polarity - ILP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKCTRL</name>
							<description>Clock Control - CLKCTRL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSL</name>
							<description>Chip Enable Selection for ENL - CSL</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSH</name>
							<description>Chip Enable Selection for ENH - CSH</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSC</name>
							<description>Chip Enable Selection for ENC - CSC</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDISEL</name>
							<description>Serial Data Input Selection - SDISEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
