J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>DSCE</name>
					<description>Downstream Control Enhanced Register 1</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NDBHE</name>
							<description>Number of SRH Bits Shifted at Data Frames Extension - NDBHE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NDBLE</name>
							<description>Number of SRL Bits Shifted at Data Frames Extension - NDBLE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXEN</name>
							<description>Extension Enable - EXEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCF</name>
							<description>Command-Command Flag - CCF</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INJENP0</name>
							<description>Injection Enable of the Pin 0 Signal - INJENP0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INJPOSP0</name>
							<description>Injection Position of the Pin 0 Signal - INJPOSP0</description>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INJENP1</name>
							<description>Injection Enable of the Pin 1 Signal - INJENP1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INJPOSP1</name>
							<description>Injection Position of the Pin 1 Signal - INJPOSP1</description>
							<bitOffset>25</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CDCM</name>
							<description>Command-Data-Command in Data Repetition Mode - CDCM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USCE</name>
					<description>Upstream Control Enhanced Register 1</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>USTOPRE</name>
							<description>Upstream Time-out Prescaler - USTOPRE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USTOVAL</name>
							<description>Upstream Time-out Value - USTOVAL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USTOEN</name>
							<description>Upstream Time-out Interrupt Enable - USTOEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USTF</name>
							<description>Upstream Time-out Flag - USTF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>USTC</name>
							<description>Upstream Time-out Clear - USTC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>USTS</name>
							<description>Upstream Time-out Set - USTS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UTASR</name>
							<description>Upstream Time-out Alternate Service Request - UTASR</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USTOIP</name>
							<description>Upstream Time-out Interrupt Node Pointer - USTOIP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSDSLE</name>
					<description>Downstream Select Data Source Low Extension Register</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SL16</name>
							<description>Select Source for SRL - SL16</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL17</name>
							<description>Select Source for SRL - SL17</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL18</name>
							<description>Select Source for SRL - SL18</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL19</name>
							<description>Select Source for SRL - SL19</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL20</name>
							<description>Select Source for SRL - SL20</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL21</name>
							<description>Select Source for SRL - SL21</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL22</name>
							<description>Select Source for SRL - SL22</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL23</name>
							<description>Select Source for SRL - SL23</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL24</name>
							<description>Select Source for SRL - SL24</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL25</name>
							<description>Select Source for SRL - SL25</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL26</name>
							<description>Select Source for SRL - SL26</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL27</name>
							<description>Select Source for SRL - SL27</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL28</name>
							<description>Select Source for SRL - SL28</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL29</name>
							<description>Select Source for SRL - SL29</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL30</name>
							<description>Select Source for SRL - SL30</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL31</name>
							<description>Select Source for SRL - SL31</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSDSHE</name>
					<description>Downstream Select Data Source High Extension Register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SH16</name>
							<description>Select Source for SRH - SH16</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH17</name>
							<description>Select Source for SRH - SH17</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH18</name>
							<description>Select Source for SRH - SH18</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH19</name>
							<description>Select Source for SRH - SH19</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH20</name>
							<description>Select Source for SRH - SH20</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH21</name>
							<description>Select Source for SRH - SH21</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH22</name>
							<description>Select Source for SRH - SH22</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH23</name>
							<description>Select Source for SRH - SH23</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH24</name>
							<description>Select Source for SRH - SH24</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH25</name>
							<description>Select Source for SRH - SH25</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH26</name>
							<description>Select Source for SRH - SH26</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH27</name>
							<description>Select Source for SRH - SH27</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH28</name>
							<description>Select Source for SRH - SH28</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH29</name>
							<description>Select Source for SRH - SH29</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH30</name>
							<description>Select Source for SRH - SH30</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SH31</name>
							<description>Select Source for SRH - SH31</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESRE</name>
					<description>Emergency Stop Extension Register</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENL16</name>
							<description>Emergency Stop Enable for Bit 16 in SRL - ENL16</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL17</name>
							<description>Emergency Stop Enable for Bit 17 in SRL - ENL17</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL18</name>
							<description>Emergency Stop Enable for Bit 18 in SRL - ENL18</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL19</name>
							<description>Emergency Stop Enable for Bit 19 in SRL - ENL19</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL20</name>
							<description>Emergency Stop Enable for Bit 20 in SRL - ENL20</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL21</name>
							<description>Emergency Stop Enable for Bit 21 in SRL - ENL21</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL22</name>
							<description>Emergency Stop Enable for Bit 22 in SRL - ENL22</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL23</name>
							<description>Emergency Stop Enable for Bit 23 in SRL - ENL23</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL24</name>
							<description>Emergency Stop Enable for Bit 24 in SRL - ENL24</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL25</name>
							<description>Emergency Stop Enable for Bit 25 in SRL - ENL25</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL26</name>
							<description>Emergency Stop Enable for Bit 26 in SRL - ENL26</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL27</name>
							<description>Emergency Stop Enable for Bit 27 in SRL - ENL27</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL28</name>
							<description>Emergency Stop Enable for Bit 28 in SRL - ENL28</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL29</name>
							<description>Emergency Stop Enable for Bit 29 in SRL - ENL29</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL30</name>
							<description>Emergency Stop Enable for Bit 30 in SRL - ENL30</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENL31</name>
							<description>Emergency Stop Enable for Bit 31 in SRL - ENL31</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH16</name>
							<description>Emergency Stop Enable for Bit 16 in SRH - ENH16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH17</name>
							<description>Emergency Stop Enable for Bit 17 in SRH - ENH17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH18</name>
							<description>Emergency Stop Enable for Bit 18 in SRH - ENH18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH19</name>
							<description>Emergency Stop Enable for Bit 19 in SRH - ENH19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH20</name>
							<description>Emergency Stop Enable for Bit 20 in SRH - ENH20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH21</name>
							<description>Emergency Stop Enable for Bit 21 in SRH - ENH21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH22</name>
							<description>Emergency Stop Enable for Bit 22 in SRH - ENH22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH23</name>
							<description>Emergency Stop Enable for Bit 23 in SRH - ENH23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH24</name>
							<description>Emergency Stop Enable for Bit 24 in SRH - ENH24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH25</name>
							<description>Emergency Stop Enable for Bit 25 in SRH - ENH25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH26</name>
							<description>Emergency Stop Enable for Bit 26 in SRH - ENH26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH27</name>
							<description>Emergency Stop Enable for Bit 27 in SRH - ENH27</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH28</name>
							<description>Emergency Stop Enable for Bit 28 in SRH - ENH28</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH29</name>
							<description>Emergency Stop Enable for Bit 29 in SRH - ENH29</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH30</name>
							<description>Emergency Stop Enable for Bit 30 in SRH - ENH30</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENH31</name>
							<description>Emergency Stop Enable for Bit 31 in SRH - ENH31</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTE</name>
					<description>Downstream Timing Extension Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PPDE</name>
							<description>Passive Phase Length at Data Frames Extension - PPDE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PPCE</name>
							<description>Passive Phase Length at Control Frames Extension - PPCE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NDD</name>
							<description>N Divider Downstream - NDD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PPCEM</name>
							<description>PPCE Extension Bit on the MSB Side - PPCEM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FM</name>
							<description>Fast Mode - FM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CX</name>
							<description>Command Extension Mode - CX</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UL1</name>
							<description>Unlock CX and FM for one write access - UL1</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DDM</name>
					<description>Downstream Data Mirror Register</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DDLM</name>
							<description>Downstream Data Mirror for SRL Shift Register - DDLM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DDHM</name>
							<description>Downstream Data Mirror for SRH Shift Register - DDHM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DDE</name>
					<description>Downstream Data Extension Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DDLE</name>
							<description>Downstream Data Extension for SRL Shift Register - DDLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DDHE</name>
							<description>Downstream Data Extension for SRH Shift Register - DDHE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
