J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>NDAT23</name>
					<description>New Data 2 3</description>
					<addressOffset>0x8E9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ND32</name>
							<description>New Data in Rx Buffer 32 - ND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND33</name>
							<description>New Data in Rx Buffer 33 - ND</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND34</name>
							<description>New Data in Rx Buffer 34 - ND</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND35</name>
							<description>New Data in Rx Buffer 35 - ND</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND36</name>
							<description>New Data in Rx Buffer 36 - ND</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND37</name>
							<description>New Data in Rx Buffer 37 - ND</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND38</name>
							<description>New Data in Rx Buffer 38 - ND</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND39</name>
							<description>New Data in Rx Buffer 39 - ND</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND40</name>
							<description>New Data in Rx Buffer 40 - ND</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND41</name>
							<description>New Data in Rx Buffer 41 - ND</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND42</name>
							<description>New Data in Rx Buffer 42 - ND</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND43</name>
							<description>New Data in Rx Buffer 43 - ND</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND44</name>
							<description>New Data in Rx Buffer 44 - ND</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND45</name>
							<description>New Data in Rx Buffer 45 - ND</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND46</name>
							<description>New Data in Rx Buffer 46 - ND</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND47</name>
							<description>New Data in Rx Buffer 47 - ND</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND48</name>
							<description>New Data in Rx Buffer 48 - ND</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND49</name>
							<description>New Data in Rx Buffer 49 - ND</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND50</name>
							<description>New Data in Rx Buffer 50 - ND</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND51</name>
							<description>New Data in Rx Buffer 51 - ND</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND52</name>
							<description>New Data in Rx Buffer 52 - ND</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND53</name>
							<description>New Data in Rx Buffer 53 - ND</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND54</name>
							<description>New Data in Rx Buffer 54 - ND</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND55</name>
							<description>New Data in Rx Buffer 55 - ND</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND56</name>
							<description>New Data in Rx Buffer 56 - ND</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND57</name>
							<description>New Data in Rx Buffer 57 - ND</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND58</name>
							<description>New Data in Rx Buffer 58 - ND</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND59</name>
							<description>New Data in Rx Buffer 59 - ND</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND60</name>
							<description>New Data in Rx Buffer 60 - ND</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND61</name>
							<description>New Data in Rx Buffer 61 - ND</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND62</name>
							<description>New Data in Rx Buffer 62 - ND</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND63</name>
							<description>New Data in Rx Buffer 63 - ND</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXF0C3</name>
					<description>Rx FIFO 0 Configuration 3</description>
					<addressOffset>0x8EA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F0SA</name>
							<description>Rx FIFO 0 Start Address - F0SA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F0S</name>
							<description>Rx FIFO 0 Size - F0S</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F0WM</name>
							<description>Rx FIFO 0 Watermark - F0WM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F0OM</name>
							<description>FIFO 0 Operation Mode - F0OM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXF0S3</name>
					<description>Rx FIFO 0 Status 3</description>
					<addressOffset>0x8EA4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F0FL</name>
							<description>Rx FIFO 0 Fill Level - F0FL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>F0GI</name>
							<description>Rx FIFO 0 Get Index - F0GI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>F0PI</name>
							<description>Rx FIFO 0 Put Index - F0PI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>F0F</name>
							<description>Rx FIFO 0 Full - F0F</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF0L</name>
							<description>Rx FIFO 0 Message Lost - RF0L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXF0A3</name>
					<description>Rx FIFO 0 Acknowledge 3</description>
					<addressOffset>0x8EA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F0AI</name>
							<description>Rx FIFO 0 Acknowledge Index - F0AI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXBC3</name>
					<description>Rx Buffer Configuration 3</description>
					<addressOffset>0x8EAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RBSA</name>
							<description>Rx Buffer Start Address - RBSA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXF1C3</name>
					<description>Rx FIFO 1 Configuration 3</description>
					<addressOffset>0x8EB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F1SA</name>
							<description>Rx FIFO 1 Start Address - F1SA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F1S</name>
							<description>Rx FIFO 1 Size - F1S</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F1WM</name>
							<description>Rx FIFO 1 Watermark - F1WM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F1OM</name>
							<description>FIFO 1 Operation Mode - F1OM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXF1S3</name>
					<description>Rx FIFO 1 Status 3</description>
					<addressOffset>0x8EB4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F1FL</name>
							<description>Rx FIFO 1 Fill Level - F1FL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>F1GI</name>
							<description>Rx FIFO 1 Get Index - F1GI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>F1PI</name>
							<description>Rx FIFO 1 Put Index - F1PI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>F1F</name>
							<description>Rx FIFO 1 Full - F1F</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF1L</name>
							<description>Rx FIFO 1 Message Lost - RF1L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXF1A3</name>
					<description>Rx FIFO 1 Acknowledge 3</description>
					<addressOffset>0x8EB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F1AI</name>
							<description>Rx FIFO 1 Acknowledge Index - F1AI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXESC3</name>
					<description>Rx Buffer/FIFO Element Size Configuration 3</description>
					<addressOffset>0x8EBC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>F0DS</name>
							<description>Rx FIFO 0 Data Field Size - F0DS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>F1DS</name>
							<description>Rx FIFO 1 Data Field Size - F1DS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RBDS</name>
							<description>Rx Buffer Data Field Size - RBDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXBC3</name>
					<description>Tx Buffer Configuration 3</description>
					<addressOffset>0x8EC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBSA</name>
							<description>Tx Buffers Start Address - TBSA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NDTB</name>
							<description>Number of Dedicated Transmit Buffers - NDTB</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFQS</name>
							<description>Transmit FIFO/Queue Size - TFQS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFQM</name>
							<description>Tx FIFO/Queue Mode - TFQM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXFQS3</name>
					<description>Tx FIFO/Queue Status 3</description>
					<addressOffset>0x8EC4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TFFL</name>
							<description>Tx FIFO Free Level - TFFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFGI</name>
							<description>Tx FIFO Get Index - TFGI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFQPI</name>
							<description>Tx FIFO/Queue Put Index - TFQPI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFQF</name>
							<description>Tx FIFO/Queue Full - TFQF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXESC3</name>
					<description>Tx Buffer Element Size Configuration 3</description>
					<addressOffset>0x8EC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TBDS</name>
							<description>Tx Buffer Data Field Size - TBDS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
