J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>IS</name>
					<description>Interrupt Status Register</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICC60R</name>
							<description>Capture, Compare-Match Rising Edge Flag ICC6xR (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC60F</name>
							<description>Capture, Compare-Match Falling Edge Flag ICC6xF (x=0,1,2) </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC61R</name>
							<description>Capture, Compare-Match Rising Edge Flag ICC6xR (x=0,1,2)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC61F</name>
							<description>Capture, Compare-Match Falling Edge Flag ICC6xF (x=0,1,2) </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC62R</name>
							<description>Capture, Compare-Match Rising Edge Flag ICC6xR (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICC62F</name>
							<description>Capture, Compare-Match Falling Edge Flag ICC6xF (x=0,1,2) </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T12OM</name>
							<description>Timer T12 One-Match Flag - T12OM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T12PM</name>
							<description>Timer T12 Period-Match Flag - T12PM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T13CM</name>
							<description>Timer T13 Compare-Match Flag - T13CM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T13PM</name>
							<description>Timer T13 Period-Match Flag - T13PM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRPF</name>
							<description>Trap Flag - TRPF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRPS</name>
							<description>Trap State - TRPS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHE</name>
							<description>Correct Hall Event - CHE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WHE</name>
							<description>Wrong Hall Event - WHE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IDLE</name>
							<description>IDLE State - IDLE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STR</name>
							<description>Multi-Channel Mode Shadow Transfer Request - STR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISS</name>
					<description>Interrupt Status Set Register</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SCC60R</name>
							<description>Set Capture, Compare-Match Rising Edge Flag - SCC6xR (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC60F</name>
							<description>Set Capture, Compare-Match Falling Edge Flag - SCC6xF (x=0,1,2)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC61R</name>
							<description>Set Capture, Compare-Match Rising Edge Flag - SCC6xR (x=0,1,2)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC61F</name>
							<description>Set Capture, Compare-Match Falling Edge Flag - SCC6xF (x=0,1,2)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC62R</name>
							<description>Set Capture, Compare-Match Rising Edge Flag - SCC6xR (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCC62F</name>
							<description>Set Capture, Compare-Match Falling Edge Flag - SCC6xF (x=0,1,2)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ST12OM</name>
							<description>Set Timer T12 One-Match Flag - ST12OM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ST12PM</name>
							<description>Set Timer T12 Period-Match Flag - ST12PM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ST13CM</name>
							<description>Set Timer T13 Compare-Match Flag - ST13CM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ST13PM</name>
							<description>Set Timer T13 Period-Match Flag - ST13PM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STRPF</name>
							<description>Set Trap Flag - STRPF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWHC</name>
							<description>Software Hall Compare - SWHC</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCHE</name>
							<description>Set Correct Hall Event Flag - SCHE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWHE</name>
							<description>Set Wrong Hall Event Flag - SWHE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SIDLE</name>
							<description>Set IDLE Flag - SIDLE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SSTR</name>
							<description>Set STR Flag - SSTR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Interrupt Status Reset Register</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RCC60R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag - RCC6xR (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC60F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag - RCC6xF (x=0,1,2)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC61R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag - RCC6xR (x=0,1,2)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC61F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag - RCC6xF (x=0,1,2)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC62R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag - RCC6xR (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RCC62F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag - RCC6xF (x=0,1,2)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RT12OM</name>
							<description>Reset Timer T12 One-Match Flag - RT12OM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RT12PM</name>
							<description>Reset Timer T12 Period-Match Flag - RT12PM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RT13CM</name>
							<description>Reset Timer T13 Compare-Match Flag - RT13CM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RT13PM</name>
							<description>Reset Timer T13 Period-Match Flag - RT13PM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RTRPF</name>
							<description>Reset Trap Flag - RTRPF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RCHE</name>
							<description>Reset Correct Hall Event Flag - RCHE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RWHE</name>
							<description>Reset Wrong Hall Event Flag - RWHE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RIDLE</name>
							<description>Reset IDLE Flag - RIDLE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RSTR</name>
							<description>Reset STR Flag - RSTR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INP</name>
					<description>Interrupt Node Pointer Register</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x3940</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INPCC60</name>
							<description>Interrupt Node Pointer for Channel CC6x Interrupts  INPCC6x (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPCC61</name>
							<description>Interrupt Node Pointer for Channel CC6x Interrupts  INPCC6x (x=0,1,2)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPCC62</name>
							<description>Interrupt Node Pointer for Channel CC6x Interrupts  INPCC6x (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPCHE</name>
							<description>Interrupt Node Pointer for the CHE Interrupt - INPCHE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPERR</name>
							<description>Interrupt Node Pointer for Error Interrupts - INPERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPT12</name>
							<description>Interrupt Node Pointer for Timer12 Interrupts - INPT12</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPT13</name>
							<description>Interrupt Node Pointer for Timer13 Interrupt - INPT13</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENCC60R</name>
							<description>Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x ENCC6xF (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC60F</name>
							<description>Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x ENCC6xF (x=0,1,2)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC61R</name>
							<description>Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x ENCC6xF (x=0,1,2)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC61F</name>
							<description>Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x ENCC6xF (x=0,1,2)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC62R</name>
							<description>Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x ENCC6xF (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCC62F</name>
							<description>Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x ENCC6xF (x=0,1,2)</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT12OM</name>
							<description>Enable Interrupt for T12 One-Match - ENT12OM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT12PM</name>
							<description>Enable Interrupt for T12 Period-Match - ENT12PM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT13CM</name>
							<description>Enable Interrupt for T13 Compare-Match - ENT13CM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENT13PM</name>
							<description>Enable Interrupt for T13 Period-Match - ENT13PM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENTRPF</name>
							<description>Enable Interrupt for Trap Flag - ENTRPF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCHE</name>
							<description>Enable Interrupt for Correct Hall Event - ENCHE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENWHE</name>
							<description>Enable Interrupt for Wrong Hall Event - ENWHE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENIDLE</name>
							<description>Enable Idle - ENIDLE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENSTR</name>
							<description>Enable Multi-Channel Mode Shadow Transfer Interrupt - ENSTR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status Register</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0/1 - TGS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0/1 Bus Select - TGB</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS, TGB Write Protection - TG_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control - SUS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection - SUS_P</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State - SUSSTA</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRSTCLR</name>
					<description>Kernel Reset Status Clear Register</description>
					<addressOffset>0xEC</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Kernel Reset Status Clear - CLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST1</name>
					<description>Kernel Reset Register 1</description>
					<addressOffset>0xF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KRST0</name>
					<description>Kernel Reset Register 0</description>
					<addressOffset>0xF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>Kernel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSTAT</name>
							<description>Kernel Reset Status - RSTSTAT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
