J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PMS</name>
			<version>100</version>
			<description>ce_pms</description>
			<groupName>PMS</groupName>
			<baseAddress>0xF0248000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xe8c001</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number - MODREV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type - MODTYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number - MODNUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSTAT</name>
					<description>EVR Status Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRC</name>
							<description>EVRC status - EVRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVC</name>
							<description>VDD Over-voltage event flag - OVC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33</name>
							<description>EVR33 status - EVR33</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OV33</name>
							<description>VDDP3 Over-voltage event flag - OV33</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVSWD</name>
							<description>VEXT Over-voltage event flag - OVSWD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVC</name>
							<description>VDD Under-voltage event flag - UVC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UV33</name>
							<description>VDDP3 Under-voltage event flag - UV33</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVSWD</name>
							<description>VEXT Under-voltage event flag - UVSWD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SYNCLCK</name>
							<description>EVRC Synchronization Input Locked status(sd_sync_in_locked_o) - SYNCLCK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33VOK</name>
							<description>EVR33 Regulator Voltage OK status - EVR33VOK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTC</name>
							<description>EVRC Reset Trigger - RSTC</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST33</name>
							<description>EVR33 Reset Trigger - RST33</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTSWD</name>
							<description>EVR SWD Reset Trigger - RSTSWD</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRCSHLV</name>
							<description>Short to ground - EVRCSHLV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRCSHHV</name>
							<description>Short to supply - EVRCSHHV</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33SHLV</name>
							<description>Short to ground - EVR33SHLV</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33SHHV</name>
							<description>Short to supply - EVR33SHHV</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWDLVL</name>
							<description>VEXT External Supply Level Status - SWDLVL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDVOK</name>
							<description>EVRC Regulator Voltage OK status - SDVOK</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRCMOD</name>
							<description>EVRC Mode - EVRCMOD</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVPRE</name>
							<description>Pre Regulator VDDPD Over-voltage event flag - OVPRE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVSB</name>
							<description>Standby Supply or VEVRSB Over-voltage event flag - OVSB</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVDDM</name>
							<description>ADC VDDM Supply Over-voltage event flag - OVDDM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVPRE</name>
							<description>Pre Regulator VDDPD Under-voltage event flag - UVPRE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVSB</name>
							<description>Standby Supply or VEVRSB Under-voltage event flag - UVSB</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVDDM</name>
							<description>ADC VDDM Supply Under-voltage event flag - UVDDM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRADCSTAT</name>
					<description>EVR Primary ADC Status Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADCCV</name>
							<description>ADC VDD Core Voltage Conversion Result - ADCCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADC33V</name>
							<description>ADC VDDP3 Voltage Conversion Result - ADC33V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCSWDV</name>
							<description>ADC VEXT Supply Conversion Result - ADCSWDV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVC</name>
							<description>EVRC Regulator or VDD Over-voltage event flag - OVC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OV33</name>
							<description>EVR33 Regulator or VDDP3 Over-voltage event flag - OV33</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OVSWD</name>
							<description>Supply Watchdog (SWD) or VEXT Over-voltage event flag - OVSWD</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVC</name>
							<description>EVRC Regulator or VDD Under-voltage event flag - UVC</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UV33</name>
							<description>EVR33 Regulator or VDDP3 Under-voltage event flag - UV33</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UVSWD</name>
							<description>Supply Watchdog (SWD) or VEXT Under-voltage event flag - UVSWD</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRRSTCON</name>
					<description>EVR Reset Control Register</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x597f4a</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RSTCTRIM</name>
							<description>VDD Supply Reset Trim Value - RSTCTRIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RST33TRIM</name>
							<description>VDDP3 Supply Reset Trim Value - RST33TRIM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTSWDTRIM</name>
							<description>VEXT Supply Reset Trim Value - RSTSWDTRIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTCOFF</name>
							<description>VDD Reset Enable - RSTCOFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BPRSTCOFF</name>
							<description>Bit Protection RSTCOFF - BPRSTCOFF</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST33OFF</name>
							<description>VDDP3 Reset Enable - RST33OFF</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BPRST33OFF</name>
							<description>Bit Protection RST33OFF - BPRST33OFF</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RSTSWDOFF</name>
							<description>VEXT Reset Enable - RSTSWDOFF</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BPRSTSWDOFF</name>
							<description>Bit Protection RSTSWDOFF - BPRSTSWDOFF</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRRSTSTAT</name>
					<description>EVR Reset Status Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RSTC</name>
							<description>VDD Supply Reset Value Status - RSTC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST33</name>
							<description>VDDP3 Supply Reset Value Status - RST33</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTSWD</name>
							<description>VEXT Supply Reset Value Status - RSTSWD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTCOFF</name>
							<description>EVRC Reset Enable Status - RSTCOFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST33OFF</name>
							<description>EVR33 Reset Enable Status - RST33OFF</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTSWDOFF</name>
							<description>EVR SWD Reset Enable - RSTSWDOFF</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRTRIM</name>
					<description>EVR Trim Control Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x6c9e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVR33VOUTSEL</name>
							<description>EVR33 Regulator Output Voltage Target Value - EVR33VOUTSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDVOUTSEL</name>
							<description>EVRC Regulator Output Voltage Target Value - SDVOUTSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33VOUTTRIM</name>
							<description>EVR33 Regulator Output Voltage Trim Value - EVR33VOUTTRIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDVOUTTRIM</name>
							<description>EVRC Regulator Output Voltage Trim Value(vtrim_trim_i) - SDVOUTTRIM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRTRIMSTAT</name>
					<description>EVR Trim Status Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x6c9e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVR33VOUTSEL</name>
							<description>EVR33 Regulator Output Voltage Target Value - EVR33VOUTSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDVOUTSEL</name>
							<description>EVRC Regulator Output Voltage Target Value - SDVOUTSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33VOUTTRIM</name>
							<description>EVR33 Regulator Output Voltage Trim Value - EVR33VOUTTRIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDVOUTTRIM</name>
							<description>EVRC Regulator Output Voltage Trim Value(vtrim_trim_o) - SDVOUTTRIM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRMONSTAT1</name>
					<description>EVR Secondary ADC Status Register 1</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADCCV</name>
							<description>VDD Supply Secondary ADC Conversion Result - ADCCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADC33V</name>
							<description>VDDP3 Supply Secondary ADC Conversion Result - ADC33V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCSWDV</name>
							<description>VEXT Supply Secondary ADC Conversion Result - ADCSWDV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ACTVCNT</name>
							<description>Secondary Monitor Activity Counter - ACTVCNT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRMONSTAT2</name>
					<description>EVR Secondary ADC Status Register 2</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADCPRE</name>
							<description>VDDPD Supply Secondary ADC Conversion Result - ADCPRE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCSB</name>
							<description>VEVRSB Supply Secondary ADC Conversion Result - ADCSB</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCVDDM</name>
							<description>VDDM Supply Secondary ADC Conversion Result - ADCVDDM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRMONCTRL</name>
					<description>EVR Secondary Monitor Control Register</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xa5a5a5</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRCOVMOD</name>
							<description>VDD Over-voltage monitoring mode - EVRCOVMOD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PREOVMOD</name>
							<description>EVRPR or VDDPD Over-voltage monitoring mode - PREOVMOD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCUVMOD</name>
							<description>VDD Under-voltage monitoring mode - EVRCUVMOD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PREUVMOD</name>
							<description>EVRPR or VDDPD Under-voltage monitoring mode - PREUVMOD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OVMOD</name>
							<description>VDDP3 Supply Over-voltage monitoring mode - EVR33OVMOD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMOVMOD</name>
							<description>VDDM ADC Supply Over-voltage monitoring mode - VDDMOVMOD</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33UVMOD</name>
							<description>VDDP3 Supply Under-voltage monitoring mode - EVR33UVMOD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMUVMOD</name>
							<description>VDDM ADC Supply Under-voltage monitoring mode - VDDMUVMOD</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOVMOD</name>
							<description>VEXT Over-voltage monitoring mode - SWDOVMOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SBOVMOD</name>
							<description>EVR Standby Supply or VEVRSB Over-voltage monitoring mode - SBOVMOD</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDUVMOD</name>
							<description>VEXT Under-voltage monitoring mode - SWDUVMOD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SBUVMOD</name>
							<description>EVR Standby Supply or VEVRSB Under-voltage monitoring mode - SBUVMOD</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
