J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>EVRMONFILT</name>
					<description>EVR Secondary Monitor Filter Register</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x300</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRCFIL</name>
							<description>VDD Secondary ADC Supply Filter - EVRCFIL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PREFIL</name>
							<description>VDDPD Secondary ADC Supply Filter - PREFIL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33FIL</name>
							<description>VDDP3 Secondary ADC Supply Filter - EVR33FIL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMFIL</name>
							<description>VDDM Secondary ADC Supply Filter - VDDMFIL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDFIL</name>
							<description>VEXT Secondary ADC Supply Filter - SWDFIL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SBFIL</name>
							<description>VEVRSB Secondary ADC Supply Filter - SBFIL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRFIL</name>
							<description>Clear all Spike Filters - CLRFIL</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSIEN</name>
					<description>PMS Interrupt Enable Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OVSWD</name>
							<description>OVSWD Interrupt enable - OVSWD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVSWD</name>
							<description>UVSWD Interrupt enable - UVSWD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OV33</name>
							<description>OV33 Interrupt enable - OV33</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UV33</name>
							<description>UV33 Interrupt enable - UV33</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVC</name>
							<description>OVC Interrupt enable - OVC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVC</name>
							<description>UVC Interrupt enable - UVC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVPRE</name>
							<description>OVPRE Interrupt enable - OVPRE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVPRE</name>
							<description>UVPRE Interrupt enable - UVPRE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVDDM</name>
							<description>OVDDM Interrupt enable - OVDDM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVDDM</name>
							<description>UVDDM Interrupt enable - UVDDM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVSB</name>
							<description>OVSB Interrupt enable - OVSB</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UVSB</name>
							<description>UVSB Interrupt enable - UVSB</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCMOD</name>
							<description>EVRCMOD Interrupt enable - EVRCMOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDVOK</name>
							<description>SDVOK Interrupt enable - SDVOK</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCLCK</name>
							<description>SD SYNCLCK Interrupt enable - SYNCLCK</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDLVL</name>
							<description>SWDLVL Interrupt enable - SWDLVL</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTWKP</name>
							<description>WUTWKP Interrupt enable - WUTWKP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0WKP</name>
							<description>ESR0WKP Interrupt enable - ESR0WKP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1WKP</name>
							<description>ESR1WKP Interrupt enable - ESR1WKP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINAWKP</name>
							<description>PINAWKP Interrupt enable - PINAWKP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBWKP</name>
							<description>PINBWKP Interrupt enable - PINBWKP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRINT</name>
							<description>SCRINT Interrupt enable - SCRINT</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRRST</name>
							<description>SCRRST Interrupt enable - SCRRST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRECC</name>
							<description>SCRECC Interrupt enable - SCRECC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRWDT</name>
							<description>SCRWDT Interrupt enable - SCRWDT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRUVMON</name>
					<description>EVR Secondary Under-voltage Monitor Register</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x75a7b8</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRCUVVAL</name>
							<description>VDD Supply Secondary Monitor Under-voltage threshold - EVRCUVVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33UVVAL</name>
							<description>VDDP3 Supply Secondary Monitor Under-voltage threshold - EVR33UVVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDUVVAL</name>
							<description>VEXT Supply Secondary Monitor Under-voltage threshold - SWDUVVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVROVMON</name>
					<description>EVR Secondary Over-voltage Monitor Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfefefe</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRCOVVAL</name>
							<description>VDD Supply Secondary Monitor Over-voltage threshold - EVRCOVVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OVVAL</name>
							<description>VDDP3 Supply Secondary Monitor Over-voltage threshold - EVR33OVVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOVVAL</name>
							<description>VEXT Supply Secondary Monitor Over-voltage threshold - SWDOVVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRUVMON2</name>
					<description>EVR Secondary Under-voltage Monitor Register 2</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2a7000bc</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PREUVVAL</name>
							<description>VDDPD Supply Secondary Monitor Under-voltage threshold - PREUVVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMUVVAL</name>
							<description>VDDM Supply Secondary Monitor Under-voltage threshold - VDDMUVVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SBUVVAL</name>
							<description>VEVRSB Supply Secondary Monitor Under-voltage threshold - SBUVVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMLVLSEL</name>
							<description>VDDM Level Select - VDDMLVLSEL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVROVMON2</name>
					<description>EVR Secondary Over-voltage Monitor Register 2</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfefefe</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PREOVVAL</name>
							<description>VDDPD Supply Secondary Monitor Over-voltage threshold - PREOVVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDMOVVAL</name>
							<description>VDDM Supply Secondary Monitor Over-voltage threshold - VDDMOVVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SBOVVAL</name>
							<description>VEVRSB Supply Secondary Monitor Over-voltage threshold - SBOVVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMUVMON</name>
					<description>EVR Primary HSM Under-voltage Monitor Register</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x5c824d</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRCUVVAL</name>
							<description>VDD Supply Primary Monitor Alarm Under-voltage threshold - EVRCUVVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33UVVAL</name>
							<description>VDDP3 Supply Primary Monitor Alarm Under-voltage threshold - EVR33UVVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDUVVAL</name>
							<description>VEXT Supply Primary Monitor Alarm Under-voltage threshold - SWDUVVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCOFF</name>
							<description>VDD Primary Monitor UV Alarm Disable - EVRCOFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OFF</name>
							<description>VDDP3 Primary Monitor UV Alarm Disable - EVR33OFF</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOFF</name>
							<description>VEXT Primary Monitor UV Alarm Disable - SWDOFF</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSMFIL</name>
							<description>HSM Voltage Filter - HSMFIL</description>
							<bitOffset>27</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HSMOVMON</name>
					<description>EVR Primary HSM Over-voltage Monitor Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xe1b586</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EVRCOVVAL</name>
							<description>VDD Supply Primary Monitor Alarm Over-voltage threshold - EVRCOVVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OVVAL</name>
							<description>VDDP3 Supply Primary Monitor Alarm Over-voltage threshold - EVR33OVVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOVVAL</name>
							<description>VEXT Supply Primary Monitor Alarm Over-voltage threshold - SWDOVVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCOFF</name>
							<description>VDD Primary Monitor OV Alarm Disable - EVRCOFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVR33OFF</name>
							<description>VDDP3 Primary Monitor OV Alarm Disable - EVR33OFF</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDOFF</name>
							<description>VEXT Primary Monitor OV Alarm Disable - SWDOFF</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVR33CON</name>
					<description>EVR33 Control Register</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x407ed</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SHVH33</name>
							<description>Short to Supply Voltage Threshold(x_i) - SHVH33</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHHVEN</name>
							<description>Short to High Detection Enable - SHHVEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHLVEN</name>
							<description>Short to Low Detection Enable - SHLVEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHVL33</name>
							<description>Short to Ground Voltage Threshold(x_i) - SHVL33</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVROSCCTRL</name>
					<description>EVR Oscillator Control Register</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1f</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OSCFTRIM</name>
							<description>Back-up Clock Fine Trim Value - OSCFTRIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCFPTRIM</name>
							<description>OSC Fine Trim Signed Value - OSCFPTRIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCTEMPOFFS</name>
							<description>Oscillator Temperature Offset Coefficient - OSCTEMPOFFS</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCTRIMEN</name>
							<description>Dynamic Oscillator Trim Enable - OSCTRIMEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
