J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>PMSWCR0</name>
					<description>Standby and Wake-up Control Register 0</description>
					<addressOffset>0xB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1002d0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VEXTSTBYEN</name>
							<description>Standby Entry on VEXT Supply ramp-down - VEXTSTBYEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDDSTBYEN</name>
							<description>Standby Entry on VDD Supply ramp-down - VDDSTBYEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0DFEN</name>
							<description>ESR0 Digital Filter Enable - ESR0DFEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0EDCON</name>
							<description>ESR0 Edge Detection Control - ESR0EDCON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1DFEN</name>
							<description>ESR1 Digital Filter Enable - ESR1DFEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1EDCON</name>
							<description>ESR1 Edge Detection Control - ESR1EDCON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINADFEN</name>
							<description>PINA Digital Filter Enable - PINADFEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINAEDCON</name>
							<description>PINA Edge Detection Control - PINAEDCON</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBDFEN</name>
							<description>PINB Digital Filter Enable - PINBDFEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBEDCON</name>
							<description>PINB Edge Detection Control - PINBEDCON</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STBYRAMSEL</name>
							<description>Standby RAM supply in Standby Mode - STBYRAMSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BLNKFIL</name>
							<description>Blanking Filter delay for Wake-up - BLNKFIL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0WKEN</name>
							<description>ESR0 Wake-up enable from Standby - ESR0WKEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1WKEN</name>
							<description>ESR1 Wake-up enable from Standby - ESR1WKEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINAWKEN</name>
							<description>Pin A Wake-up enable from Standby - PINAWKEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PINBWKEN</name>
							<description>Pin B Wake-up enable from Standby - PINBWKEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWRWKEN</name>
							<description>Standby Wake-up Enable on VEXT Supply ramp-up - PWRWKEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRWKEN</name>
							<description>Standby Controller Wake-up enable from Standby - SCRWKEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PORSTWKEN</name>
							<description>PORST pin Wake-up enable from Standby - PORSTWKEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTWKEN</name>
							<description>WUT Wake-up enable from Standby - WUTWKEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR2</name>
					<description>Standby and Wake-up Control Register 2</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x4000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SCRINT</name>
							<description>Data exchange from Standby Controller to PMS main domain. - SCRINT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRECC</name>
							<description>SCR RAM ECC error / reset flag - SCRECC</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRWDT</name>
							<description>SCR Watchdog Timer error / reset flag - SCRWDT</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRRST</name>
							<description>SCR Software reset flag - SCRRST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCINT</name>
							<description>Data exchange from PMS main domain to Standby Controller. - TCINT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCINTREQ</name>
							<description>SW Interrupt request from PMS to Standby Controller. - TCINTREQ</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SMURST</name>
							<description>SMU Reset indication flag - SMURST</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST</name>
							<description>Application or System Reset indication flag - RST</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR3</name>
					<description>Standby and Wake-up Control Register 3</description>
					<addressOffset>0xC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WUTREL</name>
							<description>WUT reload value. - WUTREL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTEN</name>
							<description>WUT enable - WUTEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSY</name>
							<description>Lock Status - LCK</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTDIV</name>
							<description>WUT clock divider - WUTDIV</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WUTMODE</name>
							<description>WUT mode selection - WUTMODE</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR4</name>
					<description>Standby and Wake-up Control Register 4</description>
					<addressOffset>0xC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BPSCRSTREQ</name>
							<description>Standby Controller Reset request enable - SCRSTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCRSTREQ</name>
							<description>Standby Controller Reset request - SCRSTREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BPPORSTREQ</name>
							<description>Bit Protection for PORSTREQ - PORSTEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PORSTREQ</name>
							<description>SCR Reset behavior on warm PORST in Normal RUN / SLEEP mode - PORSTREQ</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRCLKSEL</name>
							<description>Default Clock selection on Standby Mode Entry - SCRCLKSEL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCRCFG</name>
							<description>Hardware configuration of the 8 bit SCR controller. - SCRCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BPSCREN</name>
							<description>Standby Controller Reset request enable - BPSCREN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCREN</name>
							<description>Standby Controller Enable request - SCREN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR5</name>
					<description>Standby and Wake-up Control Register 5</description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BPTRISTREQ</name>
							<description>Bit protection for Tristate request bit (TRISTREQ) - BPTRISTREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRISTREQ</name>
							<description>Tristate enable - TRISTREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR0TRIST</name>
							<description>ESR0 Tristate enable - ESR0TRIST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PORSTDF</name>
							<description>PORST Digital Filter enable - PORSTDF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCDCSYNCO</name>
							<description>DC-DC Synchronisation Output</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWSTAT</name>
					<description>Standby and Wake-up Status Register</description>
					<addressOffset>0xD4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xa0000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HWCFGEVR</name>
							<description>EVR Hardware Configuration status - HWCFGEVR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HWCFG4</name>
							<description>Hardware Configuration Pin 4 status - HWCFG4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HWCFG5</name>
							<description>Hardware Configuration Pin 5 status - HWCFG5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRIST</name>
							<description>Pad Tristate / Pull-up status - TRIST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TESTMODE</name>
							<description>TESTMODE Pin status - TESTMODE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0TRIST</name>
							<description>ESR0 pin status during Standby - ESR0TRIST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTDF</name>
							<description>PORST Digital Filter status - PORSTDF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCR</name>
							<description>Standby Controller status - SCR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRST</name>
							<description>Standby Controller Reset Indication flag - SCRST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRCLK</name>
							<description>Current Clock configuration for SCR before Standby Mode Entry - SCRCLK</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTREQ</name>
							<description>Standby Controller Reset on warm PORST - PORSTREQ</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTEN</name>
							<description>WUT Enable status - WUTEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTRUN</name>
							<description>WUT Run status - WUTRUN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTMODE</name>
							<description>WUT Mode status - WUTMODE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0INT</name>
							<description>ESR0 Interrupt flag - ESR0INT</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1INT</name>
							<description>ESR1 Interrupt flag - ESR1INT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAINT</name>
							<description>Pin A Interrupt flag - PINAINT</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBINT</name>
							<description>Pin B Interrupt flag - PINBINT</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWSTAT2</name>
					<description>Standby and Wake-up Status Register 2</description>
					<addressOffset>0xD8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x100000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ESR0WKP</name>
							<description>ESR0 Wake-up flag - ESR0WKP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1WKP</name>
							<description>ESR1 Wake-up flag - ESR1WKP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAWKP</name>
							<description>Pin Wake-up flag - PINAWKP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBWKP</name>
							<description>Pin B Wake-up flag - PINBWKP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PWRWKP</name>
							<description>Wake-up event on VEXT Supply ramp-up - PWRWKP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRWKP</name>
							<description>SCR Wake-up flag - SCRWKP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTWKP</name>
							<description>PORST Wake-up flag - PORSTWKP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTWKP</name>
							<description>WUT Wake-up flag - WUTWKP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0OVRUN</name>
							<description>ESR0 Overrun status flag - ESR0OVRUN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1OVRUN</name>
							<description>ESR1 Overrun status flag - ESR1OVRUN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAOVRUN</name>
							<description>Pin A Overrun status flag - PINAOVRUN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBOVRUN</name>
							<description>Pin B Overrun status flag - PINBOVRUN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VDDSTBYEN</name>
							<description>Standby Entry Enable status on VDD Supply ramp-down - VDDSTBYWKEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCROVRUN</name>
							<description>SCR Overrun status flag - SCROVRUN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTOVRUN</name>
							<description>PORST Overrun status flag - PORSTOVRUN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTOVRUN</name>
							<description>WUT Overrun status flag - WUTOVRUN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STBYRAM</name>
							<description>Standby RAM Supply status - STBYRAM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VEXTSTBYEN</name>
							<description>Standby Entry Enable status on VEXT Supply ramp-down - VEXTSTBYWKEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLNKFIL</name>
							<description>Blanking Filter Delay for VEXT Supply Wake-up - BLNKFIL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR0WKEN</name>
							<description>ESR0 Wake-up enable status - ESR0WKEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1WKEN</name>
							<description>ESR1 Wake-up enable status - ESR1WKEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINAWKEN</name>
							<description>Pin A Wake-up enable status - PINAWKEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINBWKEN</name>
							<description>Pin B Wake-up enable status - PINBWKEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PWRWKEN</name>
							<description>Standby Wake-up Enable status on VEXT Supply ramp-up - PWRWKEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCRWKEN</name>
							<description>Standby Controller Wake-up Enable status - SCRWKEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORSTWKEN</name>
							<description>PORST pin Wake-up enable status from Standby - PORSTWKEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WUTWKEN</name>
							<description>WUT Wake-up enable status - WUTWKEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWUTCNT</name>
					<description>Standby WUT Counter Register</description>
					<addressOffset>0xDC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WUTCNT</name>
							<description>WUT counter value. - WUTCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
