J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>AG20_STDBY</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 4 belonging to alarm group i. - SF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 5 belonging to alarm group i. - SF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF6</name>
							<description>Status flag for alarm 6 belonging to alarm group i. - SF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF7</name>
							<description>Status flag for alarm 7 belonging to alarm group i. - SF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 8 belonging to alarm group i. - SF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 9 belonging to alarm group i. - SF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 10 belonging to alarm group i. - SF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF11</name>
							<description>Status flag for alarm 11 belonging to alarm group i. - SF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 12 belonging to alarm group i. - SF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 13 belonging to alarm group i. - SF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF14</name>
							<description>Status flag for alarm 14 belonging to alarm group i. - SF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF15</name>
							<description>Status flag for alarm 15 belonging to alarm group i. - SF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSPERR</name>
							<description>Error Pin Fault State Status Bit - FSPERR</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG21_STDBY</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 0 belonging to alarm group i. - SF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 1 belonging to alarm group i. - SF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF2</name>
							<description>Status flag for alarm 2 belonging to alarm group i. - SF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF3</name>
							<description>Status flag for alarm 3 belonging to alarm group i. - SF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 4 belonging to alarm group i. - SF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 5 belonging to alarm group i. - SF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF7</name>
							<description>Status flag for alarm 7 belonging to alarm group i. - SF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 8 belonging to alarm group i. - SF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 9 belonging to alarm group i. - SF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 10 belonging to alarm group i. - SF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF11</name>
							<description>Status flag for alarm 11 belonging to alarm group i. - SF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 12 belonging to alarm group i. - SF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 13 belonging to alarm group i. - SF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF14</name>
							<description>Status flag for alarm 14 belonging to alarm group i. - SF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF15</name>
							<description>Status flag for alarm 15 belonging to alarm group i. - SF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF16</name>
							<description>Status flag for alarm 16 belonging to alarm group i. - SF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MONBISTSTAT</name>
					<description>SMU_stdby BIST Status Register</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSTOK</name>
							<description>SMU_stdby BIST ok bit - TSTOK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRUN</name>
							<description>SMU_stdby BIST run bit - TSTRUN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTDONE</name>
							<description>SMU_stdby BIST done bit - TSTDONE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SMUERR</name>
							<description>Error found in SMU_stdby found by SMU_stdby BIST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PMSERR</name>
							<description>Error found in PMS SARADC by SMU_stdby BIST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MONBISTCTRL</name>
					<description>SMU_stdby BIST Control Register</description>
					<addressOffset>0x198</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSTEN</name>
							<description>SMU_stdby alarm BIST enable - TSTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTCLR</name>
							<description>SMU_stdby BIST flag clear - TSTCLR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>Bit Protection TSTEN - BITPROT</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD_STDBY</name>
					<description>SMU_stdby Command Register</description>
					<addressOffset>0x19C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SMUEN</name>
							<description>SMU_stdby Module Enable - SMUEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSP0EN</name>
							<description>SMU_stdby FSP0 Error pin enable - FSP0EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSP1EN</name>
							<description>SMU_stdby FSP1 Error pin enable - FSP1EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASCE</name>
							<description>SMU_stdby alarm status clear enable - ASCE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>CMD_STDBY register bits protection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG20FSP_STDBY</name>
					<description>SMU_stdby FSP Configuration Register</description>
					<addressOffset>0x1A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 4 belonging to alarm group i. - FE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 5 belonging to alarm group i. - FE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 6 belonging to alarm group i. - FE6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 7 belonging to alarm group i. - FE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 8 belonging to alarm group i. - FE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 9 belonging to alarm group i. - FE9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 10 belonging to alarm group i. - FE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 11 belonging to alarm group i. - FE11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 12 belonging to alarm group i. - FE12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 13 belonging to alarm group i. - FE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 14 belonging to alarm group i. - FE14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE15</name>
							<description>Fault signaling configuration flag for alarm 15 belonging to alarm group i. - FE15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>AG2iFSP_STDBY register bits protection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG21FSP_STDBY</name>
					<description>SMU_stdby FSP Configuration Register</description>
					<addressOffset>0x1A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FE0</name>
							<description>Fault signaling configuration flag for alarm 0 belonging to alarm group i. - FE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE1</name>
							<description>Fault signaling configuration flag for alarm 1 belonging to alarm group i. - FE1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE2</name>
							<description>Fault signaling configuration flag for alarm 2 belonging to alarm group i. - FE2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE3</name>
							<description>Fault signaling configuration flag for alarm 3 belonging to alarm group i. - FE3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 4 belonging to alarm group i. - FE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 5 belonging to alarm group i. - FE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 7 belonging to alarm group i. - FE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 8 belonging to alarm group i. - FE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 9 belonging to alarm group i. - FE9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 10 belonging to alarm group i. - FE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 11 belonging to alarm group i. - FE11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 12 belonging to alarm group i. - FE12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 13 belonging to alarm group i. - FE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 14 belonging to alarm group i. - FE14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE15</name>
							<description>Fault signaling configuration flag for alarm 15 belonging to alarm group i. - FE15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE16</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i. - FE16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BITPROT</name>
							<description>AG2iFSP_STDBY register bits protection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSSTAT</name>
					<description>Die Temperature Sensor Status Register</description>
					<addressOffset>0x1C0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of the DTS Measurement - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSLIM</name>
					<description>Die Temperature Sensor Limit Register</description>
					<addressOffset>0x1C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xcd806d6</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LOWER</name>
							<description>Lower Limit - LOWER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LLU</name>
							<description>Lower Limit Underflow - LLU</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UPPER</name>
							<description>Upper Limit - UPPER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCK</name>
							<description>HSM Security Lock - SLCK</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UOF</name>
							<description>Upper Limit Overflow - UOF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTSS</name>
					<description>OCDS Trigger Set Select Register</description>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Trigger Set for OTGB0 - OTGB0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Trigger Set for OTGB1 - OTGB1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
