J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>MEMDONE0</name>
					<description>Memory Test Done Status Register 0</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM_DONE</name>
							<description>CPU0 DMEM Test Done Status - CPU0_DMEM_DONE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DTAG_DONE</name>
							<description>CPU0 DTAG Test Done Status - CPU0_DTAG_DONE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PMEM_DONE</name>
							<description>CPU0 PMEM Test Done Status - CPU0_PMEM_DONE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PTAG_DONE</name>
							<description>CPU0 PTAG Test Done Status - CPU0_PTAG_DONE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DLMU_STBY_DONE</name>
							<description>CPU0 STANDBY DLMU Test Done Status - CPU0_DLMU_STBY_DONE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM_DONE</name>
							<description>CPU1 DMEM Test Done Status - CPU1_DMEM_DONE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DTAG_DONE</name>
							<description>CPU1 DTAG Test Done Status - CPU1_DTAG_DONE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PMEM_DONE</name>
							<description>CPU1 PMEM Test Done Status - CPU1_PMEM_DONE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PTAG_DONE</name>
							<description>CPU1 PTAG Test Done Status - CPU1_PTAG_DONE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DLMU_STBY_DONE</name>
							<description>CPU1 STANDBY DLMU Test Done Status - CPU1_DLMU_STBY_DONE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DMEM_DONE</name>
							<description>CPU2 DMEM Test Done Status - CPU2_DMEM_DONE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DTAG_DONE</name>
							<description>CPU2 DTAG Test Done Status - CPU2_DTAG_DONE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PMEM_DONE</name>
							<description>CPU2 PMEM Test Done Status - CPU2_PMEM_DONE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PTAG_DONE</name>
							<description>CPU2 PTAG Test Done Status - CPU2_PTAG_DONE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DLMU_DONE</name>
							<description>CPU2 DLMU memory Test Done Status - CPU2_DLMU_DONE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMDONE1</name>
					<description>Memory Test Done Status Register 1</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM1_DONE</name>
							<description>CPU0 DMEM1 Test Done Status - CPU0_DMEM1_DONE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM1_DONE</name>
							<description>CPU1 DMEM1 Test Done Status - CPU1_DMEM1_DONE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DAM0_DONE</name>
							<description>DAM0 Test Done Status - DAM0_DONE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SADMA_DONE</name>
							<description>Safety DMA Test Done Status - SADMA_DONE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MINI_MCDS_DONE</name>
							<description>MINI MCDS memory Test Done Status - MINI_MCDS_DONE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_FIFO_DONE</name>
							<description>GTM FIFO memory Test Done Status - GTM_FIFO_DONE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_MCS0FAST_DONE</name>
							<description>GTM MCS0 FAST memory Test Done Status - GTM_MCS0FAST_DONE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_MCS1FAST_DONE</name>
							<description>GTM MCS1 FAST memory Test Done Status - GTM_MCS1FAST_DONE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_DPLL1A_DONE</name>
							<description>GTM DPLL1A memory Test Done Status - GTM_DPLL1A_DONE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_DPLL1BC_DONE</name>
							<description>GTM DPLL1BC memory Test Done Status - GTM_DPLL1BC_DONE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_DPLL2_DONE</name>
							<description>GTM DPLL2 memory Test Done Status - GTM_DPLL2_DONE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCAN10_DONE</name>
							<description>MCAN10 memory Test Done Status - MCAN10_DONE</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCAN20_DONE</name>
							<description>MCAN20 memory Test Done Status - MCAN20_DONE</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMDONE2</name>
					<description>Memory Test Done Status Register 2</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PSI5_DONE</name>
							<description>PSI5 memory Test Done Status - PSI5_DONE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERAY_OBF0_DONE</name>
							<description>ERAY OBF0 Test Done Status - ERAY_OBF0_DONE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERAY_TBF_IBF0_DONE</name>
							<description>ERAY TBF IBF0 memory Test Done Status - ERAY_TBF_IBF0_DONE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERAY_MBF0_DONE</name>
							<description>ERAY MBF0 memory Test Done Status - ERAY_MBF0_DONE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCR_XRAM_DONE</name>
							<description>SCR XRAM Test Done Status - SCR_XRAM_DONE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCR_RAMINT_DONE</name>
							<description>SCR Internal RAM Test Done Status - SCR_RAMINT_DONE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GIGETH_RX_DONE</name>
							<description>Gigabit Ethernet RX memoryTest Done Status - GIGETH_RX_DONE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GIGETH_TX_DONE</name>
							<description>Gigabit Ethernet TX memoryTest Done Status - GIGETH_TX_DONE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMFDA0</name>
					<description>Memory Test FDA Status Register 0</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM_FDA</name>
							<description>CPU0 DMEM Test FDA Status - CPU0_DMEM_FDA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DTAG_FDA</name>
							<description>CPU0 DTAG Test FDA Status - CPU0_DTAG_FDA</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PMEM_FDA</name>
							<description>CPU0 PMEM Test FDA Status - CPU0_PMEM_FDA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_PTAG_FDA</name>
							<description>CPU0 PTAG Test FDA Status - CPU0_PTAG_FDA</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0_DLMU_STBY_FDA</name>
							<description>CPU0 STANDBY DLMU Test FDA Status - CPU0_DLMU_STBY_FDA</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM_FDA</name>
							<description>CPU1 DMEM Test FDA Status - CPU1_DMEM_FDA</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DTAG_FDA</name>
							<description>CPU1 DTAG Test FDA Status - CPU1_DTAG_FDA</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PMEM_FDA</name>
							<description>CPU1 PMEM Test FDA Status - CPU1_PMEM_FDA</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_PTAG_FDA</name>
							<description>CPU1 PTAG Test FDA Status - CPU1_PTAG_FDA</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DLMU_STBY_FDA</name>
							<description>CPU1 STANDBY DLMU Test FDA Status - CPU1_DLMU_STBY_FDA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DMEM_FDA</name>
							<description>CPU2 DMEM Test FDA Status - CPU2_DMEM_FDA</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DTAG_FDA</name>
							<description>CPU2 DTAG Test FDA Status - CPU2_DTAG_FDA</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PMEM_FDA</name>
							<description>CPU2 PMEM Test FDA Status - CPU2_PMEM_FDA</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_PTAG_FDA</name>
							<description>CPU2 PTAG Test FDA Status - CPU2_PTAG_FDA</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2_DLMU_FDA</name>
							<description>CPU2 DLMU memory Test FDA Status - CPU2_DLMU_FDA</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMFDA1</name>
					<description>Memory Test FDA Status Register 1</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0_DMEM1_FDA</name>
							<description>CPU0 DMEM1 Test FDA Status - CPU0_DMEM1_FDA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1_DMEM1_FDA</name>
							<description>CPU1 DMEM1 Test FDA Status - CPU1_DMEM1_FDA</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DAM0_FDA</name>
							<description>DAM0 Test FDA Status - DAM0_FDA</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SADMA_FDA</name>
							<description>Safety DMA Test FDA Status - SADMA_FDA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MINI_MCDS_FDA</name>
							<description>MINI MCDS memory Test FDA Status - MINI_MCDS_FDA</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_FIFO_FDA</name>
							<description>GTM FIFO memory Test FDA Status - GTM_FIFO_FDA</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_MCS0FAST_FDA</name>
							<description>GTM MCS0 FAST memory Test FDA Status - GTM_MCS0FAST_FDA</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_MCS1FAST_FDA</name>
							<description>GTM MCS1 FAST memory Test FDA Status - GTM_MCS1FAST_FDA</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_DPLL1A_FDA</name>
							<description>GTM DPLL1A memory Test FDA Status - GTM_DPLL1A_FDA</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_DPLL1BC_FDA</name>
							<description>GTM DPLL1BC memory Test FDA Status - GTM_DPLL1BC_FDA</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTM_DPLL2_FDA</name>
							<description>GTM DPLL2 memory Test FDA Status - GTM_DPLL2_FDA</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCAN10_FDA</name>
							<description>MCAN10 memory Test FDA Status - MCAN10_FDA</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCAN20_FDA</name>
							<description>MCAN20 memory Test FDA Status - MCAN20_FDA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMFDA2</name>
					<description>Memory Test FDA Status Register 2</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PSI5_FDA</name>
							<description>PSI5 memory Test FDA Status - PSI5_FDA</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERAY_OBF0_FDA</name>
							<description>ERAY OBF0 Test FDA Status - ERAY_OBF0_FDA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERAY_TBF_IBF0_FDA</name>
							<description>ERAY TBF IBF0 memory Test FDA Status - ERAY_TBF_IBF0_FDA</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERAY_MBF0_FDA</name>
							<description>ERAY MBF0 memory Test FDA Status - ERAY_MBF0_FDA</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCR_XRAM_FDA</name>
							<description>SCR XRAM Test FDA Status - SCR_XRAM_FDA</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCR_RAMINT_FDA</name>
							<description>SCR Internal RAM Test FDA Status - SCR_RAMINT_FDA</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GIGETH_RX_FDA</name>
							<description>Gigabit Ethernet RX memory Test FDA Status - GIGETH_RX_FDA</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GIGETH_TX_FDA</name>
							<description>Gigabit Ethernet TX SSH memory Test FDA Status - GIGETH_TX_FDA</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCEN1</name>
					<description>Access Enable Register 1</description>
					<addressOffset>0xF8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
