J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>MC11_RDBFL47</name>
					<description>Read Data and Bit Flip Register 47</description>
					<addressOffset>0x1BBE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL48</name>
					<description>Read Data and Bit Flip Register 48</description>
					<addressOffset>0x1BC0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL49</name>
					<description>Read Data and Bit Flip Register 49</description>
					<addressOffset>0x1BC2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL50</name>
					<description>Read Data and Bit Flip Register 50</description>
					<addressOffset>0x1BC4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL51</name>
					<description>Read Data and Bit Flip Register 51</description>
					<addressOffset>0x1BC6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL52</name>
					<description>Read Data and Bit Flip Register 52</description>
					<addressOffset>0x1BC8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL53</name>
					<description>Read Data and Bit Flip Register 53</description>
					<addressOffset>0x1BCA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL54</name>
					<description>Read Data and Bit Flip Register 54</description>
					<addressOffset>0x1BCC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL55</name>
					<description>Read Data and Bit Flip Register 55</description>
					<addressOffset>0x1BCE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL56</name>
					<description>Read Data and Bit Flip Register 56</description>
					<addressOffset>0x1BD0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL57</name>
					<description>Read Data and Bit Flip Register 57</description>
					<addressOffset>0x1BD2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL58</name>
					<description>Read Data and Bit Flip Register 58</description>
					<addressOffset>0x1BD4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL59</name>
					<description>Read Data and Bit Flip Register 59</description>
					<addressOffset>0x1BD6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL60</name>
					<description>Read Data and Bit Flip Register 60</description>
					<addressOffset>0x1BD8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL61</name>
					<description>Read Data and Bit Flip Register 61</description>
					<addressOffset>0x1BDA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL62</name>
					<description>Read Data and Bit Flip Register 62</description>
					<addressOffset>0x1BDC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL63</name>
					<description>Read Data and Bit Flip Register 63</description>
					<addressOffset>0x1BDE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL64</name>
					<description>Read Data and Bit Flip Register 64</description>
					<addressOffset>0x1BE0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL65</name>
					<description>Read Data and Bit Flip Register 65</description>
					<addressOffset>0x1BE2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_RDBFL66</name>
					<description>Read Data and Bit Flip Register 66</description>
					<addressOffset>0x1BE4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_ALMSRCS</name>
					<description>Alarm Sources Configuration Register</description>
					<addressOffset>0x1BEE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x3f</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBE</name>
							<description>Single Bit Error Notification &amp; Tracking Enable - SBE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBE</name>
							<description>Double Bit Error Notification and Tracking Enable - DBE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDRE</name>
							<description>Address Error Notification Enable - ADDRE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVFE</name>
							<description>ETRR Overflow notification enable- OVFE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPENE</name>
							<description>SSH Operational Error Notification Enable - OPENE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MISCE</name>
							<description>SSH Misc. Errors Notification Enable - MISCE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_FAULTSTS</name>
					<description>SSH Safety Faults Status Register </description>
					<addressOffset>0x1BF0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>OPERR</name>
							<description>SSH Critical Operation Error Occured - OPERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MISCERR</name>
							<description>SSH Miscellaneous Error Status- MISCERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_ERRINFO0</name>
					<description>Error Information Register 0</description>
					<addressOffset>0x1BF2</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_ERRINFO1</name>
					<description>Error Information Register 1</description>
					<addressOffset>0x1BF4</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_ERRINFO2</name>
					<description>Error Information Register 2</description>
					<addressOffset>0x1BF6</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_ERRINFO3</name>
					<description>Error Information Register 3</description>
					<addressOffset>0x1BF8</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC11_ERRINFO4</name>
					<description>Error Information Register 4</description>
					<addressOffset>0x1BFA</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC12_CONFIG0</name>
					<description>Configuration Registers</description>
					<addressOffset>0x1C00</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x2002</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>ACCSTYPE</name>
							<description>Access type - ACCSTYPE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NUMACCS</name>
							<description>Number of accesses per address - NUMACCS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC12_CONFIG1</name>
					<description>Configuration Register 1</description>
					<addressOffset>0x1C02</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>ACCSPAT</name>
							<description>Access pattern - ACCSPAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SELFASTB</name>
							<description>Select Fast Bit - SELFASTB</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AG_MOD</name>
							<description>Address Generator Mode - AG_MOD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC12_MCONTROL</name>
					<description>MBIST Control Register</description>
					<addressOffset>0x1C04</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x4008</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>START - START</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESUME</name>
							<description>Resume failed test - RESUME</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESTF</name>
							<description>Enable Sticky Fail Bit - ESTF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIR</name>
							<description>Direction Select - DIR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DINIT</name>
							<description>Data Initialization Enable - DINIT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCADR</name>
							<description>Fast Row / Fast Column Addressing Scheme Select - RCADR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ROWTOG</name>
							<description>Row toggling - ROWTOG</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BITTOG</name>
							<description>Bit toggling - BITTOG</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FAILDMP</name>
							<description>Fail bitmap dump - FAILDMP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN_DESCR</name>
							<description>Enable Descrambling</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRAM_CLR</name>
							<description>Clear the SRAM - SRAM_CLR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC12_MSTATUS</name>
					<description>Status Register</description>
					<addressOffset>0x1C06</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>DONE - DONE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FAIL</name>
							<description>FAIL - FAIL</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FDA</name>
							<description>Fail Dump Available - FDA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SFAIL</name>
							<description>Sticky Fail Bit - SFAIL</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
