J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>MC32_RDBFL43</name>
					<description>Read Data and Bit Flip Register 43</description>
					<addressOffset>0x30B6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL44</name>
					<description>Read Data and Bit Flip Register 44</description>
					<addressOffset>0x30B8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL45</name>
					<description>Read Data and Bit Flip Register 45</description>
					<addressOffset>0x30BA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL46</name>
					<description>Read Data and Bit Flip Register 46</description>
					<addressOffset>0x30BC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL47</name>
					<description>Read Data and Bit Flip Register 47</description>
					<addressOffset>0x30BE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL48</name>
					<description>Read Data and Bit Flip Register 48</description>
					<addressOffset>0x30C0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL49</name>
					<description>Read Data and Bit Flip Register 49</description>
					<addressOffset>0x30C2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL50</name>
					<description>Read Data and Bit Flip Register 50</description>
					<addressOffset>0x30C4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL51</name>
					<description>Read Data and Bit Flip Register 51</description>
					<addressOffset>0x30C6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL52</name>
					<description>Read Data and Bit Flip Register 52</description>
					<addressOffset>0x30C8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL53</name>
					<description>Read Data and Bit Flip Register 53</description>
					<addressOffset>0x30CA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL54</name>
					<description>Read Data and Bit Flip Register 54</description>
					<addressOffset>0x30CC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL55</name>
					<description>Read Data and Bit Flip Register 55</description>
					<addressOffset>0x30CE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL56</name>
					<description>Read Data and Bit Flip Register 56</description>
					<addressOffset>0x30D0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL57</name>
					<description>Read Data and Bit Flip Register 57</description>
					<addressOffset>0x30D2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL58</name>
					<description>Read Data and Bit Flip Register 58</description>
					<addressOffset>0x30D4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL59</name>
					<description>Read Data and Bit Flip Register 59</description>
					<addressOffset>0x30D6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL60</name>
					<description>Read Data and Bit Flip Register 60</description>
					<addressOffset>0x30D8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL61</name>
					<description>Read Data and Bit Flip Register 61</description>
					<addressOffset>0x30DA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL62</name>
					<description>Read Data and Bit Flip Register 62</description>
					<addressOffset>0x30DC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL63</name>
					<description>Read Data and Bit Flip Register 63</description>
					<addressOffset>0x30DE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL64</name>
					<description>Read Data and Bit Flip Register 64</description>
					<addressOffset>0x30E0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL65</name>
					<description>Read Data and Bit Flip Register 65</description>
					<addressOffset>0x30E2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_RDBFL66</name>
					<description>Read Data and Bit Flip Register 66</description>
					<addressOffset>0x30E4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_ALMSRCS</name>
					<description>Alarm Sources Configuration Register</description>
					<addressOffset>0x30EE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x3f</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBE</name>
							<description>Single Bit Error Notification &amp; Tracking Enable - SBE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBE</name>
							<description>Double Bit Error Notification and Tracking Enable - DBE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDRE</name>
							<description>Address Error Notification Enable - ADDRE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVFE</name>
							<description>ETRR Overflow notification enable- OVFE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPENE</name>
							<description>SSH Operational Error Notification Enable - OPENE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MISCE</name>
							<description>SSH Misc. Errors Notification Enable - MISCE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_FAULTSTS</name>
					<description>SSH Safety Faults Status Register </description>
					<addressOffset>0x30F0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>OPERR</name>
							<description>SSH Critical Operation Error Occured - OPERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MISCERR</name>
							<description>SSH Miscellaneous Error Status- MISCERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_ERRINFO0</name>
					<description>Error Information Register 0</description>
					<addressOffset>0x30F2</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_ERRINFO1</name>
					<description>Error Information Register 1</description>
					<addressOffset>0x30F4</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_ERRINFO2</name>
					<description>Error Information Register 2</description>
					<addressOffset>0x30F6</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_ERRINFO3</name>
					<description>Error Information Register 3</description>
					<addressOffset>0x30F8</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC32_ERRINFO4</name>
					<description>Error Information Register 4</description>
					<addressOffset>0x30FA</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>SBERR</name>
							<description>Single Bit Error Detected - SBERR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DBERR</name>
							<description>Double Bit Error Detected - DBERR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDRERR</name>
							<description>Address Fault Detected - ADDRERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC33_CONFIG0</name>
					<description>Configuration Registers</description>
					<addressOffset>0x3100</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x2002</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>ACCSTYPE</name>
							<description>Access type - ACCSTYPE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NUMACCS</name>
							<description>Number of accesses per address - NUMACCS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC33_CONFIG1</name>
					<description>Configuration Register 1</description>
					<addressOffset>0x3102</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>ACCSPAT</name>
							<description>Access pattern - ACCSPAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SELFASTB</name>
							<description>Select Fast Bit - SELFASTB</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AG_MOD</name>
							<description>Address Generator Mode - AG_MOD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
