J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>MC34_ETRR4</name>
					<description>Error Tracking Register 4</description>
					<addressOffset>0x321A</addressOffset>
					<size>16</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Address of Error(i) - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MBI</name>
							<description>Memory Block Index of Error(i) - MBI</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL0</name>
					<description>Read Data and Bit Flip Register 0</description>
					<addressOffset>0x3260</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL1</name>
					<description>Read Data and Bit Flip Register 1</description>
					<addressOffset>0x3262</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL2</name>
					<description>Read Data and Bit Flip Register 2</description>
					<addressOffset>0x3264</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL3</name>
					<description>Read Data and Bit Flip Register 3</description>
					<addressOffset>0x3266</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL4</name>
					<description>Read Data and Bit Flip Register 4</description>
					<addressOffset>0x3268</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL5</name>
					<description>Read Data and Bit Flip Register 5</description>
					<addressOffset>0x326A</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL6</name>
					<description>Read Data and Bit Flip Register 6</description>
					<addressOffset>0x326C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL7</name>
					<description>Read Data and Bit Flip Register 7</description>
					<addressOffset>0x326E</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL8</name>
					<description>Read Data and Bit Flip Register 8</description>
					<addressOffset>0x3270</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL9</name>
					<description>Read Data and Bit Flip Register 9</description>
					<addressOffset>0x3272</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL10</name>
					<description>Read Data and Bit Flip Register 10</description>
					<addressOffset>0x3274</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL11</name>
					<description>Read Data and Bit Flip Register 11</description>
					<addressOffset>0x3276</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL12</name>
					<description>Read Data and Bit Flip Register 12</description>
					<addressOffset>0x3278</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL13</name>
					<description>Read Data and Bit Flip Register 13</description>
					<addressOffset>0x327A</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL14</name>
					<description>Read Data and Bit Flip Register 14</description>
					<addressOffset>0x327C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL15</name>
					<description>Read Data and Bit Flip Register 15</description>
					<addressOffset>0x327E</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL16</name>
					<description>Read Data and Bit Flip Register 16</description>
					<addressOffset>0x3280</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL17</name>
					<description>Read Data and Bit Flip Register 17</description>
					<addressOffset>0x3282</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL18</name>
					<description>Read Data and Bit Flip Register 18</description>
					<addressOffset>0x3284</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL19</name>
					<description>Read Data and Bit Flip Register 19</description>
					<addressOffset>0x3286</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL20</name>
					<description>Read Data and Bit Flip Register 20</description>
					<addressOffset>0x3288</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL21</name>
					<description>Read Data and Bit Flip Register 21</description>
					<addressOffset>0x328A</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL22</name>
					<description>Read Data and Bit Flip Register 22</description>
					<addressOffset>0x328C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL23</name>
					<description>Read Data and Bit Flip Register 23</description>
					<addressOffset>0x328E</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL24</name>
					<description>Read Data and Bit Flip Register 24</description>
					<addressOffset>0x3290</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL25</name>
					<description>Read Data and Bit Flip Register 25</description>
					<addressOffset>0x3292</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL26</name>
					<description>Read Data and Bit Flip Register 26</description>
					<addressOffset>0x3294</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL27</name>
					<description>Read Data and Bit Flip Register 27</description>
					<addressOffset>0x3296</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL28</name>
					<description>Read Data and Bit Flip Register 28</description>
					<addressOffset>0x3298</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL29</name>
					<description>Read Data and Bit Flip Register 29</description>
					<addressOffset>0x329A</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL30</name>
					<description>Read Data and Bit Flip Register 30</description>
					<addressOffset>0x329C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL31</name>
					<description>Read Data and Bit Flip Register 31</description>
					<addressOffset>0x329E</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL32</name>
					<description>Read Data and Bit Flip Register 32</description>
					<addressOffset>0x32A0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL33</name>
					<description>Read Data and Bit Flip Register 33</description>
					<addressOffset>0x32A2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL34</name>
					<description>Read Data and Bit Flip Register 34</description>
					<addressOffset>0x32A4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL35</name>
					<description>Read Data and Bit Flip Register 35</description>
					<addressOffset>0x32A6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL36</name>
					<description>Read Data and Bit Flip Register 36</description>
					<addressOffset>0x32A8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL37</name>
					<description>Read Data and Bit Flip Register 37</description>
					<addressOffset>0x32AA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL38</name>
					<description>Read Data and Bit Flip Register 38</description>
					<addressOffset>0x32AC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL39</name>
					<description>Read Data and Bit Flip Register 39</description>
					<addressOffset>0x32AE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL40</name>
					<description>Read Data and Bit Flip Register 40</description>
					<addressOffset>0x32B0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL41</name>
					<description>Read Data and Bit Flip Register 41</description>
					<addressOffset>0x32B2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC34_RDBFL42</name>
					<description>Read Data and Bit Flip Register 42</description>
					<addressOffset>0x32B4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
