J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>MC95_RDBFL19</name>
					<description>Read Data and Bit Flip Register 19</description>
					<addressOffset>0x6F86</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL20</name>
					<description>Read Data and Bit Flip Register 20</description>
					<addressOffset>0x6F88</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL21</name>
					<description>Read Data and Bit Flip Register 21</description>
					<addressOffset>0x6F8A</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL22</name>
					<description>Read Data and Bit Flip Register 22</description>
					<addressOffset>0x6F8C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL23</name>
					<description>Read Data and Bit Flip Register 23</description>
					<addressOffset>0x6F8E</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL24</name>
					<description>Read Data and Bit Flip Register 24</description>
					<addressOffset>0x6F90</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL25</name>
					<description>Read Data and Bit Flip Register 25</description>
					<addressOffset>0x6F92</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL26</name>
					<description>Read Data and Bit Flip Register 26</description>
					<addressOffset>0x6F94</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL27</name>
					<description>Read Data and Bit Flip Register 27</description>
					<addressOffset>0x6F96</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL28</name>
					<description>Read Data and Bit Flip Register 28</description>
					<addressOffset>0x6F98</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL29</name>
					<description>Read Data and Bit Flip Register 29</description>
					<addressOffset>0x6F9A</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL30</name>
					<description>Read Data and Bit Flip Register 30</description>
					<addressOffset>0x6F9C</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL31</name>
					<description>Read Data and Bit Flip Register 31</description>
					<addressOffset>0x6F9E</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL32</name>
					<description>Read Data and Bit Flip Register 32</description>
					<addressOffset>0x6FA0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL33</name>
					<description>Read Data and Bit Flip Register 33</description>
					<addressOffset>0x6FA2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL34</name>
					<description>Read Data and Bit Flip Register 34</description>
					<addressOffset>0x6FA4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL35</name>
					<description>Read Data and Bit Flip Register 35</description>
					<addressOffset>0x6FA6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL36</name>
					<description>Read Data and Bit Flip Register 36</description>
					<addressOffset>0x6FA8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL37</name>
					<description>Read Data and Bit Flip Register 37</description>
					<addressOffset>0x6FAA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL38</name>
					<description>Read Data and Bit Flip Register 38</description>
					<addressOffset>0x6FAC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL39</name>
					<description>Read Data and Bit Flip Register 39</description>
					<addressOffset>0x6FAE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL40</name>
					<description>Read Data and Bit Flip Register 40</description>
					<addressOffset>0x6FB0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL41</name>
					<description>Read Data and Bit Flip Register 41</description>
					<addressOffset>0x6FB2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL42</name>
					<description>Read Data and Bit Flip Register 42</description>
					<addressOffset>0x6FB4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL43</name>
					<description>Read Data and Bit Flip Register 43</description>
					<addressOffset>0x6FB6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL44</name>
					<description>Read Data and Bit Flip Register 44</description>
					<addressOffset>0x6FB8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL45</name>
					<description>Read Data and Bit Flip Register 45</description>
					<addressOffset>0x6FBA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL46</name>
					<description>Read Data and Bit Flip Register 46</description>
					<addressOffset>0x6FBC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL47</name>
					<description>Read Data and Bit Flip Register 47</description>
					<addressOffset>0x6FBE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL48</name>
					<description>Read Data and Bit Flip Register 48</description>
					<addressOffset>0x6FC0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL49</name>
					<description>Read Data and Bit Flip Register 49</description>
					<addressOffset>0x6FC2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL50</name>
					<description>Read Data and Bit Flip Register 50</description>
					<addressOffset>0x6FC4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL51</name>
					<description>Read Data and Bit Flip Register 51</description>
					<addressOffset>0x6FC6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL52</name>
					<description>Read Data and Bit Flip Register 52</description>
					<addressOffset>0x6FC8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL53</name>
					<description>Read Data and Bit Flip Register 53</description>
					<addressOffset>0x6FCA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL54</name>
					<description>Read Data and Bit Flip Register 54</description>
					<addressOffset>0x6FCC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL55</name>
					<description>Read Data and Bit Flip Register 55</description>
					<addressOffset>0x6FCE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL56</name>
					<description>Read Data and Bit Flip Register 56</description>
					<addressOffset>0x6FD0</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL57</name>
					<description>Read Data and Bit Flip Register 57</description>
					<addressOffset>0x6FD2</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL58</name>
					<description>Read Data and Bit Flip Register 58</description>
					<addressOffset>0x6FD4</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL59</name>
					<description>Read Data and Bit Flip Register 59</description>
					<addressOffset>0x6FD6</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL60</name>
					<description>Read Data and Bit Flip Register 60</description>
					<addressOffset>0x6FD8</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL61</name>
					<description>Read Data and Bit Flip Register 61</description>
					<addressOffset>0x6FDA</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL62</name>
					<description>Read Data and Bit Flip Register 62</description>
					<addressOffset>0x6FDC</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MC95_RDBFL63</name>
					<description>Read Data and Bit Flip Register 63</description>
					<addressOffset>0x6FDE</addressOffset>
					<size>16</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffff</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Word Data - WDATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
