J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU</name>
			<version>100</version>
			<description>ystem Control Unit</description>
			<groupName>SCU</groupName>
			<baseAddress>0xF0036000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xc4c0c1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number - MODREV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODTYPE</name>
							<description>Module Type - MODTYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description>Module Number - MODNUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSCCON</name>
					<description>OSC Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x10</resetValue>
					<resetMask>0xfffff0f0</resetMask>
					<fields>
						<field>
							<name>PLLLV</name>
							<description>Oscillator for PLL Valid Low Status Bit - PLLLV</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OSCRES</name>
							<description>Oscillator Watchdog Reset - OSCRES</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>Oscillator Gain Selection - GAINSEL</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Oscillator Mode - MODE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHBY</name>
							<description>Shaper Bypass - SHBY</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLHV</name>
							<description>Oscillator for PLL Valid High Status Bit - PLLHV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HYSEN</name>
							<description>Hysteresis Enable </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HYSCTL</name>
							<description>Hysteresis Control</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AMPCTL</name>
							<description>Amplitude Control</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCVAL</name>
							<description>OSC Frequency Value - OSCVAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APREN</name>
							<description>Amplitude Regulation Enable - APREN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP0EN</name>
							<description>Capacitance 0 Enable - CAP0EN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP1EN</name>
							<description>Capacitance 1 Enable - CAP1EN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP2EN</name>
							<description>Capacitance 2 Enable - CAP2EN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAP3EN</name>
							<description>Capacitance 3 Enable - CAP3EN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSTAT</name>
					<description>System PLL Status Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x2</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PWDSTAT</name>
							<description>System PLL Power-saving Mode Status - PWDSTAT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCK</name>
							<description>System PLL Lock Status - LOCK</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>K2RDY</name>
							<description>K2 Divider Ready Status - K2RDY</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODRUN</name>
							<description>Modulation Run - MODRUN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCON0</name>
					<description>System PLL Configuration 0 Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x40003a00</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODEN</name>
							<description>Modulation Enable - MODEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIV</name>
							<description>N-Divider Value - NDIV</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLPWD</name>
							<description>System PLL Power Saving Mode - PLLPWD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart DCO Lock Detection - RESLD</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PDIV</name>
							<description>P-Divider Value - PDIV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL</name>
							<description>Input Selection - INSEL</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCON1</name>
					<description>System PLL Configuration 1 Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x5</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>K2DIV</name>
							<description>K2-Divider Value - K2DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCON2</name>
					<description>System PLL Configuration 2 Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x6000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODCFG</name>
							<description>Modulation Configuration - MODCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERPLLSTAT</name>
					<description>Peripheral PLL Status Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x2</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PWDSTAT</name>
							<description>Peripheral PLL Power-saving Mode Status - PWDSTAT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCK</name>
							<description>Peripheral PLL Lock Status - LOCK</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>K3RDY</name>
							<description>K3 Divider Ready Status - K3RDY</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>K2RDY</name>
							<description>K2 Divider Ready Status - K2RDY</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERPLLCON0</name>
					<description>Peripheral PLL Configuration 0 Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x3e00</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DIVBY</name>
							<description>Divider Bypass - DIVBY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIV</name>
							<description>N-Divider Value - NDIV</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLLPWD</name>
							<description>Peripheral PLL Power Saving Mode - PLLPWD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart DCO Lock Detection - RESLD</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PDIV</name>
							<description>P-Divider Value - PDIV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PERPLLCON1</name>
					<description>Peripheral PLL Configuration 1 Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>K2DIV</name>
							<description>K2-Divider Value - K2DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>K3DIV</name>
							<description>K3-Divider Value - K3DIV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON0</name>
					<description>CCU Clock Control Register 0</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x5120112</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STMDIV</name>
							<description>STM Divider Reload Value - STMDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTMDIV</name>
							<description>GTM Divider Reload Value - GTMDIV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRIDIV</name>
							<description>SRI Divider Reload Value - SRIDIV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPDIV</name>
							<description>Low Power Divider Reload Value - LPDIV</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPBDIV</name>
							<description>SPB Divider Reload Value - SPBDIV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BBBDIV</name>
							<description>BBB Divider Reload Value - BBBDIV</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSIDIV</name>
							<description>FSI Divider Reload Value - FSIDIV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSI2DIV</name>
							<description>FSI2 Divider Reload Value - FSI2DIV</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Selection for Source - CLKSEL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request - UP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON1</name>
					<description>CCU Clock Control Register 1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x10100302</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MCANDIV</name>
							<description>MCAN Divider Reload Value - MCANDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELMCAN</name>
							<description>Clock Selection for MCAN - CLKSELMCAN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1DIVDIS</name>
							<description>Divider Disable for fPLL1 - PLL1DIVDIS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>I2CDIV</name>
							<description>I2C Divider Reload Value - I2CDIV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSCDIV</name>
							<description>MSC Divider Reload Value - MSCDIV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELMSC</name>
							<description>Clock Selection for MSC - CLKSELMSC</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>QSPIDIV</name>
							<description>QSPI Divider Reload Value - QSPIDIV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELQSPI</name>
							<description>Clock Selection for QSPI - CLKSELQSPI</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value - STEP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode - DM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value - RESULT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DISCLK</name>
							<description>Disable Clock - DISCLK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTCON</name>
					<description>External Clock Control Register</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>External Clock Enable for EXTCLK0 - EN0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL0</name>
							<description>External Clock Select for EXTCLK0 - SEL0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>External Clock Enable for EXTCLK1 - EN1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSEL</name>
							<description>Negation Selection - NSEL</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEL1</name>
							<description>External Clock Select for EXTCLK1 - SEL1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIV1</name>
							<description>External Clock Divider for EXTCLK1 - DIV1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON2</name>
					<description>CCU Clock Control Register 2</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x7000101</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ASCLINFDIV</name>
							<description>ASCLIN Fast Divider Reload Value - ASCLINFDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASCLINSDIV</name>
							<description>ASCLIN Slow Divider Reload Value - ASCLINSDIV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSELASCLINS</name>
							<description>Clock Selection for ASCLINS - CLKSELASCLINS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ERAYPERON</name>
							<description>Power Safe SwitchOff for ERAY Clock - ERAYPERON</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
