J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>CCUCON3</name>
					<description>CCU Clock Control Register 3</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PLL0MONEN</name>
							<description>PLL0 Clock Monitor Enable - PLL0MONEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1MONEN</name>
							<description>PLL1 Clock Monitor Enable - PLL1MONEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL2MONEN</name>
							<description>PLL2 Clock Monitor Enable - PLL2MONEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPBMONEN</name>
							<description>SPB Clock Monitor Enable - SPBMONEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BACKMONEN</name>
							<description>Backup Clock Monitor Enable - BACKMONEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL0MONTST</name>
							<description>PLL0 Clock Monitor Test - PLL0MONTST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1MONTST</name>
							<description>PLL1 Clock Monitor Test - PLL1MONTST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL2MONTST</name>
							<description>PLL2 Clock Monitor Test - PLL2MONTST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPBMONTST</name>
							<description>SPB Clock Monitor Test - SPBMONTST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BACKMONTST</name>
							<description>Backup Clock Monitor Test - BACKMONTST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request - UP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON4</name>
					<description>CCU Clock Control Register 4</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LOTHR</name>
							<description>Backup Clock Monitor Lower Threshold - LOTHR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UPTHR</name>
							<description>Backup Clock Monitor Upper Threshold - UPTHR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONEN</name>
							<description>Backup Clock Monitor Enable - MONEN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTST</name>
							<description>Backup Clock Monitor Test - MONTST</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request - UP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON5</name>
					<description>CCU Clock Control Register 5</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x30</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GETHDIV</name>
							<description>GETH Divider Reload Value - GETHDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCANHDIV</name>
							<description>MCANH Divider Reload Value - MCANHDIV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update Request - UP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTSTAT</name>
					<description>RSTSTAT</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x3810000</resetValue>
					<resetMask>0xf00fffff</resetMask>
					<fields>
						<field>
							<name>ESR0</name>
							<description>Reset Request Trigger Reset Status for ESR0 - ESR0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1</name>
							<description>Reset Request Trigger Reset Status for ESR1 - ESR1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SMU</name>
							<description>Reset Request Trigger Reset Status for SMU - SMU</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SW</name>
							<description>Reset Request Trigger Reset Status for SW - SW</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STM0</name>
							<description>Reset Request Trigger Reset Status for STM0 Compare Match - STM0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STM1</name>
							<description>Reset Request Trigger Reset Status for STM1 Compare Match (If Product has STM1) - STM1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STM2</name>
							<description>Reset Request Trigger Reset Status for STM2 Compare Match (If Product has STM2) - STM2</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PORST</name>
							<description>Reset Request Trigger Reset Status for PORST - PORST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CB0</name>
							<description>Reset Request Trigger Reset Status for Cerberus System Reset - CB0</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CB1</name>
							<description>Reset Request Trigger Reset Status for Cerberus Debug Reset - CB1</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CB3</name>
							<description>Reset Request Trigger Reset Status for Cerberus Application Reset - CB3</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVRC</name>
							<description>Reset Request Trigger Reset Status for EVRC - EVRC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVR33</name>
							<description>Reset Request Trigger Reset Status for EVR33 - EVR33</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWD</name>
							<description>Reset Request Trigger Reset Status for Supply Watchdog (SWD) - SWD</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMS</name>
							<description>Reset Request Trigger Reset Status for HSM System Reset (HSM S) - HSMS</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMA</name>
							<description>Reset Request Trigger Reset Status for HSM Application Reset (HSM A) - HSMA</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STBYR</name>
							<description>Reset Request Trigger Reset Status for Standby Regulator Watchdog (STBYR) - STBYR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LBPORST</name>
							<description>LBIST termination due to PORST</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LBTERM</name>
							<description>LBIST was properly terminated</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON</name>
					<description>RSTCON</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x282</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ESR0</name>
							<description>ESR0 Reset Request Trigger Reset Configuration - ESR0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESR1</name>
							<description>ESR1 Reset Request Trigger Reset Configuration - ESR1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SMU</name>
							<description>SMU Reset Request Trigger Reset Configuration - SMU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SW</name>
							<description>SW Reset Request Trigger Reset Configuration - SW</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STM0</name>
							<description>STM0 Reset Request Trigger Reset Configuration - STM0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STM1</name>
							<description>STM1 Reset Request Trigger Reset Configuration (If Product has STM1) - STM1</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STM2</name>
							<description>STM2 Reset Request Trigger Reset Configuration (If Product has STM2) - STM2</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ARSTDIS</name>
					<description>ARSTDIS</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STM0DIS</name>
							<description>STM0 Disable Reset - STM0DIS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STM1DIS</name>
							<description>STM1 Disable Reset - STM1DIS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STM2DIS</name>
							<description>STM2 Disable Reset - STM2DIS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWRSTCON</name>
					<description>SWRSTCON</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SWRSTREQ</name>
							<description>Software Reset Request - SWRSTREQ</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON2</name>
					<description>RSTCON2</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FRTO</name>
							<description>Force Reset Timeout - FRTO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRC</name>
							<description>Clear Cold Reset Status - CLRC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CSSx</name>
							<description>CPU x Shutdown State Reached - CSSx</description>
							<bitOffset>7</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>USRINFO</name>
							<description>User Information - USRINFO</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON3</name>
					<description>RSTCON3</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>ESRCFG0</name>
					<description>ESR0 Input Configuration Register</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EDCON</name>
							<description>Edge Detection Control - EDCON</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESRCFG1</name>
					<description>ESR1 Input Configuration Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EDCON</name>
							<description>Edge Detection Control - EDCON</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESROCFG</name>
					<description>ESR Output Configuration Register</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xfffffff0</resetMask>
					<fields>
						<field>
							<name>ARI</name>
							<description>Application Reset Indicator - ARI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ARC</name>
							<description>Application Reset Indicator Clear - ARC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSCON</name>
					<description>System Control Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCTRIG0</name>
							<description>Capture Compare Trigger 0 - CCTRIG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMINTM</name>
							<description>RAM Integrity Modify - RAMINTM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETLUDIS</name>
							<description>Set Latch Update Disable - SETLUDIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DDC</name>
							<description>Disable DXCPL - DDC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON6</name>
					<description>CCU Clock Control Register 6</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0DIV</name>
							<description>CPU0 Divider Reload Value - CPU0DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON7</name>
					<description>CCU Clock Control Register 7</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU1DIV</name>
							<description>CPU1 Divider Reload Value - CPU1DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON8</name>
					<description>CCU Clock Control Register 8</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU2DIV</name>
							<description>CPU2 Divider Reload Value - CPU2DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDR</name>
					<description>ESR Pad Driver Mode Register</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PD0</name>
							<description>Pad Driver Mode for ESR Pins 0 - PD0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PL0</name>
							<description>Pad Level Selection for ESR Pins 0 - PL0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PD1</name>
							<description>Pad Driver Mode for ESR Pins 1 - PD1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PL1</name>
							<description>Pad Level Selection for ESR Pins 1 - PL1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR</name>
					<description>Input/Output Control Register</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xe0</resetValue>
					<resetMask>0xffff0fff</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Control for ESR0 Pin - PC0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PC1</name>
							<description>Control for ESR1 Pin - PC1</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OUT</name>
					<description>ESR Output Register</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Output Bit 0 - P0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>P1</name>
							<description>Output Bit 1 - P1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
