J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>TRAPDIS0</name>
					<description>Trap Disable Register 0</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0ESR0T</name>
							<description>Disable Trap Request ESR0T on CPU0 - CPU0ESR0T</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0ESR1T</name>
							<description>Disable Trap Request ESR1T on CPU0 - CPU0ESR1T</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0TRAP2T</name>
							<description>Disable Trap Request TRAP2T on CPU0 - CPU0TRAP2T</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU0SMUT</name>
							<description>Disable Trap Request SMUT on CPU0 - CPU0SMUT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1ESR0T</name>
							<description>Disable Trap Request ESR0T on CPU1 (If product has CPU1) - CPU1ESR0T</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1ESR1T</name>
							<description>Disable Trap Request ESR1T on CPU1 (If product has CPU1) - CPU1ESR1T</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1TRAP2T</name>
							<description>Disable Trap Request TRAP2T on CPU1 (If product has CPU1) - CPU1TRAP2T</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU1SMUT</name>
							<description>Disable Trap Request SMUT on CPU1 (If product has CPU1) - CPU1SMUT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2ESR0T</name>
							<description>Disable Trap Request ESR0T on CPU2 (If product has CPU2) - CPU2ESR0T</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2ESR1T</name>
							<description>Disable Trap Request ESR1T on CPU2 (If product has CPU2) - CPU2ESR1T</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2TRAP2T</name>
							<description>Disable Trap Request TRAP2T on CPU2 (If product has CPU2) - CPU2TRAP2T</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPU2SMUT</name>
							<description>Disable Trap Request SMUT on CPU2 (If product has CPU2) - CPU2SMUT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLCON0</name>
					<description>LCL CPU0 and CPU2 Control Register</description>
					<addressOffset>0x134</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80010000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LS0</name>
							<description>Lockstep Mode Status - LS0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LSEN0</name>
							<description>Lockstep Enable - LSEN0</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLCON1</name>
					<description>LCL CPU1 and CPU3 Control Register</description>
					<addressOffset>0x138</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80010000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LS1</name>
							<description>Lockstep Mode Status - LS1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LSEN1</name>
							<description>Lockstep Enable - LSEN1</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCLTEST</name>
					<description>LCL Test Register</description>
					<addressOffset>0x13C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LCLT0</name>
							<description>LCL0 Lockstep Test - LCLT0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LCLT1</name>
							<description>LCL1 Lockstep Test - LCLT1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LCLT2</name>
							<description>LCL2 Lockstep Test - LCLT2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PLCLT0</name>
							<description>PFI0 Lockstep Test</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PLCLT1</name>
							<description>PFI1 Lockstep Test </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PLCLT2</name>
							<description>PFI2 Lockstep Test </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHIPID</name>
					<description>Chip Identification Register</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0x0</resetMask>
					<fields>
						<field>
							<name>CHREV</name>
							<description>Chip Revision Number - CHREV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHTEC</name>
							<description>Chip Family - CHTEC</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHPK</name>
							<description>Chip Package - CHPK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHID</name>
							<description>Chip Product - CHID</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EEA</name>
							<description>Emulation or ADAS Extension Available - EEA</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UCODE</name>
							<description>uCode Version - UCODE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSIZE</name>
							<description>Program Flash Size - FSIZE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VART</name>
							<description>Variant - VART</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEC</name>
							<description>Security Device Available - SEC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MANID</name>
					<description>Manufacturer Identification Register</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x1820</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DEPT</name>
							<description>Department Identification Number - DEPT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MANUF</name>
							<description>Manufacturer Identification Number - MANUF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWAPCTRL</name>
					<description>Address Map Control Register</description>
					<addressOffset>0x14C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDRCFG</name>
							<description>Address Configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>Spare</name>
							<description>Spare address configuration registers</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL0</name>
					<description>Logic BIST Control 0 Register</description>
					<addressOffset>0x164</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x400</resetValue>
					<resetMask>0xeff00003</resetMask>
					<fields>
						<field>
							<name>LBISTREQ</name>
							<description>LBIST Request - LBISTREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LBISTRES</name>
							<description>LBIST-Reset- LBISTRES</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PATTERNS</name>
							<description>LBIST Pattern Number - PATTERNS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBISTDONE</name>
							<description>LBIST Execution Indicator - LBISTDONE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LBISTERRINJ</name>
							<description>LBIST / Test-Mode Alarm Error Injection</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBISTREQRED</name>
							<description>LBIST Request Redundancy</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL1</name>
					<description>Logic BIST Control 1 Register</description>
					<addressOffset>0x168</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEED</name>
							<description>LBIST Seed - SEED</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPLITSH</name>
							<description>LBIST Split-Shift Selection - SPLITSH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BODY</name>
							<description>Body Application Indicator - BODY</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBISTFREQU</name>
							<description>LBIST Frequency Selection - LBISTFREQU</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL2</name>
					<description>Logic BIST Control 2 Register</description>
					<addressOffset>0x16C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LENGTH</name>
							<description>LBIST Maximum Scan-Chain Length - LENGTH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBISTCTRL3</name>
					<description>Logic BIST Control 3 Register</description>
					<addressOffset>0x170</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIGNATURE</name>
							<description>LBIST Signature - SIGNATURE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM1</name>
					<description>Start-up Memory Register 1</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory - MEM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM2</name>
					<description>Start-up Memory Register 2</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory - MEM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDISC</name>
					<description>Pad Disable Control Register</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>Pad Disable for ESR Pin 0 - PDIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIS1</name>
							<description>Pad Disable for ESR Pin 1 - PDIS1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR0</name>
					<description>Power Management Transition Control and Status Register 0</description>
					<addressOffset>0x198</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LJTEN</name>
							<description>Load Jump Timer Enable - LJTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTOVEN</name>
							<description>Load Jump Timer Overflow Enable - LJTOVEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTOVIEN</name>
							<description>Load Jump Timer Overflow Interrupt Enable - LJTOVIEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTSTRT</name>
							<description>Load Jump Timer Start - LJTSTRT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTSTP</name>
							<description>Load Jump Timer Stop - LJTSTP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTCLR</name>
							<description>Load Jump Timer Clear - LJTCLR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SDSTEP</name>
							<description>Droop Voltage Step(vdroop_step_i) - SDSTEP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTEN</name>
							<description>Voltage Droop Timer Enable - VDTEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTOVEN</name>
							<description>Voltage Droop Timer Overflow Enable - VDTOVEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTOVIEN</name>
							<description>Voltage Droop Timer Overflow Interrupt Enable - VDTOVIEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTSTRT</name>
							<description>Voltage Droop Timer Start - VDTSTRT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTSTP</name>
							<description>Voltage Droop Timer Stop - VDTSTP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTCLR</name>
							<description>Voltage Droop Timer Clear - VDTCLR</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LPSLPEN</name>
							<description>EVRC Low Power Mode activation on a Sleep Request - LPSLPEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR1</name>
					<description>Power Management Transition Control and Status Register 1</description>
					<addressOffset>0x19C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LJTCV</name>
							<description>Load Jump Timer Compare Setpoint Value - LJTCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTCV</name>
							<description>Voltage Droop Timer Compare Setpoint Value - VDTCV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR2</name>
					<description>Power Management Transition Control and Status Register 2</description>
					<addressOffset>0x1A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LDJMPREQ</name>
							<description>Load Jump Request - LDJMPREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LJTRUN</name>
							<description>Load Jump Timer Run Status - LJTRUN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LJTOV</name>
							<description>Load Jump Timer Overflow Status - LJTOV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LJTOVCLR</name>
							<description>Load Jump Timer Overflow Status Clear - LJTOVCLR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LJTCNT</name>
							<description>Load Jump Timer Value - LJTCNT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTRCSR3</name>
					<description>Power Management Transition Control and Status Register 3</description>
					<addressOffset>0x1A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VDROOPREQ</name>
							<description>Voltage Droop Request - VDROOPREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VDTRUN</name>
							<description>Voltage Droop Timer Run Status - VDTRUN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VDTOV</name>
							<description>Voltage Droop Timer Overflow Status - VDTOV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VDTOVCLR</name>
							<description>Voltage Droop Timer Overflow Status Clear - VDTOVCLR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VDTCNT</name>
							<description>Voltage Droop Timer Value - VDTCNT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM3</name>
					<description>Start-up Memory Register 3</description>
					<addressOffset>0x1C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory - MEM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
