J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>STMEM4</name>
					<description>Start-up Memory Register 4</description>
					<addressOffset>0x1C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory - MEM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM5</name>
					<description>Start-up Memory Register 5</description>
					<addressOffset>0x1C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory - MEM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STMEM6</name>
					<description>Start-up Memory Register 6</description>
					<addressOffset>0x1CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MEM</name>
							<description>Memory - MEM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVCENABLE</name>
					<description>Overlay Enable Register</description>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OVEN0</name>
							<description>Overlay Enable 0 - OVEN0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVEN1</name>
							<description>Overlay Enable 1 (If product has CPU1) - OVEN1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVEN2</name>
							<description>Overlay Enable 2 (If product has CPU2) - OVEN2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVCCON</name>
					<description>Overlay Control Register</description>
					<addressOffset>0x1E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CSEL0</name>
							<description>CPU Select 0 - CSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CSEL1</name>
							<description>CPU Select 1 (If product has CPU1) - CSEL1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CSEL2</name>
							<description>CPU Select 2 (If product has CPU2) - CSEL2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OVSTRT</name>
							<description>Overlay Start - OVSTRT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OVSTP</name>
							<description>Overlay Stop - OVSTP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCINVAL</name>
							<description>Data Cache Invalidate - DCINVAL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OVCONF</name>
							<description>Overlay Configured - OVCONF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>POVCONF</name>
							<description>Write Protection for OVCONF - POVCONF</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIFILT</name>
					<description>External Input Filter Register</description>
					<addressOffset>0x20C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FILRQ0A</name>
							<description>Filter Enable for REQ0A - FILRQ0A</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ5A</name>
							<description>Filter Enable for REQ5A - FILRQ5A</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ2A</name>
							<description>Filter Enable for REQ2A - FILRQ2A</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ3A</name>
							<description>Filter Enable for REQ3A - FILRQ3A</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ0C</name>
							<description>Filter Enable for REQ0C - FILRQ0C</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ1C</name>
							<description>Filter Enable for REQ1C - FILRQ1C</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ3C</name>
							<description>Filter Enable for REQ3C - FILRQ3C</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ2C</name>
							<description>Filter Enable for REQ2C - FILRQ2C</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ4A</name>
							<description>Filter Enable for REQ4A - FILRQ4A</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ6A</name>
							<description>Filter Enable for REQ6A - FILRQ6A</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ1A</name>
							<description>Filter Enable for REQ1A - FILRQ1A</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ7A</name>
							<description>Filter Enable for REQ7A - FILRQ7A</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ6D</name>
							<description>Filter Enable for REQ6D - FILRQ6D</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ4D</name>
							<description>Filter Enable for REQ4D - FILRQ4D</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ2B</name>
							<description>Filter Enable for REQ2B - FILRQ2B</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ3B</name>
							<description>Filter Enable for REQ3B - FILRQ3B</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILRQ7C</name>
							<description>Filter Enable for REQ7C - FILRQ7C</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FILTDIV</name>
							<description>Digital Glitch Filter Clock Predivider - FILTDIV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEPTH</name>
							<description>Digital Glitch Filter Depth - DEPTH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EICR0</name>
					<description>External Input Channel Register 0</description>
					<addressOffset>0x210</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EXIS0</name>
							<description>External Input Selection 0 - EXIS0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN0</name>
							<description>Falling Edge Enable 0 - FEN0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN0</name>
							<description>Rising Edge Enable 0 - REN0</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN0</name>
							<description>Level Detection Enable 0 - LDEN0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN0</name>
							<description>External Input Enable 0 - EIEN0</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP0</name>
							<description>Input Node Pointer - INP0</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXIS1</name>
							<description>External Input Selection 1 - EXIS1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN1</name>
							<description>Falling Edge Enable 1 - FEN1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN1</name>
							<description>Rising Edge Enable 1 - REN1</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN1</name>
							<description>Level Detection Enable 1 - LDEN1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN1</name>
							<description>External Input Enable 1 - EIEN1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP1</name>
							<description>Input Node Pointer - INP1</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EICR1</name>
					<description>External Input Channel Register 1</description>
					<addressOffset>0x214</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EXIS0</name>
							<description>External Input Selection 0 - EXIS0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN0</name>
							<description>Falling Edge Enable 0 - FEN0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN0</name>
							<description>Rising Edge Enable 0 - REN0</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN0</name>
							<description>Level Detection Enable 0 - LDEN0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN0</name>
							<description>External Input Enable 0 - EIEN0</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP0</name>
							<description>Input Node Pointer - INP0</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXIS1</name>
							<description>External Input Selection 1 - EXIS1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN1</name>
							<description>Falling Edge Enable 1 - FEN1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN1</name>
							<description>Rising Edge Enable 1 - REN1</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN1</name>
							<description>Level Detection Enable 1 - LDEN1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN1</name>
							<description>External Input Enable 1 - EIEN1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP1</name>
							<description>Input Node Pointer - INP1</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EICR2</name>
					<description>External Input Channel Register 2</description>
					<addressOffset>0x218</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EXIS0</name>
							<description>External Input Selection 0 - EXIS0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN0</name>
							<description>Falling Edge Enable 0 - FEN0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN0</name>
							<description>Rising Edge Enable 0 - REN0</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN0</name>
							<description>Level Detection Enable 0 - LDEN0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN0</name>
							<description>External Input Enable 0 - EIEN0</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP0</name>
							<description>Input Node Pointer - INP0</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXIS1</name>
							<description>External Input Selection 1 - EXIS1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN1</name>
							<description>Falling Edge Enable 1 - FEN1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN1</name>
							<description>Rising Edge Enable 1 - REN1</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN1</name>
							<description>Level Detection Enable 1 - LDEN1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN1</name>
							<description>External Input Enable 1 - EIEN1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP1</name>
							<description>Input Node Pointer - INP1</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EICR3</name>
					<description>External Input Channel Register 3</description>
					<addressOffset>0x21C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EXIS0</name>
							<description>External Input Selection 0 - EXIS0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN0</name>
							<description>Falling Edge Enable 0 - FEN0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN0</name>
							<description>Rising Edge Enable 0 - REN0</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN0</name>
							<description>Level Detection Enable 0 - LDEN0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN0</name>
							<description>External Input Enable 0 - EIEN0</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP0</name>
							<description>Input Node Pointer - INP0</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EXIS1</name>
							<description>External Input Selection 1 - EXIS1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN1</name>
							<description>Falling Edge Enable 1 - FEN1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REN1</name>
							<description>Rising Edge Enable 1 - REN1</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDEN1</name>
							<description>Level Detection Enable 1 - LDEN1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EIEN1</name>
							<description>External Input Enable 1 - EIEN1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INP1</name>
							<description>Input Node Pointer - INP1</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EIFR</name>
					<description>External Input Flag Register</description>
					<addressOffset>0x220</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INTF0</name>
							<description>External Event Flag of Channel 0 - INTF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF1</name>
							<description>External Event Flag of Channel 1 - INTF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF2</name>
							<description>External Event Flag of Channel 2 - INTF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF3</name>
							<description>External Event Flag of Channel 3 - INTF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF4</name>
							<description>External Event Flag of Channel 4 - INTF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF5</name>
							<description>External Event Flag of Channel 5 - INTF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF6</name>
							<description>External Event Flag of Channel 6 - INTF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTF7</name>
							<description>External Event Flag of Channel 7 - INTF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
