J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>FMR</name>
					<description>Flag Modification Register</description>
					<addressOffset>0x224</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FS0</name>
							<description>Set Flag INTFx for Channel 0 - FS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS1</name>
							<description>Set Flag INTFx for Channel 1 - FS1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS2</name>
							<description>Set Flag INTFx for Channel 2 - FS2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS3</name>
							<description>Set Flag INTFx for Channel 3 - FS3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS4</name>
							<description>Set Flag INTFx for Channel 4 - FS4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS5</name>
							<description>Set Flag INTFx for Channel 5 - FS5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS6</name>
							<description>Set Flag INTFx for Channel 6 - FS6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FS7</name>
							<description>Set Flag INTFx for Channel 7 - FS7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC0</name>
							<description>Clear Flag INTFx for Channel 0 - FC0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC1</name>
							<description>Clear Flag INTFx for Channel 1 - FC1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC2</name>
							<description>Clear Flag INTFx for Channel 2 - FC2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC3</name>
							<description>Clear Flag INTFx for Channel 3 - FC3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC4</name>
							<description>Clear Flag INTFx for Channel 4 - FC4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC5</name>
							<description>Clear Flag INTFx for Channel 5 - FC5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC6</name>
							<description>Clear Flag INTFx for Channel 6 - FC6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FC7</name>
							<description>Clear Flag INTFx for Channel 7 - FC7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDRR</name>
					<description>Pattern Detection Result Register</description>
					<addressOffset>0x228</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PDR0</name>
							<description>Pattern Detection Result of Channel 0 - PDR0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR1</name>
							<description>Pattern Detection Result of Channel 1 - PDR1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR2</name>
							<description>Pattern Detection Result of Channel 2 - PDR2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR3</name>
							<description>Pattern Detection Result of Channel 3 - PDR3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR4</name>
							<description>Pattern Detection Result of Channel 4 - PDR4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR5</name>
							<description>Pattern Detection Result of Channel 5 - PDR5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR6</name>
							<description>Pattern Detection Result of Channel 6 - PDR6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDR7</name>
							<description>Pattern Detection Result of Channel 7 - PDR7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IGCR0</name>
					<description>Flag Gating Register 0</description>
					<addressOffset>0x22C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IPEN00</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN00</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN01</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN01</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN02</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN02</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN03</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN03</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN04</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN04</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN05</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN05</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN06</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN06</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN07</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN07</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN0</name>
							<description>Generate Event Enable 0 - GEEN0</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP0</name>
							<description>Interrupt Gating Pattern 0 - IGP0</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN10</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN11</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN11</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN12</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN12</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN13</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN13</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN14</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN14</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN15</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN15</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN16</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN16</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN17</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN17</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN1</name>
							<description>Generate Event Enable 1 - GEEN1</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP1</name>
							<description>Interrupt Gating Pattern 1 - IGP1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IGCR1</name>
					<description>Flag Gating Register 1</description>
					<addressOffset>0x230</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IPEN00</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN00</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN01</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN01</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN02</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN02</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN03</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN03</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN04</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN04</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN05</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN05</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN06</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN06</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN07</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN07</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN0</name>
							<description>Generate Event Enable 0 - GEEN0</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP0</name>
							<description>Interrupt Gating Pattern 0 - IGP0</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN10</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN11</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN11</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN12</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN12</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN13</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN13</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN14</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN14</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN15</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN15</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN16</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN16</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN17</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN17</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN1</name>
							<description>Generate Event Enable 1 - GEEN1</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP1</name>
							<description>Interrupt Gating Pattern 1 - IGP1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IGCR2</name>
					<description>Flag Gating Register 2</description>
					<addressOffset>0x234</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IPEN00</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN00</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN01</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN01</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN02</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN02</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN03</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN03</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN04</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN04</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN05</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN05</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN06</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN06</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN07</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN07</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN0</name>
							<description>Generate Event Enable 0 - GEEN0</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP0</name>
							<description>Interrupt Gating Pattern 0 - IGP0</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN10</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN11</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN11</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN12</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN12</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN13</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN13</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN14</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN14</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN15</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN15</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN16</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN16</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN17</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN17</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN1</name>
							<description>Generate Event Enable 1 - GEEN1</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP1</name>
							<description>Interrupt Gating Pattern 1 - IGP1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
