J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>IGCR3</name>
					<description>Flag Gating Register 3</description>
					<addressOffset>0x238</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IPEN00</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN00</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN01</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN01</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN02</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN02</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN03</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN03</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN04</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN04</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN05</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN05</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN06</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN06</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN07</name>
							<description>Flag Pattern Enable for Channel 0 - IPEN07</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN0</name>
							<description>Generate Event Enable 0 - GEEN0</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP0</name>
							<description>Interrupt Gating Pattern 0 - IGP0</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN10</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN11</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN11</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN12</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN12</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN13</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN13</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN14</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN14</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN15</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN15</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN16</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN16</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IPEN17</name>
							<description>Interrupt Pattern Enable for Channel 1 - IPEN17</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GEEN1</name>
							<description>Generate Event Enable 1 - GEEN1</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGP1</name>
							<description>Interrupt Gating Pattern 1 - IGP1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU0CON0</name>
					<description>WDTCPU0CON0</description>
					<addressOffset>0x24C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfffc000e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENDINIT</name>
							<description>End-of-Initialization Control Bit - ENDINIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Bit to Control Access to WDTxCON0 - LCK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PW</name>
							<description>User-Definable Password Field for Access to WDTxCON0 - PW</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REL</name>
							<description>Reload Value for the WDT (also Time Check Value) - REL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU0CON1</name>
					<description>WDTCPU0CON1</description>
					<addressOffset>0x250</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IR0</name>
							<description>Input Frequency Request Control - IR1,IR0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Request Control Bit - DR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IR1</name>
							<description>Input Frequency Request Control - IR1,IR0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UR</name>
							<description>Unlock Restriction Request Control Bit - UR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PAR</name>
							<description>Password Auto-sequence Request Bit - PAR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCR</name>
							<description>Counter Check Request Bit - TCR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCTR</name>
							<description>Timer Check Tolerance Request - TCTR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU0SR</name>
					<description>WDTCPU0SR</description>
					<addressOffset>0x254</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xfffc0010</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AE</name>
							<description>Watchdog Access Error Status Flag - AE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>Watchdog Overflow Error Status Flag - OE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IS0</name>
							<description>Watchdog Input Clock Status - IS1,IS0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>Watchdog Enable/Disable Status Flag - DS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO</name>
							<description>Watchdog Time-Out Mode Flag - TO</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IS1</name>
							<description>Watchdog Input Clock Status - IS1,IS0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>US</name>
							<description>SMU Unlock Restriction Status Flag - US</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PAS</name>
							<description>Password Auto-sequence Status Flag - PAS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCS</name>
							<description>Timer Check Status Flag - TCS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCT</name>
							<description>Timer Check Tolerance - TCT</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value - TIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU1CON0</name>
					<description>WDTCPU1CON0</description>
					<addressOffset>0x258</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfffc000f</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENDINIT</name>
							<description>End-of-Initialization Control Bit - ENDINIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Bit to Control Access to WDTxCON0 - LCK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PW</name>
							<description>User-Definable Password Field for Access to WDTxCON0 - PW</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REL</name>
							<description>Reload Value for the WDT (also Time Check Value) - REL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU1CON1</name>
					<description>WDTCPU1CON1</description>
					<addressOffset>0x25C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IR0</name>
							<description>Input Frequency Request Control - IR1,IR0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Request Control Bit - DR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IR1</name>
							<description>Input Frequency Request Control - IR1,IR0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UR</name>
							<description>Unlock Restriction Request Control Bit - UR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PAR</name>
							<description>Password Auto-sequence Request Bit - PAR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCR</name>
							<description>Counter Check Request Bit - TCR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCTR</name>
							<description>Timer Check Tolerance Request - TCTR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU1SR</name>
					<description>WDTCPU1SR</description>
					<addressOffset>0x260</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xfffc0008</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AE</name>
							<description>Watchdog Access Error Status Flag - AE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>Watchdog Overflow Error Status Flag - OE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IS0</name>
							<description>Watchdog Input Clock Status - IS1,IS0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>Watchdog Enable/Disable Status Flag - DS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO</name>
							<description>Watchdog Time-Out Mode Flag - TO</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IS1</name>
							<description>Watchdog Input Clock Status - IS1,IS0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>US</name>
							<description>SMU Unlock Restriction Status Flag - US</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PAS</name>
							<description>Password Auto-sequence Status Flag - PAS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCS</name>
							<description>Timer Check Status Flag - TCS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCT</name>
							<description>Timer Check Tolerance - TCT</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value - TIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU2CON0</name>
					<description>WDTCPU2CON0</description>
					<addressOffset>0x264</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfffc000f</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENDINIT</name>
							<description>End-of-Initialization Control Bit - ENDINIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Bit to Control Access to WDTxCON0 - LCK</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PW</name>
							<description>User-Definable Password Field for Access to WDTxCON0 - PW</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REL</name>
							<description>Reload Value for the WDT (also Time Check Value) - REL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU2CON1</name>
					<description>WDTCPU2CON1</description>
					<addressOffset>0x268</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IR0</name>
							<description>Input Frequency Request Control - IR1,IR0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Request Control Bit - DR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IR1</name>
							<description>Input Frequency Request Control - IR1,IR0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UR</name>
							<description>Unlock Restriction Request Control Bit - UR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PAR</name>
							<description>Password Auto-sequence Request Bit - PAR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCR</name>
							<description>Counter Check Request Bit - TCR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCTR</name>
							<description>Timer Check Tolerance Request - TCTR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCPU2SR</name>
					<description>WDTCPU2SR</description>
					<addressOffset>0x26C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xfffc0008</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AE</name>
							<description>Watchdog Access Error Status Flag - AE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OE</name>
							<description>Watchdog Overflow Error Status Flag - OE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IS0</name>
							<description>Watchdog Input Clock Status - IS1,IS0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DS</name>
							<description>Watchdog Enable/Disable Status Flag - DS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO</name>
							<description>Watchdog Time-Out Mode Flag - TO</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IS1</name>
							<description>Watchdog Input Clock Status - IS1,IS0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>US</name>
							<description>SMU Unlock Restriction Status Flag - US</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PAS</name>
							<description>Password Auto-sequence Status Flag - PAS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCS</name>
							<description>Timer Check Status Flag - TCS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCT</name>
							<description>Timer Check Tolerance - TCT</description>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TIM</name>
							<description>Timer Value - TIM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EICON0</name>
					<description>ENDINIT Global Control Register 0</description>
					<addressOffset>0x29C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfffc000e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENDINIT</name>
							<description>End-of-Initialization Control Bit - ENDINIT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPW</name>
							<description>User-Definable ENDINIT Password Field - EPW</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REL</name>
							<description>Reload Value for the ENDINIT Timeout Counter - REL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
