J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>AG10CF1</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x17C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x30000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF3</name>
							<description>Configuration flag x (x=0-2) for alarm 3 belonging to alarm group i. - CF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF6</name>
							<description>Configuration flag x (x=0-2) for alarm 6 belonging to alarm group i. - CF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF7</name>
							<description>Configuration flag x (x=0-2) for alarm 7 belonging to alarm group i. - CF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF11</name>
							<description>Configuration flag x (x=0-2) for alarm 11 belonging to alarm group i. - CF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF14</name>
							<description>Configuration flag x (x=0-2) for alarm 14 belonging to alarm group i. - CF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF15</name>
							<description>Configuration flag x (x=0-2) for alarm 15 belonging to alarm group i. - CF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF16</name>
							<description>Configuration flag x (x=0-2) for alarm 16 belonging to alarm group i. - CF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF17</name>
							<description>Configuration flag x (x=0-2) for alarm 17 belonging to alarm group i. - CF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF18</name>
							<description>Configuration flag x (x=0-2) for alarm 18 belonging to alarm group i. - CF18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF20</name>
							<description>Configuration flag x (x=0-2) for alarm 20 belonging to alarm group i. - CF20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF21</name>
							<description>Configuration flag x (x=0-2) for alarm 21 belonging to alarm group i. - CF21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF22</name>
							<description>Configuration flag x (x=0-2) for alarm 22 belonging to alarm group i. - CF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG10CF2</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x30000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF3</name>
							<description>Configuration flag x (x=0-2) for alarm 3 belonging to alarm group i. - CF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF6</name>
							<description>Configuration flag x (x=0-2) for alarm 6 belonging to alarm group i. - CF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF7</name>
							<description>Configuration flag x (x=0-2) for alarm 7 belonging to alarm group i. - CF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF11</name>
							<description>Configuration flag x (x=0-2) for alarm 11 belonging to alarm group i. - CF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF14</name>
							<description>Configuration flag x (x=0-2) for alarm 14 belonging to alarm group i. - CF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF15</name>
							<description>Configuration flag x (x=0-2) for alarm 15 belonging to alarm group i. - CF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF16</name>
							<description>Configuration flag x (x=0-2) for alarm 16 belonging to alarm group i. - CF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF17</name>
							<description>Configuration flag x (x=0-2) for alarm 17 belonging to alarm group i. - CF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF18</name>
							<description>Configuration flag x (x=0-2) for alarm 18 belonging to alarm group i. - CF18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF20</name>
							<description>Configuration flag x (x=0-2) for alarm 20 belonging to alarm group i. - CF20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF21</name>
							<description>Configuration flag x (x=0-2) for alarm 21 belonging to alarm group i. - CF21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF22</name>
							<description>Configuration flag x (x=0-2) for alarm 22 belonging to alarm group i. - CF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG11CF0</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF3</name>
							<description>Configuration flag x (x=0-2) for alarm 3 belonging to alarm group i. - CF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG11CF1</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF3</name>
							<description>Configuration flag x (x=0-2) for alarm 3 belonging to alarm group i. - CF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG11CF2</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF3</name>
							<description>Configuration flag x (x=0-2) for alarm 3 belonging to alarm group i. - CF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
