J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>AG0FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FE0</name>
							<description>Fault signaling configuration flag for alarm 0 belonging to alarm group i. - FE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE1</name>
							<description>Fault signaling configuration flag for alarm 1 belonging to alarm group i. - FE1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE2</name>
							<description>Fault signaling configuration flag for alarm 2 belonging to alarm group i. - FE2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 4 belonging to alarm group i. - FE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 5 belonging to alarm group i. - FE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 6 belonging to alarm group i. - FE6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 7 belonging to alarm group i. - FE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 8 belonging to alarm group i. - FE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 9 belonging to alarm group i. - FE9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 10 belonging to alarm group i. - FE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 11 belonging to alarm group i. - FE11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 12 belonging to alarm group i. - FE12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 13 belonging to alarm group i. - FE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 14 belonging to alarm group i. - FE14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE22</name>
							<description>Fault signaling configuration flag for alarm 22 belonging to alarm group i. - FE22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE23</name>
							<description>Fault signaling configuration flag for alarm 23 belonging to alarm group i. - FE23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE24</name>
							<description>Fault signaling configuration flag for alarm 24 belonging to alarm group i. - FE24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG1FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x194</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FE0</name>
							<description>Fault signaling configuration flag for alarm 0 belonging to alarm group i. - FE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE1</name>
							<description>Fault signaling configuration flag for alarm 1 belonging to alarm group i. - FE1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE2</name>
							<description>Fault signaling configuration flag for alarm 2 belonging to alarm group i. - FE2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 4 belonging to alarm group i. - FE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 5 belonging to alarm group i. - FE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 6 belonging to alarm group i. - FE6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 7 belonging to alarm group i. - FE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 8 belonging to alarm group i. - FE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 9 belonging to alarm group i. - FE9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 10 belonging to alarm group i. - FE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 11 belonging to alarm group i. - FE11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 12 belonging to alarm group i. - FE12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 13 belonging to alarm group i. - FE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 14 belonging to alarm group i. - FE14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE22</name>
							<description>Fault signaling configuration flag for alarm 22 belonging to alarm group i. - FE22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE23</name>
							<description>Fault signaling configuration flag for alarm 23 belonging to alarm group i. - FE23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE24</name>
							<description>Fault signaling configuration flag for alarm 24 belonging to alarm group i. - FE24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG2FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x198</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FE1</name>
							<description>Fault signaling configuration flag for alarm 1 belonging to alarm group i. - FE1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 4 belonging to alarm group i. - FE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 5 belonging to alarm group i. - FE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 6 belonging to alarm group i. - FE6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 7 belonging to alarm group i. - FE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 8 belonging to alarm group i. - FE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE9</name>
							<description>Fault signaling configuration flag for alarm 9 belonging to alarm group i. - FE9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 10 belonging to alarm group i. - FE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 11 belonging to alarm group i. - FE11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 12 belonging to alarm group i. - FE12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 13 belonging to alarm group i. - FE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 14 belonging to alarm group i. - FE14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE22</name>
							<description>Fault signaling configuration flag for alarm 22 belonging to alarm group i. - FE22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE23</name>
							<description>Fault signaling configuration flag for alarm 23 belonging to alarm group i. - FE23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE24</name>
							<description>Fault signaling configuration flag for alarm 24 belonging to alarm group i. - FE24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG3FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x19C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>AG4FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x1A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>AG5FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x1A4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>AG6FSP</name>
					<description>SMU_core FSP Configuration Register</description>
					<addressOffset>0x1A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FE0</name>
							<description>Fault signaling configuration flag for alarm 0 belonging to alarm group i. - FE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE1</name>
							<description>Fault signaling configuration flag for alarm 1 belonging to alarm group i. - FE1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE2</name>
							<description>Fault signaling configuration flag for alarm 2 belonging to alarm group i. - FE2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE4</name>
							<description>Fault signaling configuration flag for alarm 4 belonging to alarm group i. - FE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE5</name>
							<description>Fault signaling configuration flag for alarm 5 belonging to alarm group i. - FE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE6</name>
							<description>Fault signaling configuration flag for alarm 6 belonging to alarm group i. - FE6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE7</name>
							<description>Fault signaling configuration flag for alarm 7 belonging to alarm group i. - FE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE8</name>
							<description>Fault signaling configuration flag for alarm 8 belonging to alarm group i. - FE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE10</name>
							<description>Fault signaling configuration flag for alarm 10 belonging to alarm group i. - FE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE11</name>
							<description>Fault signaling configuration flag for alarm 11 belonging to alarm group i. - FE11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE12</name>
							<description>Fault signaling configuration flag for alarm 12 belonging to alarm group i. - FE12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE13</name>
							<description>Fault signaling configuration flag for alarm 13 belonging to alarm group i. - FE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE14</name>
							<description>Fault signaling configuration flag for alarm 14 belonging to alarm group i. - FE14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE15</name>
							<description>Fault signaling configuration flag for alarm 15 belonging to alarm group i. - FE15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE16</name>
							<description>Fault signaling configuration flag for alarm 16 belonging to alarm group i. - FE16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE17</name>
							<description>Fault signaling configuration flag for alarm 17 belonging to alarm group i. - FE17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE18</name>
							<description>Fault signaling configuration flag for alarm 18 belonging to alarm group i. - FE18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE19</name>
							<description>Fault signaling configuration flag for alarm 19 belonging to alarm group i. - FE19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE20</name>
							<description>Fault signaling configuration flag for alarm 20 belonging to alarm group i. - FE20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE21</name>
							<description>Fault signaling configuration flag for alarm 21 belonging to alarm group i. - FE21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE23</name>
							<description>Fault signaling configuration flag for alarm 23 belonging to alarm group i. - FE23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE24</name>
							<description>Fault signaling configuration flag for alarm 24 belonging to alarm group i. - FE24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FE25</name>
							<description>Fault signaling configuration flag for alarm 25 belonging to alarm group i. - FE25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
