J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>AG7</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x1DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 0 belonging to alarm group i. - SF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 1 belonging to alarm group i. - SF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF2</name>
							<description>Status flag for alarm 2 belonging to alarm group i. - SF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 12 belonging to alarm group i. - SF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 13 belonging to alarm group i. - SF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF14</name>
							<description>Status flag for alarm 14 belonging to alarm group i. - SF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF15</name>
							<description>Status flag for alarm 15 belonging to alarm group i. - SF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF16</name>
							<description>Status flag for alarm 16 belonging to alarm group i. - SF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF17</name>
							<description>Status flag for alarm 17 belonging to alarm group i. - SF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF18</name>
							<description>Status flag for alarm 18 belonging to alarm group i. - SF18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF19</name>
							<description>Status flag for alarm 19 belonging to alarm group i. - SF19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF20</name>
							<description>Status flag for alarm 20 belonging to alarm group i. - SF20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF22</name>
							<description>Status flag for alarm 22 belonging to alarm group i. - SF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF23</name>
							<description>Status flag for alarm 23 belonging to alarm group i. - SF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF24</name>
							<description>Status flag for alarm 24 belonging to alarm group i. - SF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF25</name>
							<description>Status flag for alarm 25 belonging to alarm group i. - SF25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF26</name>
							<description>Status flag for alarm 26 belonging to alarm group i. - SF26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF27</name>
							<description>Status flag for alarm 27 belonging to alarm group i. - SF27</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF28</name>
							<description>Status flag for alarm 28 belonging to alarm group i. - SF28</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF29</name>
							<description>Status flag for alarm 29 belonging to alarm group i. - SF29</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF30</name>
							<description>Status flag for alarm 30 belonging to alarm group i. - SF30</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF31</name>
							<description>Status flag for alarm 31 belonging to alarm group i. - SF31</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG8</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 0 belonging to alarm group i. - SF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 1 belonging to alarm group i. - SF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF2</name>
							<description>Status flag for alarm 2 belonging to alarm group i. - SF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF3</name>
							<description>Status flag for alarm 3 belonging to alarm group i. - SF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 4 belonging to alarm group i. - SF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 5 belonging to alarm group i. - SF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF6</name>
							<description>Status flag for alarm 6 belonging to alarm group i. - SF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF7</name>
							<description>Status flag for alarm 7 belonging to alarm group i. - SF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 8 belonging to alarm group i. - SF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 9 belonging to alarm group i. - SF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 10 belonging to alarm group i. - SF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF11</name>
							<description>Status flag for alarm 11 belonging to alarm group i. - SF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 12 belonging to alarm group i. - SF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF16</name>
							<description>Status flag for alarm 16 belonging to alarm group i. - SF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF17</name>
							<description>Status flag for alarm 17 belonging to alarm group i. - SF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF18</name>
							<description>Status flag for alarm 18 belonging to alarm group i. - SF18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF19</name>
							<description>Status flag for alarm 19 belonging to alarm group i. - SF19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF20</name>
							<description>Status flag for alarm 20 belonging to alarm group i. - SF20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF21</name>
							<description>Status flag for alarm 21 belonging to alarm group i. - SF21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF22</name>
							<description>Status flag for alarm 22 belonging to alarm group i. - SF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF23</name>
							<description>Status flag for alarm 23 belonging to alarm group i. - SF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF25</name>
							<description>Status flag for alarm 25 belonging to alarm group i. - SF25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF26</name>
							<description>Status flag for alarm 26 belonging to alarm group i. - SF26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF27</name>
							<description>Status flag for alarm 27 belonging to alarm group i. - SF27</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF28</name>
							<description>Status flag for alarm 28 belonging to alarm group i. - SF28</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF29</name>
							<description>Status flag for alarm 29 belonging to alarm group i. - SF29</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF30</name>
							<description>Status flag for alarm 30 belonging to alarm group i. - SF30</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF31</name>
							<description>Status flag for alarm 31 belonging to alarm group i. - SF31</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG9</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x1E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 0 belonging to alarm group i. - SF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 1 belonging to alarm group i. - SF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF3</name>
							<description>Status flag for alarm 3 belonging to alarm group i. - SF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 5 belonging to alarm group i. - SF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF15</name>
							<description>Status flag for alarm 15 belonging to alarm group i. - SF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF16</name>
							<description>Status flag for alarm 16 belonging to alarm group i. - SF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF17</name>
							<description>Status flag for alarm 17 belonging to alarm group i. - SF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG10</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x1E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 0 belonging to alarm group i. - SF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 1 belonging to alarm group i. - SF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF2</name>
							<description>Status flag for alarm 2 belonging to alarm group i. - SF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF3</name>
							<description>Status flag for alarm 3 belonging to alarm group i. - SF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 4 belonging to alarm group i. - SF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 5 belonging to alarm group i. - SF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF6</name>
							<description>Status flag for alarm 6 belonging to alarm group i. - SF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF7</name>
							<description>Status flag for alarm 7 belonging to alarm group i. - SF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 8 belonging to alarm group i. - SF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 9 belonging to alarm group i. - SF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 10 belonging to alarm group i. - SF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF11</name>
							<description>Status flag for alarm 11 belonging to alarm group i. - SF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 12 belonging to alarm group i. - SF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 13 belonging to alarm group i. - SF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF14</name>
							<description>Status flag for alarm 14 belonging to alarm group i. - SF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF15</name>
							<description>Status flag for alarm 15 belonging to alarm group i. - SF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF16</name>
							<description>Status flag for alarm 16 belonging to alarm group i. - SF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF17</name>
							<description>Status flag for alarm 17 belonging to alarm group i. - SF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF18</name>
							<description>Status flag for alarm 18 belonging to alarm group i. - SF18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF20</name>
							<description>Status flag for alarm 20 belonging to alarm group i. - SF20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF21</name>
							<description>Status flag for alarm 21 belonging to alarm group i. - SF21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF22</name>
							<description>Status flag for alarm 22 belonging to alarm group i. - SF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG11</name>
					<description>Alarm Status Register</description>
					<addressOffset>0x1EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SF0</name>
							<description>Status flag for alarm 0 belonging to alarm group i. - SF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF1</name>
							<description>Status flag for alarm 1 belonging to alarm group i. - SF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF2</name>
							<description>Status flag for alarm 2 belonging to alarm group i. - SF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF3</name>
							<description>Status flag for alarm 3 belonging to alarm group i. - SF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF4</name>
							<description>Status flag for alarm 4 belonging to alarm group i. - SF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF5</name>
							<description>Status flag for alarm 5 belonging to alarm group i. - SF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF8</name>
							<description>Status flag for alarm 8 belonging to alarm group i. - SF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF9</name>
							<description>Status flag for alarm 9 belonging to alarm group i. - SF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF10</name>
							<description>Status flag for alarm 10 belonging to alarm group i. - SF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF12</name>
							<description>Status flag for alarm 12 belonging to alarm group i. - SF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SF13</name>
							<description>Status flag for alarm 13 belonging to alarm group i. - SF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
