J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>AD0</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DF0</name>
							<description>Diagnosis flag for alarm 0 belonging to alarm group i. - DF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF1</name>
							<description>Diagnosis flag for alarm 1 belonging to alarm group i. - DF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF2</name>
							<description>Diagnosis flag for alarm 2 belonging to alarm group i. - DF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF4</name>
							<description>Diagnosis flag for alarm 4 belonging to alarm group i. - DF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF5</name>
							<description>Diagnosis flag for alarm 5 belonging to alarm group i. - DF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF6</name>
							<description>Diagnosis flag for alarm 6 belonging to alarm group i. - DF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF7</name>
							<description>Diagnosis flag for alarm 7 belonging to alarm group i. - DF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF8</name>
							<description>Diagnosis flag for alarm 8 belonging to alarm group i. - DF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF9</name>
							<description>Diagnosis flag for alarm 9 belonging to alarm group i. - DF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF10</name>
							<description>Diagnosis flag for alarm 10 belonging to alarm group i. - DF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF11</name>
							<description>Diagnosis flag for alarm 11 belonging to alarm group i. - DF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF12</name>
							<description>Diagnosis flag for alarm 12 belonging to alarm group i. - DF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF13</name>
							<description>Diagnosis flag for alarm 13 belonging to alarm group i. - DF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF14</name>
							<description>Diagnosis flag for alarm 14 belonging to alarm group i. - DF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF22</name>
							<description>Diagnosis flag for alarm 22 belonging to alarm group i. - DF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF23</name>
							<description>Diagnosis flag for alarm 23 belonging to alarm group i. - DF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF24</name>
							<description>Diagnosis flag for alarm 24 belonging to alarm group i. - DF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AD1</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x204</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DF0</name>
							<description>Diagnosis flag for alarm 0 belonging to alarm group i. - DF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF1</name>
							<description>Diagnosis flag for alarm 1 belonging to alarm group i. - DF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF2</name>
							<description>Diagnosis flag for alarm 2 belonging to alarm group i. - DF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF4</name>
							<description>Diagnosis flag for alarm 4 belonging to alarm group i. - DF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF5</name>
							<description>Diagnosis flag for alarm 5 belonging to alarm group i. - DF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF6</name>
							<description>Diagnosis flag for alarm 6 belonging to alarm group i. - DF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF7</name>
							<description>Diagnosis flag for alarm 7 belonging to alarm group i. - DF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF8</name>
							<description>Diagnosis flag for alarm 8 belonging to alarm group i. - DF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF9</name>
							<description>Diagnosis flag for alarm 9 belonging to alarm group i. - DF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF10</name>
							<description>Diagnosis flag for alarm 10 belonging to alarm group i. - DF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF11</name>
							<description>Diagnosis flag for alarm 11 belonging to alarm group i. - DF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF12</name>
							<description>Diagnosis flag for alarm 12 belonging to alarm group i. - DF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF13</name>
							<description>Diagnosis flag for alarm 13 belonging to alarm group i. - DF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF14</name>
							<description>Diagnosis flag for alarm 14 belonging to alarm group i. - DF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF22</name>
							<description>Diagnosis flag for alarm 22 belonging to alarm group i. - DF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF23</name>
							<description>Diagnosis flag for alarm 23 belonging to alarm group i. - DF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF24</name>
							<description>Diagnosis flag for alarm 24 belonging to alarm group i. - DF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AD2</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x208</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DF1</name>
							<description>Diagnosis flag for alarm 1 belonging to alarm group i. - DF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF4</name>
							<description>Diagnosis flag for alarm 4 belonging to alarm group i. - DF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF5</name>
							<description>Diagnosis flag for alarm 5 belonging to alarm group i. - DF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF6</name>
							<description>Diagnosis flag for alarm 6 belonging to alarm group i. - DF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF7</name>
							<description>Diagnosis flag for alarm 7 belonging to alarm group i. - DF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF8</name>
							<description>Diagnosis flag for alarm 8 belonging to alarm group i. - DF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF9</name>
							<description>Diagnosis flag for alarm 9 belonging to alarm group i. - DF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF10</name>
							<description>Diagnosis flag for alarm 10 belonging to alarm group i. - DF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF11</name>
							<description>Diagnosis flag for alarm 11 belonging to alarm group i. - DF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF12</name>
							<description>Diagnosis flag for alarm 12 belonging to alarm group i. - DF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF13</name>
							<description>Diagnosis flag for alarm 13 belonging to alarm group i. - DF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF14</name>
							<description>Diagnosis flag for alarm 14 belonging to alarm group i. - DF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF22</name>
							<description>Diagnosis flag for alarm 22 belonging to alarm group i. - DF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF23</name>
							<description>Diagnosis flag for alarm 23 belonging to alarm group i. - DF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF24</name>
							<description>Diagnosis flag for alarm 24 belonging to alarm group i. - DF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AD3</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x20C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>AD4</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x210</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>AD5</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x214</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>AD6</name>
					<description>Alarm Debug Register</description>
					<addressOffset>0x218</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DF0</name>
							<description>Diagnosis flag for alarm 0 belonging to alarm group i. - DF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF1</name>
							<description>Diagnosis flag for alarm 1 belonging to alarm group i. - DF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF2</name>
							<description>Diagnosis flag for alarm 2 belonging to alarm group i. - DF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF4</name>
							<description>Diagnosis flag for alarm 4 belonging to alarm group i. - DF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF5</name>
							<description>Diagnosis flag for alarm 5 belonging to alarm group i. - DF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF6</name>
							<description>Diagnosis flag for alarm 6 belonging to alarm group i. - DF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF7</name>
							<description>Diagnosis flag for alarm 7 belonging to alarm group i. - DF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF8</name>
							<description>Diagnosis flag for alarm 8 belonging to alarm group i. - DF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF10</name>
							<description>Diagnosis flag for alarm 10 belonging to alarm group i. - DF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF11</name>
							<description>Diagnosis flag for alarm 11 belonging to alarm group i. - DF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF12</name>
							<description>Diagnosis flag for alarm 12 belonging to alarm group i. - DF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF13</name>
							<description>Diagnosis flag for alarm 13 belonging to alarm group i. - DF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF14</name>
							<description>Diagnosis flag for alarm 14 belonging to alarm group i. - DF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF15</name>
							<description>Diagnosis flag for alarm 15 belonging to alarm group i. - DF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF16</name>
							<description>Diagnosis flag for alarm 16 belonging to alarm group i. - DF16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF17</name>
							<description>Diagnosis flag for alarm 17 belonging to alarm group i. - DF17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF18</name>
							<description>Diagnosis flag for alarm 18 belonging to alarm group i. - DF18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF19</name>
							<description>Diagnosis flag for alarm 19 belonging to alarm group i. - DF19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF20</name>
							<description>Diagnosis flag for alarm 20 belonging to alarm group i. - DF20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF21</name>
							<description>Diagnosis flag for alarm 21 belonging to alarm group i. - DF21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF23</name>
							<description>Diagnosis flag for alarm 23 belonging to alarm group i. - DF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF24</name>
							<description>Diagnosis flag for alarm 24 belonging to alarm group i. - DF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DF25</name>
							<description>Diagnosis flag for alarm 25 belonging to alarm group i. - DF25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
