J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>RMCTL</name>
					<description>Register Monitor Control</description>
					<addressOffset>0x300</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TE0</name>
							<description>Test Enable. - TE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE1</name>
							<description>Test Enable. - TE1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE2</name>
							<description>Test Enable. - TE2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE3</name>
							<description>Test Enable. - TE3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE4</name>
							<description>Test Enable. - TE4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE5</name>
							<description>Test Enable. - TE5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE6</name>
							<description>Test Enable. - TE6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE7</name>
							<description>Test Enable. - TE7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE8</name>
							<description>Test Enable. - TE8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE9</name>
							<description>Test Enable. - TE9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE10</name>
							<description>Test Enable. - TE10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RMEF</name>
					<description>Register Monitor Error Flags</description>
					<addressOffset>0x304</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EF0</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF1</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF2</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF3</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF4</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF5</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF6</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF7</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF8</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF9</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EF10</name>
							<description>Status flag related to the different instances of the register monitor safety mechanism. - EF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RMSTS</name>
					<description>Register Monitor Self Test Status</description>
					<addressOffset>0x308</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STS0</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS1</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS2</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS3</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS4</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS5</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS6</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS7</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS8</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS9</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STS10</name>
							<description>Ready flag related to the different instances of the register monitor safety mechanism. - STS10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OCS</name>
					<description>OCDS Control and Status</description>
					<addressOffset>0x7E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TGS</name>
							<description>Trigger Set for OTGB0/1 - TGS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TGB</name>
							<description>OTGB0/1 Bus Select - TGB</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG_P</name>
							<description>TGS, TGB Write Protection - TG_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>OCDS Suspend Control - SUS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUS_P</name>
							<description>SUS Write Protection - SUS_P</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SUSSTA</name>
							<description>Suspend State - SUSSTA</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ACCEN1</name>
					<description>SMU_core Access Enable Register 1</description>
					<addressOffset>0x7F8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>ACCEN0</name>
					<description>SMU_core Access Enable Register 0</description>
					<addressOffset>0x7FC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>Access Enable for Master TAG ID 0 - EN0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>Access Enable for Master TAG ID 1 - EN1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>Access Enable for Master TAG ID 2 - EN2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>Access Enable for Master TAG ID 3 - EN3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>Access Enable for Master TAG ID 4 - EN4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>Access Enable for Master TAG ID 5 - EN5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>Access Enable for Master TAG ID 6 - EN6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>Access Enable for Master TAG ID 7 - EN7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN8</name>
							<description>Access Enable for Master TAG ID 8 - EN8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN9</name>
							<description>Access Enable for Master TAG ID 9 - EN9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN10</name>
							<description>Access Enable for Master TAG ID 10 - EN10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN11</name>
							<description>Access Enable for Master TAG ID 11 - EN11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN12</name>
							<description>Access Enable for Master TAG ID 12 - EN12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN13</name>
							<description>Access Enable for Master TAG ID 13 - EN13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN14</name>
							<description>Access Enable for Master TAG ID 14 - EN14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN15</name>
							<description>Access Enable for Master TAG ID 15 - EN15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN16</name>
							<description>Access Enable for Master TAG ID 16 - EN16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN17</name>
							<description>Access Enable for Master TAG ID 17 - EN17</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN18</name>
							<description>Access Enable for Master TAG ID 18 - EN18</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN19</name>
							<description>Access Enable for Master TAG ID 19 - EN19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN20</name>
							<description>Access Enable for Master TAG ID 20 - EN20</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN21</name>
							<description>Access Enable for Master TAG ID 21 - EN21</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN22</name>
							<description>Access Enable for Master TAG ID 22 - EN22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN23</name>
							<description>Access Enable for Master TAG ID 23 - EN23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN24</name>
							<description>Access Enable for Master TAG ID 24 - EN24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN25</name>
							<description>Access Enable for Master TAG ID 25 - EN25</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN26</name>
							<description>Access Enable for Master TAG ID 26 - EN26</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN27</name>
							<description>Access Enable for Master TAG ID 27 - EN27</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN28</name>
							<description>Access Enable for Master TAG ID 28 - EN28</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN29</name>
							<description>Access Enable for Master TAG ID 29 - EN29</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN30</name>
							<description>Access Enable for Master TAG ID 30 - EN30</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN31</name>
							<description>Access Enable for Master TAG ID 31 - EN31</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
