J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>ECMETH0</name>
					<description>IOM Event Combiner Module Event Trigger History Register 0</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ETA0</name>
							<description>LAM 0-15 Eve0t Trigger Activity (last) - ETA0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA1</name>
							<description>LAM 0-15 Eve1t Trigger Activity (last) - ETA1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA2</name>
							<description>LAM 0-15 Eve2t Trigger Activity (last) - ETA2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA3</name>
							<description>LAM 0-15 Eve3t Trigger Activity (last) - ETA3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA4</name>
							<description>LAM 0-15 Eve4t Trigger Activity (last) - ETA4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA5</name>
							<description>LAM 0-15 Eve5t Trigger Activity (last) - ETA5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA6</name>
							<description>LAM 0-15 Eve6t Trigger Activity (last) - ETA6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA7</name>
							<description>LAM 0-15 Eve7t Trigger Activity (last) - ETA7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA8</name>
							<description>LAM 0-15 Eve8t Trigger Activity (last) - ETA8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA9</name>
							<description>LAM 0-15 Eve9t Trigger Activity (last) - ETA9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA10</name>
							<description>LAM 0-15 Eve10t Trigger Activity (last) - ETA10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA11</name>
							<description>LAM 0-15 Eve11t Trigger Activity (last) - ETA11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA12</name>
							<description>LAM 0-15 Eve12t Trigger Activity (last) - ETA12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA13</name>
							<description>LAM 0-15 Eve13t Trigger Activity (last) - ETA13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA14</name>
							<description>LAM 0-15 Eve14t Trigger Activity (last) - ETA14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETA15</name>
							<description>LAM 0-15 Eve15t Trigger Activity (last) - ETA15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB0</name>
							<description>LAM 0-15 Eve0t Trigger Activity (previous ETA0-15) - ETB0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB1</name>
							<description>LAM 0-15 Eve1t Trigger Activity (previous ETA0-15) - ETB1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB2</name>
							<description>LAM 0-15 Eve2t Trigger Activity (previous ETA0-15) - ETB2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB3</name>
							<description>LAM 0-15 Eve3t Trigger Activity (previous ETA0-15) - ETB3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB4</name>
							<description>LAM 0-15 Eve4t Trigger Activity (previous ETA0-15) - ETB4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB5</name>
							<description>LAM 0-15 Eve5t Trigger Activity (previous ETA0-15) - ETB5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB6</name>
							<description>LAM 0-15 Eve6t Trigger Activity (previous ETA0-15) - ETB6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB7</name>
							<description>LAM 0-15 Eve7t Trigger Activity (previous ETA0-15) - ETB7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB8</name>
							<description>LAM 0-15 Eve8t Trigger Activity (previous ETA0-15) - ETB8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB9</name>
							<description>LAM 0-15 Eve9t Trigger Activity (previous ETA0-15) - ETB9</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB10</name>
							<description>LAM 0-15 Eve10t Trigger Activity (previous ETA0-15) - ETB10</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB11</name>
							<description>LAM 0-15 Eve11t Trigger Activity (previous ETA0-15) - ETB11</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB12</name>
							<description>LAM 0-15 Eve12t Trigger Activity (previous ETA0-15) - ETB12</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB13</name>
							<description>LAM 0-15 Eve13t Trigger Activity (previous ETA0-15) - ETB13</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB14</name>
							<description>LAM 0-15 Eve14t Trigger Activity (previous ETA0-15) - ETB14</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETB15</name>
							<description>LAM 0-15 Eve15t Trigger Activity (previous ETA0-15) - ETB15</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECMETH1</name>
					<description>IOM Event Combiner Module Event Trigger History Register 1</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ETC0</name>
							<description>LAM 0-15 Eve0t Trigger Activity (previous ETB0-15) - ETC0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC1</name>
							<description>LAM 0-15 Eve1t Trigger Activity (previous ETB0-15) - ETC1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC2</name>
							<description>LAM 0-15 Eve2t Trigger Activity (previous ETB0-15) - ETC2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC3</name>
							<description>LAM 0-15 Eve3t Trigger Activity (previous ETB0-15) - ETC3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC4</name>
							<description>LAM 0-15 Eve4t Trigger Activity (previous ETB0-15) - ETC4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC5</name>
							<description>LAM 0-15 Eve5t Trigger Activity (previous ETB0-15) - ETC5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC6</name>
							<description>LAM 0-15 Eve6t Trigger Activity (previous ETB0-15) - ETC6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC7</name>
							<description>LAM 0-15 Eve7t Trigger Activity (previous ETB0-15) - ETC7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC8</name>
							<description>LAM 0-15 Eve8t Trigger Activity (previous ETB0-15) - ETC8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC9</name>
							<description>LAM 0-15 Eve9t Trigger Activity (previous ETB0-15) - ETC9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC10</name>
							<description>LAM 0-15 Eve10t Trigger Activity (previous ETB0-15) - ETC10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC11</name>
							<description>LAM 0-15 Eve11t Trigger Activity (previous ETB0-15) - ETC11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC12</name>
							<description>LAM 0-15 Eve12t Trigger Activity (previous ETB0-15) - ETC12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC13</name>
							<description>LAM 0-15 Eve13t Trigger Activity (previous ETB0-15) - ETC13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC14</name>
							<description>LAM 0-15 Eve14t Trigger Activity (previous ETB0-15) - ETC14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETC15</name>
							<description>LAM 0-15 Eve15t Trigger Activity (previous ETB0-15) - ETC15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD0</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD1</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD2</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD3</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD4</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD5</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD6</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD7</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD8</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD9</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD10</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD11</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD12</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD13</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD14</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ETD15</name>
							<description>LAM 0-15 Event Trigger Activity (previous contents of ETC0-15 ORed with the previous value of ETD0-15)</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GTMEXR</name>
					<description>IOM GTM Input EXOR Combiner Selection Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EN0</name>
							<description>GTM input 0 selection for EXOR combiner - EN0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN1</name>
							<description>GTM input 1 selection for EXOR combiner - EN1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN2</name>
							<description>GTM input 2 selection for EXOR combiner - EN2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN3</name>
							<description>GTM input 3 selection for EXOR combiner - EN3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN4</name>
							<description>GTM input 4 selection for EXOR combiner - EN4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN5</name>
							<description>GTM input 5 selection for EXOR combiner - EN5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN6</name>
							<description>GTM input 6 selection for EXOR combiner - EN6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN7</name>
							<description>GTM input 7 selection for EXOR combiner - EN7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
