J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>FPCCTR10</name>
					<description>IOM Filter and Prescaler Channel Control Register 10</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR11</name>
					<description>IOM Filter and Prescaler Channel Control Register 11</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR12</name>
					<description>IOM Filter and Prescaler Channel Control Register 12</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR13</name>
					<description>IOM Filter and Prescaler Channel Control Register 13</description>
					<addressOffset>0xB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR14</name>
					<description>IOM Filter and Prescaler Channel Control Register 14</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR15</name>
					<description>IOM Filter and Prescaler Channel Control Register 15</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM0</name>
					<description>IOM Filter and Prescaler Channel Timer Register 0 </description>
					<addressOffset>0xC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM1</name>
					<description>IOM Filter and Prescaler Channel Timer Register 1 </description>
					<addressOffset>0xC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM2</name>
					<description>IOM Filter and Prescaler Channel Timer Register 2 </description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM3</name>
					<description>IOM Filter and Prescaler Channel Timer Register 3 </description>
					<addressOffset>0xCC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM4</name>
					<description>IOM Filter and Prescaler Channel Timer Register 4 </description>
					<addressOffset>0xD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM5</name>
					<description>IOM Filter and Prescaler Channel Timer Register 5 </description>
					<addressOffset>0xD4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM6</name>
					<description>IOM Filter and Prescaler Channel Timer Register 6 </description>
					<addressOffset>0xD8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM7</name>
					<description>IOM Filter and Prescaler Channel Timer Register 7 </description>
					<addressOffset>0xDC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM8</name>
					<description>IOM Filter and Prescaler Channel Timer Register 8 </description>
					<addressOffset>0xE0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM9</name>
					<description>IOM Filter and Prescaler Channel Timer Register 9 </description>
					<addressOffset>0xE4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM10</name>
					<description>IOM Filter and Prescaler Channel Timer Register 10 </description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM11</name>
					<description>IOM Filter and Prescaler Channel Timer Register 11 </description>
					<addressOffset>0xEC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM12</name>
					<description>IOM Filter and Prescaler Channel Timer Register 12 </description>
					<addressOffset>0xF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM13</name>
					<description>IOM Filter and Prescaler Channel Timer Register 13 </description>
					<addressOffset>0xF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM14</name>
					<description>IOM Filter and Prescaler Channel Timer Register 14 </description>
					<addressOffset>0xF8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCTIM15</name>
					<description>IOM Filter and Prescaler Channel Timer Register 15 </description>
					<addressOffset>0xFC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIM</name>
							<description>Timer Value of Filter and Prescaler Channel k - TIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC0</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 0</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC1</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 1</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC2</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 2</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC3</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 3</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC4</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 4</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC5</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 5</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
