J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>LAMCFG15</name>
					<description>IOM Logic Analyzer Module Configuration Register 15</description>
					<addressOffset>0x1BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS0</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 0</description>
					<addressOffset>0x1C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS1</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 1</description>
					<addressOffset>0x1C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS2</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 2</description>
					<addressOffset>0x1C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS3</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 3</description>
					<addressOffset>0x1CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS4</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 4</description>
					<addressOffset>0x1D0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS5</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 5</description>
					<addressOffset>0x1D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS6</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 6</description>
					<addressOffset>0x1D8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS7</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 7</description>
					<addressOffset>0x1DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS8</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 8</description>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS9</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 9</description>
					<addressOffset>0x1E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS10</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 10</description>
					<addressOffset>0x1E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS11</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 11</description>
					<addressOffset>0x1EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS12</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 12</description>
					<addressOffset>0x1F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS13</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 13</description>
					<addressOffset>0x1F4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS14</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 14</description>
					<addressOffset>0x1F8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWS15</name>
					<description>IOM Logic Analyzer Module Event Window Configuration Register 15</description>
					<addressOffset>0x1FC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>THR</name>
							<description>Event Window Count Threshold - THR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
