J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>G0RCR6</name>
					<description>Group 0 Result Control Register 6</description>
					<addressOffset>0x698</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR7</name>
					<description>Group 0 Result Control Register 7</description>
					<addressOffset>0x69C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR8</name>
					<description>Group 0 Result Control Register 8</description>
					<addressOffset>0x6A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR9</name>
					<description>Group 0 Result Control Register 9</description>
					<addressOffset>0x6A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR10</name>
					<description>Group 0 Result Control Register 10</description>
					<addressOffset>0x6A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR11</name>
					<description>Group 0 Result Control Register 11</description>
					<addressOffset>0x6AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR12</name>
					<description>Group 0 Result Control Register 12</description>
					<addressOffset>0x6B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR13</name>
					<description>Group 0 Result Control Register 13</description>
					<addressOffset>0x6B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR14</name>
					<description>Group 0 Result Control Register 14</description>
					<addressOffset>0x6B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RCR15</name>
					<description>Group 0 Result Control Register 15</description>
					<addressOffset>0x6BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RES0</name>
					<description>Group 0 Result Register 0</description>
					<addressOffset>0x700</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RES1</name>
					<description>Group 0 Result Register 1</description>
					<addressOffset>0x704</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RES2</name>
					<description>Group 0 Result Register 2</description>
					<addressOffset>0x708</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RES3</name>
					<description>Group 0 Result Register 3</description>
					<addressOffset>0x70C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RES4</name>
					<description>Group 0 Result Register 4</description>
					<addressOffset>0x710</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0RES5</name>
					<description>Group 0 Result Register 5</description>
					<addressOffset>0x714</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
