J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>G2SRACT</name>
					<description>Service Request Software Activation Trigger, Group 2</description>
					<addressOffset>0xDC8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AGSR0</name>
							<description>Activate Group Service Request Node 0 - AGSR0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AGSR1</name>
							<description>Activate Group Service Request Node 1 - AGSR1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AGSR2</name>
							<description>Activate Group Service Request Node 2 - AGSR2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AGSR3</name>
							<description>Activate Group Service Request Node 3 - AGSR3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR0</name>
							<description>Activate Shared Service Request Node 0 - ASSR0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR1</name>
							<description>Activate Shared Service Request Node 1 - ASSR1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR2</name>
							<description>Activate Shared Service Request Node 2 - ASSR2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR3</name>
							<description>Activate Shared Service Request Node 3 - ASSR3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2EMUXCTR</name>
					<description>External Multiplexer Control Reg., Group 2</description>
					<addressOffset>0xDF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMUXSET</name>
							<description>External Multiplexer Start Selection - EMUXSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMUXMODE</name>
							<description>External Multiplexer Mode - EMUXMODE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXCOD</name>
							<description>External Multiplexer Coding Scheme - EMXCOD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXST</name>
							<description>External Multiplexer Sample Time Control - EMXST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXCSS</name>
							<description>External Multiplexer Channel Selection Style - EMXCSS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXWC</name>
							<description>Write Control for EMUX Configuration - EMXWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EMUXACT</name>
							<description>External Multiplexer Actual Selection - EMUXACT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUXCCB</name>
							<description>External Multiplexer Channel Selection for Block Mode - EMUXCCB</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2EMUXCS</name>
					<description>Ext. Multiplexer Channel Select Reg., Group 2</description>
					<addressOffset>0xDF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMUXCH</name>
							<description>External Multiplexer Channel Select - EMUXCH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2VFR</name>
					<description>Valid Flag Register, Group 2</description>
					<addressOffset>0xDF8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VF0</name>
							<description>Valid Flag of Result Register x - VF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF1</name>
							<description>Valid Flag of Result Register x - VF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF2</name>
							<description>Valid Flag of Result Register x - VF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF3</name>
							<description>Valid Flag of Result Register x - VF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF4</name>
							<description>Valid Flag of Result Register x - VF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF5</name>
							<description>Valid Flag of Result Register x - VF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF6</name>
							<description>Valid Flag of Result Register x - VF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF7</name>
							<description>Valid Flag of Result Register x - VF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF8</name>
							<description>Valid Flag of Result Register x - VF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF9</name>
							<description>Valid Flag of Result Register x - VF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF10</name>
							<description>Valid Flag of Result Register x - VF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF11</name>
							<description>Valid Flag of Result Register x - VF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF12</name>
							<description>Valid Flag of Result Register x - VF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF13</name>
							<description>Valid Flag of Result Register x - VF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF14</name>
							<description>Valid Flag of Result Register x - VF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF15</name>
							<description>Valid Flag of Result Register x - VF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2CHCTR0</name>
					<description>Group 2, Channel 0 Control Register</description>
					<addressOffset>0xE00</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2CHCTR1</name>
					<description>Group 2, Channel 1 Control Register</description>
					<addressOffset>0xE04</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2CHCTR2</name>
					<description>Group 2, Channel 2 Control Register</description>
					<addressOffset>0xE08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2CHCTR3</name>
					<description>Group 2, Channel 3 Control Register</description>
					<addressOffset>0xE0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2CHCTR4</name>
					<description>Group 2, Channel 4 Control Register</description>
					<addressOffset>0xE10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
