J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>G2RCR10</name>
					<description>Group 2 Result Control Register 10</description>
					<addressOffset>0xEA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RCR11</name>
					<description>Group 2 Result Control Register 11</description>
					<addressOffset>0xEAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RCR12</name>
					<description>Group 2 Result Control Register 12</description>
					<addressOffset>0xEB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RCR13</name>
					<description>Group 2 Result Control Register 13</description>
					<addressOffset>0xEB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RCR14</name>
					<description>Group 2 Result Control Register 14</description>
					<addressOffset>0xEB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RCR15</name>
					<description>Group 2 Result Control Register 15</description>
					<addressOffset>0xEBC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES0</name>
					<description>Group 2 Result Register 0</description>
					<addressOffset>0xF00</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES1</name>
					<description>Group 2 Result Register 1</description>
					<addressOffset>0xF04</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES2</name>
					<description>Group 2 Result Register 2</description>
					<addressOffset>0xF08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES3</name>
					<description>Group 2 Result Register 3</description>
					<addressOffset>0xF0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES4</name>
					<description>Group 2 Result Register 4</description>
					<addressOffset>0xF10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES5</name>
					<description>Group 2 Result Register 5</description>
					<addressOffset>0xF14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES6</name>
					<description>Group 2 Result Register 6</description>
					<addressOffset>0xF18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES7</name>
					<description>Group 2 Result Register 7</description>
					<addressOffset>0xF1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G2RES8</name>
					<description>Group 2 Result Register 8</description>
					<addressOffset>0xF20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
