J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>G9REFCLR</name>
					<description>Result Event Flag Clear Register, Group 9</description>
					<addressOffset>0x2994</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REV0</name>
							<description>Clear Result Event for Result Register 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV1</name>
							<description>Clear Result Event for Result Register 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV2</name>
							<description>Clear Result Event for Result Register 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV3</name>
							<description>Clear Result Event for Result Register 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV4</name>
							<description>Clear Result Event for Result Register 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV5</name>
							<description>Clear Result Event for Result Register 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV6</name>
							<description>Clear Result Event for Result Register 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV7</name>
							<description>Clear Result Event for Result Register 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV8</name>
							<description>Clear Result Event for Result Register 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV9</name>
							<description>Clear Result Event for Result Register 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV10</name>
							<description>Clear Result Event for Result Register 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV11</name>
							<description>Clear Result Event for Result Register 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV12</name>
							<description>Clear Result Event for Result Register 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV13</name>
							<description>Clear Result Event for Result Register 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV14</name>
							<description>Clear Result Event for Result Register 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REV15</name>
							<description>Clear Result Event for Result Register 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9SEFCLR</name>
					<description>Source Event Flag Clear Reg., Group 9</description>
					<addressOffset>0x2998</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEV0</name>
							<description>Clear Source Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEV1</name>
							<description>Clear Source Event i</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEV2</name>
							<description>Clear Source Event i</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CEVNP0</name>
					<description>Channel Event Node Pointer Reg. 0, Group 9</description>
					<addressOffset>0x29A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CEV0NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV1NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV2NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV3NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV4NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV5NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV6NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV7NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CEVNP1</name>
					<description>Channel Event Node Pointer Reg. 1, Group 9</description>
					<addressOffset>0x29A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CEV8NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV9NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV10NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV11NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV12NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV13NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV14NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV15NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9REVNP0</name>
					<description>Result Event Node Pointer Reg. 0, Group 9</description>
					<addressOffset>0x29B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REV0NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV1NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV2NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV3NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV4NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV5NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV6NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV7NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9REVNP1</name>
					<description>Result Event Node Pointer Reg. 1, Group 9</description>
					<addressOffset>0x29B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REV8NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV9NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV10NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV11NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV12NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV13NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV14NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV15NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9SEVNP</name>
					<description>Source Event Node Pointer Reg., Group 9</description>
					<addressOffset>0x29C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEV0NP</name>
							<description>Service Request Node Pointer Source Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEV1NP</name>
							<description>Service Request Node Pointer Source Event i</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEV2NP</name>
							<description>Service Request Node Pointer Source Event i</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9SRACT</name>
					<description>Service Request Software Activation Trigger, Group 9</description>
					<addressOffset>0x29C8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AGSR0</name>
							<description>Activate Group Service Request Node 0 - AGSR0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AGSR1</name>
							<description>Activate Group Service Request Node 1 - AGSR1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AGSR2</name>
							<description>Activate Group Service Request Node 2 - AGSR2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AGSR3</name>
							<description>Activate Group Service Request Node 3 - AGSR3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR0</name>
							<description>Activate Shared Service Request Node 0 - ASSR0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR1</name>
							<description>Activate Shared Service Request Node 1 - ASSR1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR2</name>
							<description>Activate Shared Service Request Node 2 - ASSR2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ASSR3</name>
							<description>Activate Shared Service Request Node 3 - ASSR3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9EMUXCTR</name>
					<description>External Multiplexer Control Reg., Group 9</description>
					<addressOffset>0x29F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMUXSET</name>
							<description>External Multiplexer Start Selection - EMUXSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMUXMODE</name>
							<description>External Multiplexer Mode - EMUXMODE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXCOD</name>
							<description>External Multiplexer Coding Scheme - EMXCOD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXST</name>
							<description>External Multiplexer Sample Time Control - EMXST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXCSS</name>
							<description>External Multiplexer Channel Selection Style - EMXCSS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMXWC</name>
							<description>Write Control for EMUX Configuration - EMXWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EMUXACT</name>
							<description>External Multiplexer Actual Selection - EMUXACT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUXCCB</name>
							<description>External Multiplexer Channel Selection for Block Mode - EMUXCCB</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9EMUXCS</name>
					<description>Ext. Multiplexer Channel Select Reg., Group 9</description>
					<addressOffset>0x29F4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMUXCH</name>
							<description>External Multiplexer Channel Select - EMUXCH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9VFR</name>
					<description>Valid Flag Register, Group 9</description>
					<addressOffset>0x29F8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VF0</name>
							<description>Valid Flag of Result Register x - VF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF1</name>
							<description>Valid Flag of Result Register x - VF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF2</name>
							<description>Valid Flag of Result Register x - VF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF3</name>
							<description>Valid Flag of Result Register x - VF3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF4</name>
							<description>Valid Flag of Result Register x - VF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF5</name>
							<description>Valid Flag of Result Register x - VF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF6</name>
							<description>Valid Flag of Result Register x - VF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF7</name>
							<description>Valid Flag of Result Register x - VF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF8</name>
							<description>Valid Flag of Result Register x - VF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF9</name>
							<description>Valid Flag of Result Register x - VF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF10</name>
							<description>Valid Flag of Result Register x - VF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF11</name>
							<description>Valid Flag of Result Register x - VF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF12</name>
							<description>Valid Flag of Result Register x - VF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF13</name>
							<description>Valid Flag of Result Register x - VF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF14</name>
							<description>Valid Flag of Result Register x - VF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VF15</name>
							<description>Valid Flag of Result Register x - VF15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
