J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>G10QBUR1</name>
					<description>Queue 1 Backup Register, Group 10</description>
					<addressOffset>0x2D34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Down Devices Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Up Devices Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10REQTM1</name>
					<description>Queue 1 Requ. Timer Mode Reg., Group 10</description>
					<addressOffset>0x2D38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffc00000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQMOD</name>
							<description>Sequence Mode - SEQMOD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMSET</name>
							<description>Sequence Timer, Set Value - SEQTIMSET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REQTS</name>
							<description>Request Timer Start Trigger - REQTS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMOFF</name>
							<description>Sequence Timer, Switch Off Value - SEQTIMOFF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10REQTS1</name>
					<description>Queue 1 Requ. Timer Status Reg., Group 10</description>
					<addressOffset>0x2D3C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQTIMER</name>
							<description>Sequence Timer - SEQTIMER</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10QCTRL2</name>
					<description>Queue 2 Source Contr. Register, Group 10</description>
					<addressOffset>0x2D40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRCRESREG</name>
							<description>Source-specific Result Register - SRCRESREG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRSEL</name>
							<description>Trigger Source Selection - TRSEL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTSEL</name>
							<description>External Trigger Input Selection - XTSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTLVL</name>
							<description>External Trigger Level - XTLVL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>XTMODE</name>
							<description>Trigger Operating Mode - XTMODE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTWC</name>
							<description>Write Control for Trigger Configuration - XTWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>GTSEL</name>
							<description>Gate Input Selection - GTSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTLVL</name>
							<description>Gate Input Level - GTLVL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTWC</name>
							<description>Write Control for Gate Configuration - GTWC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TMEN</name>
							<description>Timer Mode Enable - TMEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMWC</name>
							<description>Write Control for Timer Mode - TMWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10QMR2</name>
					<description>Queue 2 Mode Register, Group 10</description>
					<addressOffset>0x2D44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENGT</name>
							<description>Enable Gate - ENGT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRV</name>
							<description>Clear Valid Bit - CLRV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TREV</name>
							<description>Trigger Event - TREV</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLUSH</name>
							<description>Flush Queue - FLUSH</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV</name>
							<description>Clear Event Flag - CEV</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RPTDIS</name>
							<description>Repeat Disable - RPTDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10QSR2</name>
					<description>Queue 2 Status Register, Group 10</description>
					<addressOffset>0x2D48</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x20</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FILL</name>
							<description>Filling Level for Queue - FILL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMPTY</name>
							<description>Queue Empty - EMPTY</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REQGT</name>
							<description>Request Gate Level - REQGT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EV</name>
							<description>Event Detected - EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10Q0R2</name>
					<description>Queue 2 Register 0, Group 10</description>
					<addressOffset>0x2D4C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10QINR2</name>
					<description>Queue 2 Input Register, Group 10</description>
					<addressOffset>0x2D50</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10QBUR2</name>
					<description>Queue 2 Backup Register, Group 10</description>
					<addressOffset>0x2D54</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Down Devices Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Up Devices Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10REQTM2</name>
					<description>Queue 2 Requ. Timer Mode Reg., Group 10</description>
					<addressOffset>0x2D58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffc00000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQMOD</name>
							<description>Sequence Mode - SEQMOD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMSET</name>
							<description>Sequence Timer, Set Value - SEQTIMSET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REQTS</name>
							<description>Request Timer Start Trigger - REQTS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMOFF</name>
							<description>Sequence Timer, Switch Off Value - SEQTIMOFF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10REQTS2</name>
					<description>Queue 2 Requ. Timer Status Reg., Group 10</description>
					<addressOffset>0x2D5C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQTIMER</name>
							<description>Sequence Timer - SEQTIMER</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G10CEFLAG</name>
					<description>Channel Event Flag Register, Group 10</description>
					<addressOffset>0x2D80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CEV0</name>
							<description>Channel Event for Channel 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV1</name>
							<description>Channel Event for Channel 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV2</name>
							<description>Channel Event for Channel 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV3</name>
							<description>Channel Event for Channel 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV4</name>
							<description>Channel Event for Channel 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV5</name>
							<description>Channel Event for Channel 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV6</name>
							<description>Channel Event for Channel 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV7</name>
							<description>Channel Event for Channel 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV8</name>
							<description>Channel Event for Channel 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV9</name>
							<description>Channel Event for Channel 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV10</name>
							<description>Channel Event for Channel 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV11</name>
							<description>Channel Event for Channel 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV12</name>
							<description>Channel Event for Channel 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV13</name>
							<description>Channel Event for Channel 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV14</name>
							<description>Channel Event for Channel 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV15</name>
							<description>Channel Event for Channel 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
