J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>FC1FCHYST</name>
					<description>Fast Comp. Hysteresis Register, FC Channel 1</description>
					<addressOffset>0x3524</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DELTAMINUS</name>
							<description>Lower Delta Value - DELTAMINUS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DELTAPLUS</name>
							<description>Upper Delta Value - DELTAPLUS</description>
							<bitOffset>18</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC2FCCTRL</name>
					<description>Fast Compare Control Register, FC Channel 2</description>
					<addressOffset>0x3600</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xc20</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STCF</name>
							<description>Sample Time Control for Fast Comparisons - STCF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RPE</name>
							<description>Reference Precharge Enable - RPE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIPF</name>
							<description>Analog Input Precharge Enable for Fast Comparisons - AIPF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVA</name>
							<description>Divider Factor for the Analog Internal Clock - DIVA</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPWC</name>
							<description>Write Control for Control Parameters - CPWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>XTSEL</name>
							<description>External Trigger Input Selection - XTSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTLVL</name>
							<description>External Trigger Level - XTLVL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>XTMODE</name>
							<description>Trigger Operating Mode - XTMODE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTPOL</name>
							<description>External Trigger Polarity - XTPOL</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTMODE</name>
							<description>Gate Operating Mode - GTMODE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCCHNR</name>
							<description>Fast Compare Channel: Cannel Number - FCCHNR</description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTWC</name>
							<description>Write Control for Trigger/Gate Configuration - XTWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC2FCM</name>
					<description>Fast Compare Mode Register, FC Channel 2</description>
					<addressOffset>0x3604</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RUNCOMP</name>
							<description>Run Control for Compare Channel - RUNCOMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RUNRAMP</name>
							<description>Run Control for Ramp - RUNRAMP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCRDIR</name>
							<description>Fast Compare Ramp Direction - FCRDIR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANON</name>
							<description>Analog Converter Control - ANON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACSD</name>
							<description>Analog Clock Synchronization Delay - ACSD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCTRIV</name>
							<description>Fast Compare Trigger Interval - FCTRIV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRG</name>
							<description>Service Request Generation - SRG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUE</name>
							<description>Automatic Update Enable - AUE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSE</name>
							<description>Sample Synchronization Enable - SSE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCMWC</name>
							<description>Write Control for Fast Compare Mode Configuration - FCMWC</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FCREF</name>
							<description>Fast Compare Reference Value - FCREF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC2FCRAMP0</name>
					<description>Fast Compare Ramp Register 0, FC Channel 2</description>
					<addressOffset>0x3608</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FCRCOMPA</name>
							<description>Fast Compare Ramp Compare Value A - FCRCOMPA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCRSTEP</name>
							<description>Fast Compare Ramp Step Width - FCRSTEP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSWC</name>
							<description>Write Control for Fast Compare Stepwidth - FSWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC2FCRAMP1</name>
					<description>Fast Compare Ramp Register 1, FC Channel 2</description>
					<addressOffset>0x360C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FCRCOMPB</name>
							<description>Fast Compare Ramp Compare Value B - FCRCOMPB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC2FCBFL</name>
					<description>Boundary Flag Register, FC Channel 2</description>
					<addressOffset>0x3620</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BFL</name>
							<description>Boundary Flag - BFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BFA</name>
							<description>Boundary Flag Activation Select - BFA</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFI</name>
							<description>Boundary Flag Inversion Control - BFI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFS</name>
							<description>Boundary Flag Software Control - BFS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BFM</name>
							<description>Boundary Flag Mode Control - BFM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFV</name>
							<description>Boundary Flag Value - BFV</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFLNP</name>
							<description>Boundary Flag Node Pointer</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCR</name>
							<description>Fast Compare Result - FCR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC2FCHYST</name>
					<description>Fast Comp. Hysteresis Register, FC Channel 2</description>
					<addressOffset>0x3624</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DELTAMINUS</name>
							<description>Lower Delta Value - DELTAMINUS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DELTAPLUS</name>
							<description>Upper Delta Value - DELTAPLUS</description>
							<bitOffset>18</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC3FCCTRL</name>
					<description>Fast Compare Control Register, FC Channel 3</description>
					<addressOffset>0x3700</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xc20</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STCF</name>
							<description>Sample Time Control for Fast Comparisons - STCF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RPE</name>
							<description>Reference Precharge Enable - RPE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIPF</name>
							<description>Analog Input Precharge Enable for Fast Comparisons - AIPF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVA</name>
							<description>Divider Factor for the Analog Internal Clock - DIVA</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPWC</name>
							<description>Write Control for Control Parameters - CPWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>XTSEL</name>
							<description>External Trigger Input Selection - XTSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTLVL</name>
							<description>External Trigger Level - XTLVL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>XTMODE</name>
							<description>Trigger Operating Mode - XTMODE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTPOL</name>
							<description>External Trigger Polarity - XTPOL</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTMODE</name>
							<description>Gate Operating Mode - GTMODE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCCHNR</name>
							<description>Fast Compare Channel: Cannel Number - FCCHNR</description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTWC</name>
							<description>Write Control for Trigger/Gate Configuration - XTWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC3FCM</name>
					<description>Fast Compare Mode Register, FC Channel 3</description>
					<addressOffset>0x3704</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RUNCOMP</name>
							<description>Run Control for Compare Channel - RUNCOMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RUNRAMP</name>
							<description>Run Control for Ramp - RUNRAMP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCRDIR</name>
							<description>Fast Compare Ramp Direction - FCRDIR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANON</name>
							<description>Analog Converter Control - ANON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACSD</name>
							<description>Analog Clock Synchronization Delay - ACSD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCTRIV</name>
							<description>Fast Compare Trigger Interval - FCTRIV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRG</name>
							<description>Service Request Generation - SRG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUE</name>
							<description>Automatic Update Enable - AUE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSE</name>
							<description>Sample Synchronization Enable - SSE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCMWC</name>
							<description>Write Control for Fast Compare Mode Configuration - FCMWC</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FCREF</name>
							<description>Fast Compare Reference Value - FCREF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC3FCRAMP0</name>
					<description>Fast Compare Ramp Register 0, FC Channel 3</description>
					<addressOffset>0x3708</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FCRCOMPA</name>
							<description>Fast Compare Ramp Compare Value A - FCRCOMPA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCRSTEP</name>
							<description>Fast Compare Ramp Step Width - FCRSTEP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSWC</name>
							<description>Write Control for Fast Compare Stepwidth - FSWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC3FCRAMP1</name>
					<description>Fast Compare Ramp Register 1, FC Channel 3</description>
					<addressOffset>0x370C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FCRCOMPB</name>
							<description>Fast Compare Ramp Compare Value B - FCRCOMPB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC3FCBFL</name>
					<description>Boundary Flag Register, FC Channel 3</description>
					<addressOffset>0x3720</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BFL</name>
							<description>Boundary Flag - BFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BFA</name>
							<description>Boundary Flag Activation Select - BFA</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFI</name>
							<description>Boundary Flag Inversion Control - BFI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFS</name>
							<description>Boundary Flag Software Control - BFS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BFM</name>
							<description>Boundary Flag Mode Control - BFM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFV</name>
							<description>Boundary Flag Value - BFV</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BFLNP</name>
							<description>Boundary Flag Node Pointer</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FCR</name>
							<description>Fast Compare Result - FCR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FC3FCHYST</name>
					<description>Fast Comp. Hysteresis Register, FC Channel 3</description>
					<addressOffset>0x3724</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DELTAMINUS</name>
							<description>Lower Delta Value - DELTAMINUS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DELTAPLUS</name>
							<description>Upper Delta Value - DELTAPLUS</description>
							<bitOffset>18</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
