J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>VCM1</name>
					<description>Common Mode Voltage Register 1</description>
					<addressOffset>0x2B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VREFXSEL</name>
							<description>Fractional Reference Voltage Selection - VREFXSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VXON</name>
							<description>Fractional Reference Voltage Enable - VXON</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC0</name>
							<description>Voltage Control of Positive Inputs 0 of CH1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC1</name>
							<description>Voltage Control of Positive Inputs 1 of CH1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC2</name>
							<description>Voltage Control of Positive Inputs 2 of CH1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC3</name>
							<description>Voltage Control of Positive Inputs 3 of CH1</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC0</name>
							<description>Voltage Control of Negative Inputs 0 of CH1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC1</name>
							<description>Voltage Control of Negative Inputs 1 of CH1</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC2</name>
							<description>Voltage Control of Negative Inputs 2 of CH1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC3</name>
							<description>Voltage Control of Negative Inputs 3 of CH1</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODCFG2</name>
					<description>Modulator Configuration Register 2</description>
					<addressOffset>0x300</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INCFGP</name>
							<description>Configuration of Positive Input Line - INCFGP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCFGN</name>
							<description>Configuration of Negative Input Line - INCFGN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>Gain Select of Analog Input Path - GAINSEL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL</name>
							<description>Input Pin Selection - INSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMUX</name>
							<description>Input Multiplexer Setting - INMUX</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INMODE</name>
							<description>Input Multiplexer Control Mode - INMODE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMAC</name>
							<description>Input Multiplexer Action Control - INMAC</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCWC</name>
							<description>Write Control for Input Parameters - INCWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIVM</name>
							<description>Modulator Clock Period - DIVM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACSD</name>
							<description>Analog Clock Synchronization Delay - ACSD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DITHEN</name>
							<description>Dithering Function Enable - DITHEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREN</name>
							<description>Integrator Reset Enable - IREN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APC</name>
							<description>Automatic Power Control - APC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MMWC</name>
							<description>Write Control for Modulator Mode Settings - MMWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DICFG2</name>
					<description>Demodulator Input Config. Register 2</description>
					<addressOffset>0x308</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DSS</name>
							<description>Data Stream Select - DSS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSRCEX</name>
							<description>Data Source for External Modulator - DSRCEX</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSRCEX</name>
							<description>Clock Source for External Modulator - CSRCEX</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSWC</name>
							<description>Write Control for Data Stream Selection - DSWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRSEL</name>
							<description>Trigger Select - TRSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ITRMODE</name>
							<description>Integrator Trigger Mode - ITRMODE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTRMODE</name>
							<description>Timestamp Trigger Mode - TSTRMODE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRM</name>
							<description>Data Read Mode - DRM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSM</name>
							<description>Time-Stamp Mode - TSM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDM</name>
							<description>Result Display Mode - RDM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSWC</name>
							<description>Write Control for Mode Settings - MSWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGM2</name>
					<description>Filter Configuration Register 2, Main</description>
					<addressOffset>0x310</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FIR0EN</name>
							<description>FIR0 Filter Enable - FIR0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIR1EN</name>
							<description>FIR1 Filter Enable - FIR1EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVCEN</name>
							<description>Overshoot Compensation Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIR1DEC</name>
							<description>FIR1 Filter Decimation Rate - FIR1DEC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICMOD</name>
							<description>CIC Filter Mode - CICMOD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PFEN</name>
							<description>Prefilter Enable - PFEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OCEN</name>
							<description>Offset Compensation Filter Enable - OCEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFPROT</name>
							<description>Offset Protection - OFFPROT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMWC</name>
							<description>Write Control for Filter Modes - FMWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SRGM</name>
							<description>Service Request Generation for Main Service Request - SRGM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGA</name>
							<description>Service Request Generation for Alternate Service Request - SRGA</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESEL</name>
							<description>Event Select - ESEL</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EGT</name>
							<description>Event Gating</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALIB</name>
							<description>Calibration Trigger - CALIB</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUTOCAL</name>
							<description>Automatic Calibration Control - AUTOCAL</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSRWC</name>
							<description>Write Control for Calibration and Service Request Modes - CSRWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGC2</name>
					<description>Filter Configuration Register 2, CIC Filter</description>
					<addressOffset>0x314</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFMDF</name>
							<description>CIC Filter Decimation Factor - CFMDF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFMSV</name>
							<description>CIC Filter Start Value - CFMSV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCNTC2</name>
					<description>Filter Counter Register 2, CIC Filter</description>
					<addressOffset>0x318</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFMDCNT</name>
							<description>CIC Filter Decimation Counter - CFMDCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAL</name>
							<description>Calibration Status Flag - CAL</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVSCFG2</name>
					<description>Overshoot Compensation Cfg. Register 2</description>
					<addressOffset>0x31C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRFS</name>
							<description>Slew Rate Filter Strength</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRFRT</name>
							<description>Slew Rate Filter Run Time</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDM</name>
							<description>Step Detection Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDTH</name>
							<description>Step Detection Threshold</description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IWCTR2</name>
					<description>Integration Window Control Register 2</description>
					<addressOffset>0x320</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ISC</name>
							<description>Integrator Shift Control - ISC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWS</name>
							<description>Integration Window Size - IWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FRC</name>
							<description>Filter Chain Restart Control</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REPVAL</name>
							<description>Number of Integration Cycles - REPVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NVALDIS</name>
							<description>Number of Values Discarded - NVALDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NVALINT</name>
							<description>Number of Values to be Accumulated - NVALINT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IIVAL2</name>
					<description>Intermediate Integration Value</description>
					<addressOffset>0x324</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVAL</name>
							<description>Result of most recent accumulation - IVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>26</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISTAT2</name>
					<description>Integrator Status Register 2</description>
					<addressOffset>0x328</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NVALCNT</name>
							<description>Number of Values Counted - NVALCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REPCNT</name>
							<description>Integration Cycle Counter - REPCNT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTEN</name>
							<description>Integration Enable - INTEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RFC2</name>
					<description>Result FIFO Control Register 2</description>
					<addressOffset>0x32C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRLVL</name>
							<description>Service Request FIFO Level</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDEC</name>
							<description>Read Error Flag Clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WREC</name>
							<description>Write Error Flag Clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FIFL</name>
							<description>FIFO Flush</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FILL</name>
							<description>FIFO Fill Level</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDERR</name>
							<description>Read Error Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRERR</name>
							<description>Write Error Flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESM2</name>
					<description>Result Register 2 Main</description>
					<addressOffset>0x330</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULTLO</name>
							<description>Result Value Lower Part - RESULTLO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RESULTHI</name>
							<description>Result Value Higher Part - RESULTHI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFCOMP2</name>
					<description>Offset Compensation Register 2</description>
					<addressOffset>0x338</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFFSET</name>
							<description>Offset Value - OFFSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCAL2</name>
					<description>Gain Calibration Register 2</description>
					<addressOffset>0x33C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x61a81000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CALFACTOR</name>
							<description>Multiplication Factor for Gain Calibration - CALFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALTARGET</name>
							<description>Target Value for Calibrated Fullscale - CALTARGET</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCTR2</name>
					<description>Gain Control Register 2</description>
					<addressOffset>0x340</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction During Calibration - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter During Calibration - CICSHIFT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICDEC</name>
							<description>Decimation Rate of the CIC Filter During Calibration - CICDEC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
