J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>IWCTR3</name>
					<description>Integration Window Control Register 3</description>
					<addressOffset>0x420</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ISC</name>
							<description>Integrator Shift Control - ISC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWS</name>
							<description>Integration Window Size - IWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FRC</name>
							<description>Filter Chain Restart Control</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REPVAL</name>
							<description>Number of Integration Cycles - REPVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NVALDIS</name>
							<description>Number of Values Discarded - NVALDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NVALINT</name>
							<description>Number of Values to be Accumulated - NVALINT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IIVAL3</name>
					<description>Intermediate Integration Value</description>
					<addressOffset>0x424</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVAL</name>
							<description>Result of most recent accumulation - IVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>26</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISTAT3</name>
					<description>Integrator Status Register 3</description>
					<addressOffset>0x428</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NVALCNT</name>
							<description>Number of Values Counted - NVALCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REPCNT</name>
							<description>Integration Cycle Counter - REPCNT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTEN</name>
							<description>Integration Enable - INTEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RFC3</name>
					<description>Result FIFO Control Register 3</description>
					<addressOffset>0x42C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRLVL</name>
							<description>Service Request FIFO Level</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDEC</name>
							<description>Read Error Flag Clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WREC</name>
							<description>Write Error Flag Clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FIFL</name>
							<description>FIFO Flush</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FILL</name>
							<description>FIFO Fill Level</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDERR</name>
							<description>Read Error Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRERR</name>
							<description>Write Error Flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESM3</name>
					<description>Result Register 3 Main</description>
					<addressOffset>0x430</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULTLO</name>
							<description>Result Value Lower Part - RESULTLO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RESULTHI</name>
							<description>Result Value Higher Part - RESULTHI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFCOMP3</name>
					<description>Offset Compensation Register 3</description>
					<addressOffset>0x438</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFFSET</name>
							<description>Offset Value - OFFSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCAL3</name>
					<description>Gain Calibration Register 3</description>
					<addressOffset>0x43C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x61a81000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CALFACTOR</name>
							<description>Multiplication Factor for Gain Calibration - CALFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALTARGET</name>
							<description>Target Value for Calibrated Fullscale - CALTARGET</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCTR3</name>
					<description>Gain Control Register 3</description>
					<addressOffset>0x440</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction During Calibration - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter During Calibration - CICSHIFT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICDEC</name>
							<description>Decimation Rate of the CIC Filter During Calibration - CICDEC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCORR3</name>
					<description>Gain Correction Register 3</description>
					<addressOffset>0x444</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSTMP3</name>
					<description>Time-Stamp Register 3</description>
					<addressOffset>0x450</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIMESTAMP</name>
							<description>The Most Recent Captured Timestamp Value - TIMESTAMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AMX</name>
							<description>Analog Multiplexer Setting - AMX</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSVAL</name>
							<description>Timestamp Valid - TSVAL</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCNT3</name>
					<description>Time-Stamp Counter 3</description>
					<addressOffset>0x454</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSCOUNT</name>
							<description>Timestamp Counter Value - TSCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSCLK</name>
							<description>Timestamp Counter Clock Selection - TSCLK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCRUN</name>
							<description>Timestamp Counter Run Control - TSCRUN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AMXCOPY</name>
							<description>Analog MUX Setting Copy Enable - AMXCOPY</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGA3</name>
					<description>Auxiliary Filter Configuration Register 3</description>
					<addressOffset>0x470</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFAEN</name>
							<description>CIC Filter (Auxiliary) Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFADF</name>
							<description>CIC Filter (Auxiliary) Decimation Factor</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFACNT</name>
							<description>CIC Filter (Auxiliary) Decimation Counter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BOUNDSEL3</name>
					<description>Boundary Select Register 3</description>
					<addressOffset>0x478</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUNDARYL</name>
							<description>Lower Boundary Value for Limit Checking - BOUNDARYL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOUNDARYU</name>
							<description>Upper Boundary Value for Limit Checking - BOUNDARYU</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESA3</name>
					<description>Result Register 3 Auxiliary</description>
					<addressOffset>0x480</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Most Recent Result of Auxiliary Filter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CGSYNC3</name>
					<description>Carrier Generator Synchronization Reg. 3</description>
					<addressOffset>0x4A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDCOUNT</name>
							<description>Sign Delay Counter - SDCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDCAP</name>
							<description>Sign Delay Capture Value - SDCAP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDPOS</name>
							<description>Sign Delay Value for Positive Halfwave - SDPOS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDNEG</name>
							<description>Sign Delay Value for Negative Halfwave - SDNEG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECTCFG3</name>
					<description>Rectification Configuration Register 3</description>
					<addressOffset>0x4A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RFEN</name>
							<description>Rectification Enable - RFEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSRC</name>
							<description>Sign Source</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSCH</name>
							<description>Sign Source Channel</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDCVAL</name>
							<description>Valid Flag - SDCVAL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGNCS</name>
							<description>Selected Carrier Sign Signal - SGNCS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGND</name>
							<description>Sign Signal Delayed - SGND</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCM3</name>
					<description>Common Mode Voltage Register 3</description>
					<addressOffset>0x4B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VREFXSEL</name>
							<description>Fractional Reference Voltage Selection - VREFXSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VXON</name>
							<description>Fractional Reference Voltage Enable - VXON</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC0</name>
							<description>Voltage Control of Positive Inputs 0 of CH3</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC1</name>
							<description>Voltage Control of Positive Inputs 1 of CH3</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC2</name>
							<description>Voltage Control of Positive Inputs 2 of CH3</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC3</name>
							<description>Voltage Control of Positive Inputs 3 of CH3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC0</name>
							<description>Voltage Control of Negative Inputs 0 of CH3</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC1</name>
							<description>Voltage Control of Negative Inputs 1 of CH3</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC2</name>
							<description>Voltage Control of Negative Inputs 2 of CH3</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC3</name>
							<description>Voltage Control of Negative Inputs 3 of CH3</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODCFG4</name>
					<description>Modulator Configuration Register 4</description>
					<addressOffset>0x500</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INCFGP</name>
							<description>Configuration of Positive Input Line - INCFGP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCFGN</name>
							<description>Configuration of Negative Input Line - INCFGN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>Gain Select of Analog Input Path - GAINSEL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL</name>
							<description>Input Pin Selection - INSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMUX</name>
							<description>Input Multiplexer Setting - INMUX</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INMODE</name>
							<description>Input Multiplexer Control Mode - INMODE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMAC</name>
							<description>Input Multiplexer Action Control - INMAC</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCWC</name>
							<description>Write Control for Input Parameters - INCWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIVM</name>
							<description>Modulator Clock Period - DIVM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACSD</name>
							<description>Analog Clock Synchronization Delay - ACSD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DITHEN</name>
							<description>Dithering Function Enable - DITHEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREN</name>
							<description>Integrator Reset Enable - IREN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APC</name>
							<description>Automatic Power Control - APC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MMWC</name>
							<description>Write Control for Modulator Mode Settings - MMWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
