J3FF-J4N/tc375-freertos/tc37x-pac/TC37X.svd
				<register>
					<name>GAINCAL5</name>
					<description>Gain Calibration Register 5</description>
					<addressOffset>0x63C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x61a81000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CALFACTOR</name>
							<description>Multiplication Factor for Gain Calibration - CALFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALTARGET</name>
							<description>Target Value for Calibrated Fullscale - CALTARGET</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCTR5</name>
					<description>Gain Control Register 5</description>
					<addressOffset>0x640</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction During Calibration - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter During Calibration - CICSHIFT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICDEC</name>
							<description>Decimation Rate of the CIC Filter During Calibration - CICDEC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCORR5</name>
					<description>Gain Correction Register 5</description>
					<addressOffset>0x644</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSTMP5</name>
					<description>Time-Stamp Register 5</description>
					<addressOffset>0x650</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIMESTAMP</name>
							<description>The Most Recent Captured Timestamp Value - TIMESTAMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AMX</name>
							<description>Analog Multiplexer Setting - AMX</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSVAL</name>
							<description>Timestamp Valid - TSVAL</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCNT5</name>
					<description>Time-Stamp Counter 5</description>
					<addressOffset>0x654</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSCOUNT</name>
							<description>Timestamp Counter Value - TSCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSCLK</name>
							<description>Timestamp Counter Clock Selection - TSCLK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCRUN</name>
							<description>Timestamp Counter Run Control - TSCRUN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AMXCOPY</name>
							<description>Analog MUX Setting Copy Enable - AMXCOPY</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGA5</name>
					<description>Auxiliary Filter Configuration Register 5</description>
					<addressOffset>0x670</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFAEN</name>
							<description>CIC Filter (Auxiliary) Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFADF</name>
							<description>CIC Filter (Auxiliary) Decimation Factor</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFACNT</name>
							<description>CIC Filter (Auxiliary) Decimation Counter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BOUNDSEL5</name>
					<description>Boundary Select Register 5</description>
					<addressOffset>0x678</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUNDARYL</name>
							<description>Lower Boundary Value for Limit Checking - BOUNDARYL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOUNDARYU</name>
							<description>Upper Boundary Value for Limit Checking - BOUNDARYU</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESA5</name>
					<description>Result Register 5 Auxiliary</description>
					<addressOffset>0x680</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Most Recent Result of Auxiliary Filter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CGSYNC5</name>
					<description>Carrier Generator Synchronization Reg. 5</description>
					<addressOffset>0x6A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDCOUNT</name>
							<description>Sign Delay Counter - SDCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDCAP</name>
							<description>Sign Delay Capture Value - SDCAP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDPOS</name>
							<description>Sign Delay Value for Positive Halfwave - SDPOS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDNEG</name>
							<description>Sign Delay Value for Negative Halfwave - SDNEG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECTCFG5</name>
					<description>Rectification Configuration Register 5</description>
					<addressOffset>0x6A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RFEN</name>
							<description>Rectification Enable - RFEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSRC</name>
							<description>Sign Source</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSCH</name>
							<description>Sign Source Channel</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDCVAL</name>
							<description>Valid Flag - SDCVAL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGNCS</name>
							<description>Selected Carrier Sign Signal - SGNCS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGND</name>
							<description>Sign Signal Delayed - SGND</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCM5</name>
					<description>Common Mode Voltage Register 5</description>
					<addressOffset>0x6B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VREFXSEL</name>
							<description>Fractional Reference Voltage Selection - VREFXSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VXON</name>
							<description>Fractional Reference Voltage Enable - VXON</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC0</name>
							<description>Voltage Control of Positive Inputs 0 of CH5</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC1</name>
							<description>Voltage Control of Positive Inputs 1 of CH5</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC2</name>
							<description>Voltage Control of Positive Inputs 2 of CH5</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC3</name>
							<description>Voltage Control of Positive Inputs 3 of CH5</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC0</name>
							<description>Voltage Control of Negative Inputs 0 of CH5</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC1</name>
							<description>Voltage Control of Negative Inputs 1 of CH5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC2</name>
							<description>Voltage Control of Negative Inputs 2 of CH5</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC3</name>
							<description>Voltage Control of Negative Inputs 3 of CH5</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
